HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxCan_reg.h
/** Alias (User Manual Name) for CAN_MO150_FGPR.
* To use register names with standard convension, please use CAN_MO150_FGPR.
*/
#define	CAN_MOFGPR150	(CAN_MO150_FGPR)

/** \\brief  22C8, Message Object  Interrupt Pointer Register */
#define CAN_MO150_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001A2C8u)

/** Alias (User Manual Name) for CAN_MO150_IPR.
* To use register names with standard convension, please use CAN_MO150_IPR.
*/
#define	CAN_MOIPR150	(CAN_MO150_IPR)

/** \\brief  22DC, Message Object  Control Register */
#define CAN_MO150_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001A2DCu)

/** Alias (User Manual Name) for CAN_MO150_STAT.
* To use register names with standard convension, please use CAN_MO150_STAT.
*/
#define	CAN_MOSTAT150	(CAN_MO150_STAT)

/** \\brief  22EC, Message Object  Acceptance Mask Register */
#define CAN_MO151_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001A2ECu)

/** Alias (User Manual Name) for CAN_MO151_AMR.
* To use register names with standard convension, please use CAN_MO151_AMR.
*/
#define	CAN_MOAMR151	(CAN_MO151_AMR)

/** \\brief  22F8, Message Object  Arbitration Register */
#define CAN_MO151_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001A2F8u)

/** Alias (User Manual Name) for CAN_MO151_AR.
* To use register names with standard convension, please use CAN_MO151_AR.
*/
#define	CAN_MOAR151	(CAN_MO151_AR)

/** \\brief  22FC, Message Object  Control Register */
#define CAN_MO151_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001A2FCu)

/** Alias (User Manual Name) for CAN_MO151_CTR.
* To use register names with standard convension, please use CAN_MO151_CTR.
*/
#define	CAN_MOCTR151	(CAN_MO151_CTR)

/** \\brief  22F4, Message Object  Data Register High */
#define CAN_MO151_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001A2F4u)

/** Alias (User Manual Name) for CAN_MO151_DATAH.
* To use register names with standard convension, please use CAN_MO151_DATAH.
*/
#define	CAN_MODATAH151	(CAN_MO151_DATAH)

/** \\brief  22F0, Message Object  Data Register Low */
#define CAN_MO151_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001A2F0u)

/** Alias (User Manual Name) for CAN_MO151_DATAL.
* To use register names with standard convension, please use CAN_MO151_DATAL.
*/
#define	CAN_MODATAL151	(CAN_MO151_DATAL)

/** \\brief  22E0, Message Object  Function Control Register */
#define CAN_MO151_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001A2E0u)

/** Alias (User Manual Name) for CAN_MO151_FCR.
* To use register names with standard convension, please use CAN_MO151_FCR.
*/
#define	CAN_MOFCR151	(CAN_MO151_FCR)

/** \\brief  22E4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO151_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001A2E4u)

/** Alias (User Manual Name) for CAN_MO151_FGPR.
* To use register names with standard convension, please use CAN_MO151_FGPR.
*/
#define	CAN_MOFGPR151	(CAN_MO151_FGPR)

/** \\brief  22E8, Message Object  Interrupt Pointer Register */
#define CAN_MO151_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001A2E8u)

/** Alias (User Manual Name) for CAN_MO151_IPR.
* To use register names with standard convension, please use CAN_MO151_IPR.
*/
#define	CAN_MOIPR151	(CAN_MO151_IPR)

/** \\brief  22FC, Message Object  Control Register */
#define CAN_MO151_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001A2FCu)

/** Alias (User Manual Name) for CAN_MO151_STAT.
* To use register names with standard convension, please use CAN_MO151_STAT.
*/
#define	CAN_MOSTAT151	(CAN_MO151_STAT)

/** \\brief  230C, Message Object  Acceptance Mask Register */
#define CAN_MO152_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001A30Cu)

/** Alias (User Manual Name) for CAN_MO152_AMR.
* To use register names with standard convension, please use CAN_MO152_AMR.
*/
#define	CAN_MOAMR152	(CAN_MO152_AMR)

/** \\brief  2318, Message Object  Arbitration Register */
#define CAN_MO152_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001A318u)

/** Alias (User Manual Name) for CAN_MO152_AR.
* To use register names with standard convension, please use CAN_MO152_AR.
*/
#define	CAN_MOAR152	(CAN_MO152_AR)

/** \\brief  231C, Message Object  Control Register */
#define CAN_MO152_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001A31Cu)

/** Alias (User Manual Name) for CAN_MO152_CTR.
* To use register names with standard convension, please use CAN_MO152_CTR.
*/
#define	CAN_MOCTR152	(CAN_MO152_CTR)

/** \\brief  2314, Message Object  Data Register High */
#define CAN_MO152_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001A314u)

/** Alias (User Manual Name) for CAN_MO152_DATAH.
* To use register names with standard convension, please use CAN_MO152_DATAH.
*/
#define	CAN_MODATAH152	(CAN_MO152_DATAH)

/** \\brief  2310, Message Object  Data Register Low */
#define CAN_MO152_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001A310u)

/** Alias (User Manual Name) for CAN_MO152_DATAL.
* To use register names with standard convension, please use CAN_MO152_DATAL.
*/
#define	CAN_MODATAL152	(CAN_MO152_DATAL)

/** \\brief  2300, Message Object  Function Control Register */
#define CAN_MO152_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001A300u)

/** Alias (User Manual Name) for CAN_MO152_FCR.
* To use register names with standard convension, please use CAN_MO152_FCR.
*/
#define	CAN_MOFCR152	(CAN_MO152_FCR)

/** \\brief  2304, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO152_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001A304u)

/** Alias (User Manual Name) for CAN_MO152_FGPR.
* To use register names with standard convension, please use CAN_MO152_FGPR.
*/
#define	CAN_MOFGPR152	(CAN_MO152_FGPR)

/** \\brief  2308, Message Object  Interrupt Pointer Register */
#define CAN_MO152_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001A308u)

/** Alias (User Manual Name) for CAN_MO152_IPR.
* To use register names with standard convension, please use CAN_MO152_IPR.
*/
#define	CAN_MOIPR152	(CAN_MO152_IPR)

/** \\brief  231C, Message Object  Control Register */
#define CAN_MO152_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001A31Cu)

/** Alias (User Manual Name) for CAN_MO152_STAT.
* To use register names with standard convension, please use CAN_MO152_STAT.
*/
#define	CAN_MOSTAT152	(CAN_MO152_STAT)

