HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxCan_reg.h
/** Alias (User Manual Name) for CAN_MO210_IPR.
* To use register names with standard convension, please use CAN_MO210_IPR.
*/
#define	CAN_MOIPR210	(CAN_MO210_IPR)

/** \\brief  2A5C, Message Object  Control Register */
#define CAN_MO210_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001AA5Cu)

/** Alias (User Manual Name) for CAN_MO210_STAT.
* To use register names with standard convension, please use CAN_MO210_STAT.
*/
#define	CAN_MOSTAT210	(CAN_MO210_STAT)

/** \\brief  2A6C, Message Object  Acceptance Mask Register */
#define CAN_MO211_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001AA6Cu)

/** Alias (User Manual Name) for CAN_MO211_AMR.
* To use register names with standard convension, please use CAN_MO211_AMR.
*/
#define	CAN_MOAMR211	(CAN_MO211_AMR)

/** \\brief  2A78, Message Object  Arbitration Register */
#define CAN_MO211_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001AA78u)

/** Alias (User Manual Name) for CAN_MO211_AR.
* To use register names with standard convension, please use CAN_MO211_AR.
*/
#define	CAN_MOAR211	(CAN_MO211_AR)

/** \\brief  2A7C, Message Object  Control Register */
#define CAN_MO211_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001AA7Cu)

/** Alias (User Manual Name) for CAN_MO211_CTR.
* To use register names with standard convension, please use CAN_MO211_CTR.
*/
#define	CAN_MOCTR211	(CAN_MO211_CTR)

/** \\brief  2A74, Message Object  Data Register High */
#define CAN_MO211_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001AA74u)

/** Alias (User Manual Name) for CAN_MO211_DATAH.
* To use register names with standard convension, please use CAN_MO211_DATAH.
*/
#define	CAN_MODATAH211	(CAN_MO211_DATAH)

/** \\brief  2A70, Message Object  Data Register Low */
#define CAN_MO211_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001AA70u)

/** Alias (User Manual Name) for CAN_MO211_DATAL.
* To use register names with standard convension, please use CAN_MO211_DATAL.
*/
#define	CAN_MODATAL211	(CAN_MO211_DATAL)

/** \\brief  2A60, Message Object  Function Control Register */
#define CAN_MO211_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001AA60u)

/** Alias (User Manual Name) for CAN_MO211_FCR.
* To use register names with standard convension, please use CAN_MO211_FCR.
*/
#define	CAN_MOFCR211	(CAN_MO211_FCR)

/** \\brief  2A64, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO211_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001AA64u)

/** Alias (User Manual Name) for CAN_MO211_FGPR.
* To use register names with standard convension, please use CAN_MO211_FGPR.
*/
#define	CAN_MOFGPR211	(CAN_MO211_FGPR)

/** \\brief  2A68, Message Object  Interrupt Pointer Register */
#define CAN_MO211_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001AA68u)

/** Alias (User Manual Name) for CAN_MO211_IPR.
* To use register names with standard convension, please use CAN_MO211_IPR.
*/
#define	CAN_MOIPR211	(CAN_MO211_IPR)

/** \\brief  2A7C, Message Object  Control Register */
#define CAN_MO211_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001AA7Cu)

/** Alias (User Manual Name) for CAN_MO211_STAT.
* To use register names with standard convension, please use CAN_MO211_STAT.
*/
#define	CAN_MOSTAT211	(CAN_MO211_STAT)

/** \\brief  2A8C, Message Object  Acceptance Mask Register */
#define CAN_MO212_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001AA8Cu)

/** Alias (User Manual Name) for CAN_MO212_AMR.
* To use register names with standard convension, please use CAN_MO212_AMR.
*/
#define	CAN_MOAMR212	(CAN_MO212_AMR)

/** \\brief  2A98, Message Object  Arbitration Register */
#define CAN_MO212_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001AA98u)

/** Alias (User Manual Name) for CAN_MO212_AR.
* To use register names with standard convension, please use CAN_MO212_AR.
*/
#define	CAN_MOAR212	(CAN_MO212_AR)

/** \\brief  2A9C, Message Object  Control Register */
#define CAN_MO212_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001AA9Cu)

/** Alias (User Manual Name) for CAN_MO212_CTR.
* To use register names with standard convension, please use CAN_MO212_CTR.
*/
#define	CAN_MOCTR212	(CAN_MO212_CTR)

/** \\brief  2A94, Message Object  Data Register High */
#define CAN_MO212_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001AA94u)

/** Alias (User Manual Name) for CAN_MO212_DATAH.
* To use register names with standard convension, please use CAN_MO212_DATAH.
*/
#define	CAN_MODATAH212	(CAN_MO212_DATAH)

/** \\brief  2A90, Message Object  Data Register Low */
#define CAN_MO212_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001AA90u)

/** Alias (User Manual Name) for CAN_MO212_DATAL.
* To use register names with standard convension, please use CAN_MO212_DATAL.
*/
#define	CAN_MODATAL212	(CAN_MO212_DATAL)

/** \\brief  2A80, Message Object  Function Control Register */
#define CAN_MO212_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001AA80u)

/** Alias (User Manual Name) for CAN_MO212_FCR.
* To use register names with standard convension, please use CAN_MO212_FCR.
*/
#define	CAN_MOFCR212	(CAN_MO212_FCR)

/** \\brief  2A84, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO212_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001AA84u)

/** Alias (User Manual Name) for CAN_MO212_FGPR.
* To use register names with standard convension, please use CAN_MO212_FGPR.
*/
#define	CAN_MOFGPR212	(CAN_MO212_FGPR)

/** \\brief  2A88, Message Object  Interrupt Pointer Register */
#define CAN_MO212_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001AA88u)

/** Alias (User Manual Name) for CAN_MO212_IPR.
* To use register names with standard convension, please use CAN_MO212_IPR.
*/
#define	CAN_MOIPR212	(CAN_MO212_IPR)

/** \\brief  2A9C, Message Object  Control Register */
#define CAN_MO212_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001AA9Cu)

/** Alias (User Manual Name) for CAN_MO212_STAT.
* To use register names with standard convension, please use CAN_MO212_STAT.
*/
#define	CAN_MOSTAT212	(CAN_MO212_STAT)

/** \\brief  2AAC, Message Object  Acceptance Mask Register */
#define CAN_MO213_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001AAACu)

/** Alias (User Manual Name) for CAN_MO213_AMR.
* To use register names with standard convension, please use CAN_MO213_AMR.
*/
#define	CAN_MOAMR213	(CAN_MO213_AMR)

