HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxCan_reg.h
/** \\brief  1008, Message Object  Interrupt Pointer Register */
#define CANR_MO0_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029008u)

/** Alias (User Manual Name) for CANR_MO0_IPR.
* To use register names with standard convension, please use CANR_MO0_IPR.
*/
#define	CANR_MOIPR0	(CANR_MO0_IPR)

/** \\brief  101C, Message Object  Control Register */
#define CANR_MO0_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF002901Cu)

/** Alias (User Manual Name) for CANR_MO0_STAT.
* To use register names with standard convension, please use CANR_MO0_STAT.
*/
#define	CANR_MOSTAT0	(CANR_MO0_STAT)

/** \\brief  1C8C, Message Object  Acceptance Mask Register */
#define CANR_MO100_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF0029C8Cu)

/** Alias (User Manual Name) for CANR_MO100_AMR.
* To use register names with standard convension, please use CANR_MO100_AMR.
*/
#define	CANR_MOAMR100	(CANR_MO100_AMR)

/** \\brief  1C98, Message Object  Arbitration Register */
#define CANR_MO100_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029C98u)

/** Alias (User Manual Name) for CANR_MO100_AR.
* To use register names with standard convension, please use CANR_MO100_AR.
*/
#define	CANR_MOAR100	(CANR_MO100_AR)

/** \\brief  1C9C, Message Object  Control Register */
#define CANR_MO100_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF0029C9Cu)

/** Alias (User Manual Name) for CANR_MO100_CTR.
* To use register names with standard convension, please use CANR_MO100_CTR.
*/
#define	CANR_MOCTR100	(CANR_MO100_CTR)

/** \\brief  1C94, Message Object  Data Register High */
#define CANR_MO100_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029C94u)

/** Alias (User Manual Name) for CANR_MO100_DATAH.
* To use register names with standard convension, please use CANR_MO100_DATAH.
*/
#define	CANR_MODATAH100	(CANR_MO100_DATAH)

/** \\brief  1C90, Message Object  Data Register Low */
#define CANR_MO100_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029C90u)

/** Alias (User Manual Name) for CANR_MO100_DATAL.
* To use register names with standard convension, please use CANR_MO100_DATAL.
*/
#define	CANR_MODATAL100	(CANR_MO100_DATAL)

/** \\brief  1C80, Message Object  Function Control Register */
#define CANR_MO100_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029C80u)

/** Alias (User Manual Name) for CANR_MO100_FCR.
* To use register names with standard convension, please use CANR_MO100_FCR.
*/
#define	CANR_MOFCR100	(CANR_MO100_FCR)

/** \\brief  1C84, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO100_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029C84u)

/** Alias (User Manual Name) for CANR_MO100_FGPR.
* To use register names with standard convension, please use CANR_MO100_FGPR.
*/
#define	CANR_MOFGPR100	(CANR_MO100_FGPR)

/** \\brief  1C88, Message Object  Interrupt Pointer Register */
#define CANR_MO100_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029C88u)

/** Alias (User Manual Name) for CANR_MO100_IPR.
* To use register names with standard convension, please use CANR_MO100_IPR.
*/
#define	CANR_MOIPR100	(CANR_MO100_IPR)

/** \\brief  1C9C, Message Object  Control Register */
#define CANR_MO100_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF0029C9Cu)

/** Alias (User Manual Name) for CANR_MO100_STAT.
* To use register names with standard convension, please use CANR_MO100_STAT.
*/
#define	CANR_MOSTAT100	(CANR_MO100_STAT)

/** \\brief  1CAC, Message Object  Acceptance Mask Register */
#define CANR_MO101_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF0029CACu)

/** Alias (User Manual Name) for CANR_MO101_AMR.
* To use register names with standard convension, please use CANR_MO101_AMR.
*/
#define	CANR_MOAMR101	(CANR_MO101_AMR)

/** \\brief  1CB8, Message Object  Arbitration Register */
#define CANR_MO101_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029CB8u)

/** Alias (User Manual Name) for CANR_MO101_AR.
* To use register names with standard convension, please use CANR_MO101_AR.
*/
#define	CANR_MOAR101	(CANR_MO101_AR)

/** \\brief  1CBC, Message Object  Control Register */
#define CANR_MO101_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF0029CBCu)

/** Alias (User Manual Name) for CANR_MO101_CTR.
* To use register names with standard convension, please use CANR_MO101_CTR.
*/
#define	CANR_MOCTR101	(CANR_MO101_CTR)

/** \\brief  1CB4, Message Object  Data Register High */
#define CANR_MO101_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029CB4u)

/** Alias (User Manual Name) for CANR_MO101_DATAH.
* To use register names with standard convension, please use CANR_MO101_DATAH.
*/
#define	CANR_MODATAH101	(CANR_MO101_DATAH)

/** \\brief  1CB0, Message Object  Data Register Low */
#define CANR_MO101_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029CB0u)

/** Alias (User Manual Name) for CANR_MO101_DATAL.
* To use register names with standard convension, please use CANR_MO101_DATAL.
*/
#define	CANR_MODATAL101	(CANR_MO101_DATAL)

/** \\brief  1CA0, Message Object  Function Control Register */
#define CANR_MO101_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029CA0u)

/** Alias (User Manual Name) for CANR_MO101_FCR.
* To use register names with standard convension, please use CANR_MO101_FCR.
*/
#define	CANR_MOFCR101	(CANR_MO101_FCR)

/** \\brief  1CA4, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO101_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029CA4u)

/** Alias (User Manual Name) for CANR_MO101_FGPR.
* To use register names with standard convension, please use CANR_MO101_FGPR.
*/
#define	CANR_MOFGPR101	(CANR_MO101_FGPR)

/** \\brief  1CA8, Message Object  Interrupt Pointer Register */
#define CANR_MO101_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029CA8u)

/** Alias (User Manual Name) for CANR_MO101_IPR.
* To use register names with standard convension, please use CANR_MO101_IPR.
*/
#define	CANR_MOIPR101	(CANR_MO101_IPR)

/** \\brief  1CBC, Message Object  Control Register */
#define CANR_MO101_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF0029CBCu)

