HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxCan_reg.h
/** \\brief  1D5C, Message Object  Control Register */
#define CANR_MO106_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF0029D5Cu)

/** Alias (User Manual Name) for CANR_MO106_STAT.
* To use register names with standard convension, please use CANR_MO106_STAT.
*/
#define	CANR_MOSTAT106	(CANR_MO106_STAT)

/** \\brief  1D6C, Message Object  Acceptance Mask Register */
#define CANR_MO107_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF0029D6Cu)

/** Alias (User Manual Name) for CANR_MO107_AMR.
* To use register names with standard convension, please use CANR_MO107_AMR.
*/
#define	CANR_MOAMR107	(CANR_MO107_AMR)

/** \\brief  1D78, Message Object  Arbitration Register */
#define CANR_MO107_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029D78u)

/** Alias (User Manual Name) for CANR_MO107_AR.
* To use register names with standard convension, please use CANR_MO107_AR.
*/
#define	CANR_MOAR107	(CANR_MO107_AR)

/** \\brief  1D7C, Message Object  Control Register */
#define CANR_MO107_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF0029D7Cu)

/** Alias (User Manual Name) for CANR_MO107_CTR.
* To use register names with standard convension, please use CANR_MO107_CTR.
*/
#define	CANR_MOCTR107	(CANR_MO107_CTR)

/** \\brief  1D74, Message Object  Data Register High */
#define CANR_MO107_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029D74u)

/** Alias (User Manual Name) for CANR_MO107_DATAH.
* To use register names with standard convension, please use CANR_MO107_DATAH.
*/
#define	CANR_MODATAH107	(CANR_MO107_DATAH)

/** \\brief  1D70, Message Object  Data Register Low */
#define CANR_MO107_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029D70u)

/** Alias (User Manual Name) for CANR_MO107_DATAL.
* To use register names with standard convension, please use CANR_MO107_DATAL.
*/
#define	CANR_MODATAL107	(CANR_MO107_DATAL)

/** \\brief  1D60, Message Object  Function Control Register */
#define CANR_MO107_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029D60u)

/** Alias (User Manual Name) for CANR_MO107_FCR.
* To use register names with standard convension, please use CANR_MO107_FCR.
*/
#define	CANR_MOFCR107	(CANR_MO107_FCR)

/** \\brief  1D64, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO107_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029D64u)

/** Alias (User Manual Name) for CANR_MO107_FGPR.
* To use register names with standard convension, please use CANR_MO107_FGPR.
*/
#define	CANR_MOFGPR107	(CANR_MO107_FGPR)

/** \\brief  1D68, Message Object  Interrupt Pointer Register */
#define CANR_MO107_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029D68u)

/** Alias (User Manual Name) for CANR_MO107_IPR.
* To use register names with standard convension, please use CANR_MO107_IPR.
*/
#define	CANR_MOIPR107	(CANR_MO107_IPR)

/** \\brief  1D7C, Message Object  Control Register */
#define CANR_MO107_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF0029D7Cu)

/** Alias (User Manual Name) for CANR_MO107_STAT.
* To use register names with standard convension, please use CANR_MO107_STAT.
*/
#define	CANR_MOSTAT107	(CANR_MO107_STAT)

/** \\brief  1D8C, Message Object  Acceptance Mask Register */
#define CANR_MO108_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF0029D8Cu)

/** Alias (User Manual Name) for CANR_MO108_AMR.
* To use register names with standard convension, please use CANR_MO108_AMR.
*/
#define	CANR_MOAMR108	(CANR_MO108_AMR)

/** \\brief  1D98, Message Object  Arbitration Register */
#define CANR_MO108_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029D98u)

/** Alias (User Manual Name) for CANR_MO108_AR.
* To use register names with standard convension, please use CANR_MO108_AR.
*/
#define	CANR_MOAR108	(CANR_MO108_AR)

/** \\brief  1D9C, Message Object  Control Register */
#define CANR_MO108_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF0029D9Cu)

/** Alias (User Manual Name) for CANR_MO108_CTR.
* To use register names with standard convension, please use CANR_MO108_CTR.
*/
#define	CANR_MOCTR108	(CANR_MO108_CTR)

/** \\brief  1D94, Message Object  Data Register High */
#define CANR_MO108_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029D94u)

/** Alias (User Manual Name) for CANR_MO108_DATAH.
* To use register names with standard convension, please use CANR_MO108_DATAH.
*/
#define	CANR_MODATAH108	(CANR_MO108_DATAH)

/** \\brief  1D90, Message Object  Data Register Low */
#define CANR_MO108_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029D90u)

/** Alias (User Manual Name) for CANR_MO108_DATAL.
* To use register names with standard convension, please use CANR_MO108_DATAL.
*/
#define	CANR_MODATAL108	(CANR_MO108_DATAL)

/** \\brief  1D80, Message Object  Function Control Register */
#define CANR_MO108_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029D80u)

/** Alias (User Manual Name) for CANR_MO108_FCR.
* To use register names with standard convension, please use CANR_MO108_FCR.
*/
#define	CANR_MOFCR108	(CANR_MO108_FCR)

/** \\brief  1D84, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO108_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029D84u)

/** Alias (User Manual Name) for CANR_MO108_FGPR.
* To use register names with standard convension, please use CANR_MO108_FGPR.
*/
#define	CANR_MOFGPR108	(CANR_MO108_FGPR)

/** \\brief  1D88, Message Object  Interrupt Pointer Register */
#define CANR_MO108_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029D88u)

/** Alias (User Manual Name) for CANR_MO108_IPR.
* To use register names with standard convension, please use CANR_MO108_IPR.
*/
#define	CANR_MOIPR108	(CANR_MO108_IPR)

/** \\brief  1D9C, Message Object  Control Register */
#define CANR_MO108_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF0029D9Cu)

/** Alias (User Manual Name) for CANR_MO108_STAT.
* To use register names with standard convension, please use CANR_MO108_STAT.
*/
#define	CANR_MOSTAT108	(CANR_MO108_STAT)

/** \\brief  1DAC, Message Object  Acceptance Mask Register */
#define CANR_MO109_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF0029DACu)

/** Alias (User Manual Name) for CANR_MO109_AMR.
* To use register names with standard convension, please use CANR_MO109_AMR.
*/
#define	CANR_MOAMR109	(CANR_MO109_AMR)

/** \\brief  1DB8, Message Object  Arbitration Register */
#define CANR_MO109_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029DB8u)

