HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxCan_reg.h
/** Alias (User Manual Name) for CANR_MO110_FCR.
* To use register names with standard convension, please use CANR_MO110_FCR.
*/
#define	CANR_MOFCR110	(CANR_MO110_FCR)

/** \\brief  1DC4, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO110_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029DC4u)

/** Alias (User Manual Name) for CANR_MO110_FGPR.
* To use register names with standard convension, please use CANR_MO110_FGPR.
*/
#define	CANR_MOFGPR110	(CANR_MO110_FGPR)

/** \\brief  1DC8, Message Object  Interrupt Pointer Register */
#define CANR_MO110_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029DC8u)

/** Alias (User Manual Name) for CANR_MO110_IPR.
* To use register names with standard convension, please use CANR_MO110_IPR.
*/
#define	CANR_MOIPR110	(CANR_MO110_IPR)

/** \\brief  1DDC, Message Object  Control Register */
#define CANR_MO110_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF0029DDCu)

/** Alias (User Manual Name) for CANR_MO110_STAT.
* To use register names with standard convension, please use CANR_MO110_STAT.
*/
#define	CANR_MOSTAT110	(CANR_MO110_STAT)

/** \\brief  1DEC, Message Object  Acceptance Mask Register */
#define CANR_MO111_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF0029DECu)

/** Alias (User Manual Name) for CANR_MO111_AMR.
* To use register names with standard convension, please use CANR_MO111_AMR.
*/
#define	CANR_MOAMR111	(CANR_MO111_AMR)

/** \\brief  1DF8, Message Object  Arbitration Register */
#define CANR_MO111_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029DF8u)

/** Alias (User Manual Name) for CANR_MO111_AR.
* To use register names with standard convension, please use CANR_MO111_AR.
*/
#define	CANR_MOAR111	(CANR_MO111_AR)

/** \\brief  1DFC, Message Object  Control Register */
#define CANR_MO111_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF0029DFCu)

/** Alias (User Manual Name) for CANR_MO111_CTR.
* To use register names with standard convension, please use CANR_MO111_CTR.
*/
#define	CANR_MOCTR111	(CANR_MO111_CTR)

/** \\brief  1DF4, Message Object  Data Register High */
#define CANR_MO111_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029DF4u)

/** Alias (User Manual Name) for CANR_MO111_DATAH.
* To use register names with standard convension, please use CANR_MO111_DATAH.
*/
#define	CANR_MODATAH111	(CANR_MO111_DATAH)

/** \\brief  1DF0, Message Object  Data Register Low */
#define CANR_MO111_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029DF0u)

/** Alias (User Manual Name) for CANR_MO111_DATAL.
* To use register names with standard convension, please use CANR_MO111_DATAL.
*/
#define	CANR_MODATAL111	(CANR_MO111_DATAL)

/** \\brief  1DE0, Message Object  Function Control Register */
#define CANR_MO111_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029DE0u)

/** Alias (User Manual Name) for CANR_MO111_FCR.
* To use register names with standard convension, please use CANR_MO111_FCR.
*/
#define	CANR_MOFCR111	(CANR_MO111_FCR)

/** \\brief  1DE4, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO111_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029DE4u)

/** Alias (User Manual Name) for CANR_MO111_FGPR.
* To use register names with standard convension, please use CANR_MO111_FGPR.
*/
#define	CANR_MOFGPR111	(CANR_MO111_FGPR)

/** \\brief  1DE8, Message Object  Interrupt Pointer Register */
#define CANR_MO111_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029DE8u)

/** Alias (User Manual Name) for CANR_MO111_IPR.
* To use register names with standard convension, please use CANR_MO111_IPR.
*/
#define	CANR_MOIPR111	(CANR_MO111_IPR)

/** \\brief  1DFC, Message Object  Control Register */
#define CANR_MO111_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF0029DFCu)

/** Alias (User Manual Name) for CANR_MO111_STAT.
* To use register names with standard convension, please use CANR_MO111_STAT.
*/
#define	CANR_MOSTAT111	(CANR_MO111_STAT)

/** \\brief  1E0C, Message Object  Acceptance Mask Register */
#define CANR_MO112_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF0029E0Cu)

/** Alias (User Manual Name) for CANR_MO112_AMR.
* To use register names with standard convension, please use CANR_MO112_AMR.
*/
#define	CANR_MOAMR112	(CANR_MO112_AMR)

/** \\brief  1E18, Message Object  Arbitration Register */
#define CANR_MO112_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029E18u)

/** Alias (User Manual Name) for CANR_MO112_AR.
* To use register names with standard convension, please use CANR_MO112_AR.
*/
#define	CANR_MOAR112	(CANR_MO112_AR)

/** \\brief  1E1C, Message Object  Control Register */
#define CANR_MO112_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF0029E1Cu)

/** Alias (User Manual Name) for CANR_MO112_CTR.
* To use register names with standard convension, please use CANR_MO112_CTR.
*/
#define	CANR_MOCTR112	(CANR_MO112_CTR)

/** \\brief  1E14, Message Object  Data Register High */
#define CANR_MO112_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029E14u)

/** Alias (User Manual Name) for CANR_MO112_DATAH.
* To use register names with standard convension, please use CANR_MO112_DATAH.
*/
#define	CANR_MODATAH112	(CANR_MO112_DATAH)

/** \\brief  1E10, Message Object  Data Register Low */
#define CANR_MO112_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029E10u)

/** Alias (User Manual Name) for CANR_MO112_DATAL.
* To use register names with standard convension, please use CANR_MO112_DATAL.
*/
#define	CANR_MODATAL112	(CANR_MO112_DATAL)

/** \\brief  1E00, Message Object  Function Control Register */
#define CANR_MO112_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029E00u)

/** Alias (User Manual Name) for CANR_MO112_FCR.
* To use register names with standard convension, please use CANR_MO112_FCR.
*/
#define	CANR_MOFCR112	(CANR_MO112_FCR)

/** \\brief  1E04, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO112_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029E04u)

/** Alias (User Manual Name) for CANR_MO112_FGPR.
* To use register names with standard convension, please use CANR_MO112_FGPR.
*/
#define	CANR_MOFGPR112	(CANR_MO112_FGPR)

/** \\brief  1E08, Message Object  Interrupt Pointer Register */
#define CANR_MO112_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029E08u)

