HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxCan_reg.h
/** Alias (User Manual Name) for CANR_MO112_IPR.
* To use register names with standard convension, please use CANR_MO112_IPR.
*/
#define	CANR_MOIPR112	(CANR_MO112_IPR)

/** \\brief  1E1C, Message Object  Control Register */
#define CANR_MO112_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF0029E1Cu)

/** Alias (User Manual Name) for CANR_MO112_STAT.
* To use register names with standard convension, please use CANR_MO112_STAT.
*/
#define	CANR_MOSTAT112	(CANR_MO112_STAT)

/** \\brief  1E2C, Message Object  Acceptance Mask Register */
#define CANR_MO113_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF0029E2Cu)

/** Alias (User Manual Name) for CANR_MO113_AMR.
* To use register names with standard convension, please use CANR_MO113_AMR.
*/
#define	CANR_MOAMR113	(CANR_MO113_AMR)

/** \\brief  1E38, Message Object  Arbitration Register */
#define CANR_MO113_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029E38u)

/** Alias (User Manual Name) for CANR_MO113_AR.
* To use register names with standard convension, please use CANR_MO113_AR.
*/
#define	CANR_MOAR113	(CANR_MO113_AR)

/** \\brief  1E3C, Message Object  Control Register */
#define CANR_MO113_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF0029E3Cu)

/** Alias (User Manual Name) for CANR_MO113_CTR.
* To use register names with standard convension, please use CANR_MO113_CTR.
*/
#define	CANR_MOCTR113	(CANR_MO113_CTR)

/** \\brief  1E34, Message Object  Data Register High */
#define CANR_MO113_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029E34u)

/** Alias (User Manual Name) for CANR_MO113_DATAH.
* To use register names with standard convension, please use CANR_MO113_DATAH.
*/
#define	CANR_MODATAH113	(CANR_MO113_DATAH)

/** \\brief  1E30, Message Object  Data Register Low */
#define CANR_MO113_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029E30u)

/** Alias (User Manual Name) for CANR_MO113_DATAL.
* To use register names with standard convension, please use CANR_MO113_DATAL.
*/
#define	CANR_MODATAL113	(CANR_MO113_DATAL)

/** \\brief  1E20, Message Object  Function Control Register */
#define CANR_MO113_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029E20u)

/** Alias (User Manual Name) for CANR_MO113_FCR.
* To use register names with standard convension, please use CANR_MO113_FCR.
*/
#define	CANR_MOFCR113	(CANR_MO113_FCR)

/** \\brief  1E24, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO113_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029E24u)

/** Alias (User Manual Name) for CANR_MO113_FGPR.
* To use register names with standard convension, please use CANR_MO113_FGPR.
*/
#define	CANR_MOFGPR113	(CANR_MO113_FGPR)

/** \\brief  1E28, Message Object  Interrupt Pointer Register */
#define CANR_MO113_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029E28u)

/** Alias (User Manual Name) for CANR_MO113_IPR.
* To use register names with standard convension, please use CANR_MO113_IPR.
*/
#define	CANR_MOIPR113	(CANR_MO113_IPR)

/** \\brief  1E3C, Message Object  Control Register */
#define CANR_MO113_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF0029E3Cu)

/** Alias (User Manual Name) for CANR_MO113_STAT.
* To use register names with standard convension, please use CANR_MO113_STAT.
*/
#define	CANR_MOSTAT113	(CANR_MO113_STAT)

/** \\brief  1E4C, Message Object  Acceptance Mask Register */
#define CANR_MO114_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF0029E4Cu)

/** Alias (User Manual Name) for CANR_MO114_AMR.
* To use register names with standard convension, please use CANR_MO114_AMR.
*/
#define	CANR_MOAMR114	(CANR_MO114_AMR)

/** \\brief  1E58, Message Object  Arbitration Register */
#define CANR_MO114_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029E58u)

/** Alias (User Manual Name) for CANR_MO114_AR.
* To use register names with standard convension, please use CANR_MO114_AR.
*/
#define	CANR_MOAR114	(CANR_MO114_AR)

/** \\brief  1E5C, Message Object  Control Register */
#define CANR_MO114_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF0029E5Cu)

/** Alias (User Manual Name) for CANR_MO114_CTR.
* To use register names with standard convension, please use CANR_MO114_CTR.
*/
#define	CANR_MOCTR114	(CANR_MO114_CTR)

/** \\brief  1E54, Message Object  Data Register High */
#define CANR_MO114_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029E54u)

/** Alias (User Manual Name) for CANR_MO114_DATAH.
* To use register names with standard convension, please use CANR_MO114_DATAH.
*/
#define	CANR_MODATAH114	(CANR_MO114_DATAH)

/** \\brief  1E50, Message Object  Data Register Low */
#define CANR_MO114_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029E50u)

/** Alias (User Manual Name) for CANR_MO114_DATAL.
* To use register names with standard convension, please use CANR_MO114_DATAL.
*/
#define	CANR_MODATAL114	(CANR_MO114_DATAL)

/** \\brief  1E40, Message Object  Function Control Register */
#define CANR_MO114_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029E40u)

/** Alias (User Manual Name) for CANR_MO114_FCR.
* To use register names with standard convension, please use CANR_MO114_FCR.
*/
#define	CANR_MOFCR114	(CANR_MO114_FCR)

/** \\brief  1E44, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO114_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029E44u)

/** Alias (User Manual Name) for CANR_MO114_FGPR.
* To use register names with standard convension, please use CANR_MO114_FGPR.
*/
#define	CANR_MOFGPR114	(CANR_MO114_FGPR)

/** \\brief  1E48, Message Object  Interrupt Pointer Register */
#define CANR_MO114_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029E48u)

/** Alias (User Manual Name) for CANR_MO114_IPR.
* To use register names with standard convension, please use CANR_MO114_IPR.
*/
#define	CANR_MOIPR114	(CANR_MO114_IPR)

/** \\brief  1E5C, Message Object  Control Register */
#define CANR_MO114_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF0029E5Cu)

/** Alias (User Manual Name) for CANR_MO114_STAT.
* To use register names with standard convension, please use CANR_MO114_STAT.
*/
#define	CANR_MOSTAT114	(CANR_MO114_STAT)

/** \\brief  1E6C, Message Object  Acceptance Mask Register */
#define CANR_MO115_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF0029E6Cu)

