HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxCan_reg.h
/** Alias (User Manual Name) for CANR_MO115_AMR.
* To use register names with standard convension, please use CANR_MO115_AMR.
*/
#define	CANR_MOAMR115	(CANR_MO115_AMR)

/** \\brief  1E78, Message Object  Arbitration Register */
#define CANR_MO115_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029E78u)

/** Alias (User Manual Name) for CANR_MO115_AR.
* To use register names with standard convension, please use CANR_MO115_AR.
*/
#define	CANR_MOAR115	(CANR_MO115_AR)

/** \\brief  1E7C, Message Object  Control Register */
#define CANR_MO115_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF0029E7Cu)

/** Alias (User Manual Name) for CANR_MO115_CTR.
* To use register names with standard convension, please use CANR_MO115_CTR.
*/
#define	CANR_MOCTR115	(CANR_MO115_CTR)

/** \\brief  1E74, Message Object  Data Register High */
#define CANR_MO115_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029E74u)

/** Alias (User Manual Name) for CANR_MO115_DATAH.
* To use register names with standard convension, please use CANR_MO115_DATAH.
*/
#define	CANR_MODATAH115	(CANR_MO115_DATAH)

/** \\brief  1E70, Message Object  Data Register Low */
#define CANR_MO115_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029E70u)

/** Alias (User Manual Name) for CANR_MO115_DATAL.
* To use register names with standard convension, please use CANR_MO115_DATAL.
*/
#define	CANR_MODATAL115	(CANR_MO115_DATAL)

/** \\brief  1E60, Message Object  Function Control Register */
#define CANR_MO115_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029E60u)

/** Alias (User Manual Name) for CANR_MO115_FCR.
* To use register names with standard convension, please use CANR_MO115_FCR.
*/
#define	CANR_MOFCR115	(CANR_MO115_FCR)

/** \\brief  1E64, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO115_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029E64u)

/** Alias (User Manual Name) for CANR_MO115_FGPR.
* To use register names with standard convension, please use CANR_MO115_FGPR.
*/
#define	CANR_MOFGPR115	(CANR_MO115_FGPR)

/** \\brief  1E68, Message Object  Interrupt Pointer Register */
#define CANR_MO115_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029E68u)

/** Alias (User Manual Name) for CANR_MO115_IPR.
* To use register names with standard convension, please use CANR_MO115_IPR.
*/
#define	CANR_MOIPR115	(CANR_MO115_IPR)

/** \\brief  1E7C, Message Object  Control Register */
#define CANR_MO115_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF0029E7Cu)

/** Alias (User Manual Name) for CANR_MO115_STAT.
* To use register names with standard convension, please use CANR_MO115_STAT.
*/
#define	CANR_MOSTAT115	(CANR_MO115_STAT)

/** \\brief  1E8C, Message Object  Acceptance Mask Register */
#define CANR_MO116_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF0029E8Cu)

/** Alias (User Manual Name) for CANR_MO116_AMR.
* To use register names with standard convension, please use CANR_MO116_AMR.
*/
#define	CANR_MOAMR116	(CANR_MO116_AMR)

/** \\brief  1E98, Message Object  Arbitration Register */
#define CANR_MO116_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029E98u)

/** Alias (User Manual Name) for CANR_MO116_AR.
* To use register names with standard convension, please use CANR_MO116_AR.
*/
#define	CANR_MOAR116	(CANR_MO116_AR)

/** \\brief  1E9C, Message Object  Control Register */
#define CANR_MO116_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF0029E9Cu)

/** Alias (User Manual Name) for CANR_MO116_CTR.
* To use register names with standard convension, please use CANR_MO116_CTR.
*/
#define	CANR_MOCTR116	(CANR_MO116_CTR)

/** \\brief  1E94, Message Object  Data Register High */
#define CANR_MO116_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029E94u)

/** Alias (User Manual Name) for CANR_MO116_DATAH.
* To use register names with standard convension, please use CANR_MO116_DATAH.
*/
#define	CANR_MODATAH116	(CANR_MO116_DATAH)

/** \\brief  1E90, Message Object  Data Register Low */
#define CANR_MO116_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029E90u)

/** Alias (User Manual Name) for CANR_MO116_DATAL.
* To use register names with standard convension, please use CANR_MO116_DATAL.
*/
#define	CANR_MODATAL116	(CANR_MO116_DATAL)

/** \\brief  1E80, Message Object  Function Control Register */
#define CANR_MO116_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029E80u)

/** Alias (User Manual Name) for CANR_MO116_FCR.
* To use register names with standard convension, please use CANR_MO116_FCR.
*/
#define	CANR_MOFCR116	(CANR_MO116_FCR)

/** \\brief  1E84, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO116_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029E84u)

/** Alias (User Manual Name) for CANR_MO116_FGPR.
* To use register names with standard convension, please use CANR_MO116_FGPR.
*/
#define	CANR_MOFGPR116	(CANR_MO116_FGPR)

/** \\brief  1E88, Message Object  Interrupt Pointer Register */
#define CANR_MO116_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029E88u)

/** Alias (User Manual Name) for CANR_MO116_IPR.
* To use register names with standard convension, please use CANR_MO116_IPR.
*/
#define	CANR_MOIPR116	(CANR_MO116_IPR)

/** \\brief  1E9C, Message Object  Control Register */
#define CANR_MO116_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF0029E9Cu)

/** Alias (User Manual Name) for CANR_MO116_STAT.
* To use register names with standard convension, please use CANR_MO116_STAT.
*/
#define	CANR_MOSTAT116	(CANR_MO116_STAT)

/** \\brief  1EAC, Message Object  Acceptance Mask Register */
#define CANR_MO117_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF0029EACu)

/** Alias (User Manual Name) for CANR_MO117_AMR.
* To use register names with standard convension, please use CANR_MO117_AMR.
*/
#define	CANR_MOAMR117	(CANR_MO117_AMR)

/** \\brief  1EB8, Message Object  Arbitration Register */
#define CANR_MO117_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029EB8u)

/** Alias (User Manual Name) for CANR_MO117_AR.
* To use register names with standard convension, please use CANR_MO117_AR.
*/
#define	CANR_MOAR117	(CANR_MO117_AR)

/** \\brief  1EBC, Message Object  Control Register */
#define CANR_MO117_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF0029EBCu)

/** Alias (User Manual Name) for CANR_MO117_CTR.
* To use register names with standard convension, please use CANR_MO117_CTR.
*/
#define	CANR_MOCTR117	(CANR_MO117_CTR)

/** \\brief  1EB4, Message Object  Data Register High */
#define CANR_MO117_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029EB4u)

/** Alias (User Manual Name) for CANR_MO117_DATAH.
* To use register names with standard convension, please use CANR_MO117_DATAH.
*/
#define	CANR_MODATAH117	(CANR_MO117_DATAH)

/** \\brief  1EB0, Message Object  Data Register Low */
#define CANR_MO117_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029EB0u)

/** Alias (User Manual Name) for CANR_MO117_DATAL.
* To use register names with standard convension, please use CANR_MO117_DATAL.
*/
#define	CANR_MODATAL117	(CANR_MO117_DATAL)

/** \\brief  1EA0, Message Object  Function Control Register */
#define CANR_MO117_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029EA0u)

