HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxCan_reg.h
/** Alias (User Manual Name) for CANR_MO117_FCR.
* To use register names with standard convension, please use CANR_MO117_FCR.
*/
#define	CANR_MOFCR117	(CANR_MO117_FCR)

/** \\brief  1EA4, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO117_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029EA4u)

/** Alias (User Manual Name) for CANR_MO117_FGPR.
* To use register names with standard convension, please use CANR_MO117_FGPR.
*/
#define	CANR_MOFGPR117	(CANR_MO117_FGPR)

/** \\brief  1EA8, Message Object  Interrupt Pointer Register */
#define CANR_MO117_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029EA8u)

/** Alias (User Manual Name) for CANR_MO117_IPR.
* To use register names with standard convension, please use CANR_MO117_IPR.
*/
#define	CANR_MOIPR117	(CANR_MO117_IPR)

/** \\brief  1EBC, Message Object  Control Register */
#define CANR_MO117_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF0029EBCu)

/** Alias (User Manual Name) for CANR_MO117_STAT.
* To use register names with standard convension, please use CANR_MO117_STAT.
*/
#define	CANR_MOSTAT117	(CANR_MO117_STAT)

/** \\brief  1ECC, Message Object  Acceptance Mask Register */
#define CANR_MO118_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF0029ECCu)

/** Alias (User Manual Name) for CANR_MO118_AMR.
* To use register names with standard convension, please use CANR_MO118_AMR.
*/
#define	CANR_MOAMR118	(CANR_MO118_AMR)

/** \\brief  1ED8, Message Object  Arbitration Register */
#define CANR_MO118_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029ED8u)

/** Alias (User Manual Name) for CANR_MO118_AR.
* To use register names with standard convension, please use CANR_MO118_AR.
*/
#define	CANR_MOAR118	(CANR_MO118_AR)

/** \\brief  1EDC, Message Object  Control Register */
#define CANR_MO118_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF0029EDCu)

/** Alias (User Manual Name) for CANR_MO118_CTR.
* To use register names with standard convension, please use CANR_MO118_CTR.
*/
#define	CANR_MOCTR118	(CANR_MO118_CTR)

/** \\brief  1ED4, Message Object  Data Register High */
#define CANR_MO118_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029ED4u)

/** Alias (User Manual Name) for CANR_MO118_DATAH.
* To use register names with standard convension, please use CANR_MO118_DATAH.
*/
#define	CANR_MODATAH118	(CANR_MO118_DATAH)

/** \\brief  1ED0, Message Object  Data Register Low */
#define CANR_MO118_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029ED0u)

/** Alias (User Manual Name) for CANR_MO118_DATAL.
* To use register names with standard convension, please use CANR_MO118_DATAL.
*/
#define	CANR_MODATAL118	(CANR_MO118_DATAL)

/** \\brief  1EC0, Message Object  Function Control Register */
#define CANR_MO118_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029EC0u)

/** Alias (User Manual Name) for CANR_MO118_FCR.
* To use register names with standard convension, please use CANR_MO118_FCR.
*/
#define	CANR_MOFCR118	(CANR_MO118_FCR)

/** \\brief  1EC4, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO118_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029EC4u)

/** Alias (User Manual Name) for CANR_MO118_FGPR.
* To use register names with standard convension, please use CANR_MO118_FGPR.
*/
#define	CANR_MOFGPR118	(CANR_MO118_FGPR)

/** \\brief  1EC8, Message Object  Interrupt Pointer Register */
#define CANR_MO118_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029EC8u)

/** Alias (User Manual Name) for CANR_MO118_IPR.
* To use register names with standard convension, please use CANR_MO118_IPR.
*/
#define	CANR_MOIPR118	(CANR_MO118_IPR)

/** \\brief  1EDC, Message Object  Control Register */
#define CANR_MO118_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF0029EDCu)

/** Alias (User Manual Name) for CANR_MO118_STAT.
* To use register names with standard convension, please use CANR_MO118_STAT.
*/
#define	CANR_MOSTAT118	(CANR_MO118_STAT)

/** \\brief  1EEC, Message Object  Acceptance Mask Register */
#define CANR_MO119_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF0029EECu)

/** Alias (User Manual Name) for CANR_MO119_AMR.
* To use register names with standard convension, please use CANR_MO119_AMR.
*/
#define	CANR_MOAMR119	(CANR_MO119_AMR)

/** \\brief  1EF8, Message Object  Arbitration Register */
#define CANR_MO119_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029EF8u)

/** Alias (User Manual Name) for CANR_MO119_AR.
* To use register names with standard convension, please use CANR_MO119_AR.
*/
#define	CANR_MOAR119	(CANR_MO119_AR)

/** \\brief  1EFC, Message Object  Control Register */
#define CANR_MO119_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF0029EFCu)

/** Alias (User Manual Name) for CANR_MO119_CTR.
* To use register names with standard convension, please use CANR_MO119_CTR.
*/
#define	CANR_MOCTR119	(CANR_MO119_CTR)

/** \\brief  1EF4, Message Object  Data Register High */
#define CANR_MO119_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029EF4u)

/** Alias (User Manual Name) for CANR_MO119_DATAH.
* To use register names with standard convension, please use CANR_MO119_DATAH.
*/
#define	CANR_MODATAH119	(CANR_MO119_DATAH)

/** \\brief  1EF0, Message Object  Data Register Low */
#define CANR_MO119_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029EF0u)

/** Alias (User Manual Name) for CANR_MO119_DATAL.
* To use register names with standard convension, please use CANR_MO119_DATAL.
*/
#define	CANR_MODATAL119	(CANR_MO119_DATAL)

/** \\brief  1EE0, Message Object  Function Control Register */
#define CANR_MO119_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029EE0u)

/** Alias (User Manual Name) for CANR_MO119_FCR.
* To use register names with standard convension, please use CANR_MO119_FCR.
*/
#define	CANR_MOFCR119	(CANR_MO119_FCR)

/** \\brief  1EE4, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO119_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029EE4u)

/** Alias (User Manual Name) for CANR_MO119_FGPR.
* To use register names with standard convension, please use CANR_MO119_FGPR.
*/
#define	CANR_MOFGPR119	(CANR_MO119_FGPR)

