HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxCan_reg.h
/** \\brief  1EE8, Message Object  Interrupt Pointer Register */
#define CANR_MO119_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029EE8u)

/** Alias (User Manual Name) for CANR_MO119_IPR.
* To use register names with standard convension, please use CANR_MO119_IPR.
*/
#define	CANR_MOIPR119	(CANR_MO119_IPR)

/** \\brief  1EFC, Message Object  Control Register */
#define CANR_MO119_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF0029EFCu)

/** Alias (User Manual Name) for CANR_MO119_STAT.
* To use register names with standard convension, please use CANR_MO119_STAT.
*/
#define	CANR_MOSTAT119	(CANR_MO119_STAT)

/** \\brief  116C, Message Object  Acceptance Mask Register */
#define CANR_MO11_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002916Cu)

/** Alias (User Manual Name) for CANR_MO11_AMR.
* To use register names with standard convension, please use CANR_MO11_AMR.
*/
#define	CANR_MOAMR11	(CANR_MO11_AMR)

/** \\brief  1178, Message Object  Arbitration Register */
#define CANR_MO11_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029178u)

/** Alias (User Manual Name) for CANR_MO11_AR.
* To use register names with standard convension, please use CANR_MO11_AR.
*/
#define	CANR_MOAR11	(CANR_MO11_AR)

/** \\brief  117C, Message Object  Control Register */
#define CANR_MO11_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF002917Cu)

/** Alias (User Manual Name) for CANR_MO11_CTR.
* To use register names with standard convension, please use CANR_MO11_CTR.
*/
#define	CANR_MOCTR11	(CANR_MO11_CTR)

/** \\brief  1174, Message Object  Data Register High */
#define CANR_MO11_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029174u)

/** Alias (User Manual Name) for CANR_MO11_DATAH.
* To use register names with standard convension, please use CANR_MO11_DATAH.
*/
#define	CANR_MODATAH11	(CANR_MO11_DATAH)

/** \\brief  1170, Message Object  Data Register Low */
#define CANR_MO11_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029170u)

/** Alias (User Manual Name) for CANR_MO11_DATAL.
* To use register names with standard convension, please use CANR_MO11_DATAL.
*/
#define	CANR_MODATAL11	(CANR_MO11_DATAL)

/** \\brief  1160, Message Object  Function Control Register */
#define CANR_MO11_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029160u)

/** Alias (User Manual Name) for CANR_MO11_FCR.
* To use register names with standard convension, please use CANR_MO11_FCR.
*/
#define	CANR_MOFCR11	(CANR_MO11_FCR)

/** \\brief  1164, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO11_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029164u)

/** Alias (User Manual Name) for CANR_MO11_FGPR.
* To use register names with standard convension, please use CANR_MO11_FGPR.
*/
#define	CANR_MOFGPR11	(CANR_MO11_FGPR)

/** \\brief  1168, Message Object  Interrupt Pointer Register */
#define CANR_MO11_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029168u)

/** Alias (User Manual Name) for CANR_MO11_IPR.
* To use register names with standard convension, please use CANR_MO11_IPR.
*/
#define	CANR_MOIPR11	(CANR_MO11_IPR)

/** \\brief  117C, Message Object  Control Register */
#define CANR_MO11_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF002917Cu)

/** Alias (User Manual Name) for CANR_MO11_STAT.
* To use register names with standard convension, please use CANR_MO11_STAT.
*/
#define	CANR_MOSTAT11	(CANR_MO11_STAT)

/** \\brief  1F0C, Message Object  Acceptance Mask Register */
#define CANR_MO120_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF0029F0Cu)

/** Alias (User Manual Name) for CANR_MO120_AMR.
* To use register names with standard convension, please use CANR_MO120_AMR.
*/
#define	CANR_MOAMR120	(CANR_MO120_AMR)

/** \\brief  1F18, Message Object  Arbitration Register */
#define CANR_MO120_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029F18u)

/** Alias (User Manual Name) for CANR_MO120_AR.
* To use register names with standard convension, please use CANR_MO120_AR.
*/
#define	CANR_MOAR120	(CANR_MO120_AR)

/** \\brief  1F1C, Message Object  Control Register */
#define CANR_MO120_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF0029F1Cu)

/** Alias (User Manual Name) for CANR_MO120_CTR.
* To use register names with standard convension, please use CANR_MO120_CTR.
*/
#define	CANR_MOCTR120	(CANR_MO120_CTR)

/** \\brief  1F14, Message Object  Data Register High */
#define CANR_MO120_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029F14u)

/** Alias (User Manual Name) for CANR_MO120_DATAH.
* To use register names with standard convension, please use CANR_MO120_DATAH.
*/
#define	CANR_MODATAH120	(CANR_MO120_DATAH)

/** \\brief  1F10, Message Object  Data Register Low */
#define CANR_MO120_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029F10u)

/** Alias (User Manual Name) for CANR_MO120_DATAL.
* To use register names with standard convension, please use CANR_MO120_DATAL.
*/
#define	CANR_MODATAL120	(CANR_MO120_DATAL)

/** \\brief  1F00, Message Object  Function Control Register */
#define CANR_MO120_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029F00u)

/** Alias (User Manual Name) for CANR_MO120_FCR.
* To use register names with standard convension, please use CANR_MO120_FCR.
*/
#define	CANR_MOFCR120	(CANR_MO120_FCR)

/** \\brief  1F04, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO120_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029F04u)

/** Alias (User Manual Name) for CANR_MO120_FGPR.
* To use register names with standard convension, please use CANR_MO120_FGPR.
*/
#define	CANR_MOFGPR120	(CANR_MO120_FGPR)

/** \\brief  1F08, Message Object  Interrupt Pointer Register */
#define CANR_MO120_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029F08u)

/** Alias (User Manual Name) for CANR_MO120_IPR.
* To use register names with standard convension, please use CANR_MO120_IPR.
*/
#define	CANR_MOIPR120	(CANR_MO120_IPR)

/** \\brief  1F1C, Message Object  Control Register */
#define CANR_MO120_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF0029F1Cu)

/** Alias (User Manual Name) for CANR_MO120_STAT.
* To use register names with standard convension, please use CANR_MO120_STAT.
*/
#define	CANR_MOSTAT120	(CANR_MO120_STAT)

/** \\brief  1F2C, Message Object  Acceptance Mask Register */
#define CANR_MO121_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF0029F2Cu)

/** Alias (User Manual Name) for CANR_MO121_AMR.
* To use register names with standard convension, please use CANR_MO121_AMR.
*/
#define	CANR_MOAMR121	(CANR_MO121_AMR)

