HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxCan_reg.h
/** \\brief  1F38, Message Object  Arbitration Register */
#define CANR_MO121_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029F38u)

/** Alias (User Manual Name) for CANR_MO121_AR.
* To use register names with standard convension, please use CANR_MO121_AR.
*/
#define	CANR_MOAR121	(CANR_MO121_AR)

/** \\brief  1F3C, Message Object  Control Register */
#define CANR_MO121_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF0029F3Cu)

/** Alias (User Manual Name) for CANR_MO121_CTR.
* To use register names with standard convension, please use CANR_MO121_CTR.
*/
#define	CANR_MOCTR121	(CANR_MO121_CTR)

/** \\brief  1F34, Message Object  Data Register High */
#define CANR_MO121_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029F34u)

/** Alias (User Manual Name) for CANR_MO121_DATAH.
* To use register names with standard convension, please use CANR_MO121_DATAH.
*/
#define	CANR_MODATAH121	(CANR_MO121_DATAH)

/** \\brief  1F30, Message Object  Data Register Low */
#define CANR_MO121_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029F30u)

/** Alias (User Manual Name) for CANR_MO121_DATAL.
* To use register names with standard convension, please use CANR_MO121_DATAL.
*/
#define	CANR_MODATAL121	(CANR_MO121_DATAL)

/** \\brief  1F20, Message Object  Function Control Register */
#define CANR_MO121_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029F20u)

/** Alias (User Manual Name) for CANR_MO121_FCR.
* To use register names with standard convension, please use CANR_MO121_FCR.
*/
#define	CANR_MOFCR121	(CANR_MO121_FCR)

/** \\brief  1F24, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO121_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029F24u)

/** Alias (User Manual Name) for CANR_MO121_FGPR.
* To use register names with standard convension, please use CANR_MO121_FGPR.
*/
#define	CANR_MOFGPR121	(CANR_MO121_FGPR)

/** \\brief  1F28, Message Object  Interrupt Pointer Register */
#define CANR_MO121_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029F28u)

/** Alias (User Manual Name) for CANR_MO121_IPR.
* To use register names with standard convension, please use CANR_MO121_IPR.
*/
#define	CANR_MOIPR121	(CANR_MO121_IPR)

/** \\brief  1F3C, Message Object  Control Register */
#define CANR_MO121_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF0029F3Cu)

/** Alias (User Manual Name) for CANR_MO121_STAT.
* To use register names with standard convension, please use CANR_MO121_STAT.
*/
#define	CANR_MOSTAT121	(CANR_MO121_STAT)

/** \\brief  1F4C, Message Object  Acceptance Mask Register */
#define CANR_MO122_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF0029F4Cu)

/** Alias (User Manual Name) for CANR_MO122_AMR.
* To use register names with standard convension, please use CANR_MO122_AMR.
*/
#define	CANR_MOAMR122	(CANR_MO122_AMR)

/** \\brief  1F58, Message Object  Arbitration Register */
#define CANR_MO122_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029F58u)

/** Alias (User Manual Name) for CANR_MO122_AR.
* To use register names with standard convension, please use CANR_MO122_AR.
*/
#define	CANR_MOAR122	(CANR_MO122_AR)

/** \\brief  1F5C, Message Object  Control Register */
#define CANR_MO122_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF0029F5Cu)

/** Alias (User Manual Name) for CANR_MO122_CTR.
* To use register names with standard convension, please use CANR_MO122_CTR.
*/
#define	CANR_MOCTR122	(CANR_MO122_CTR)

/** \\brief  1F54, Message Object  Data Register High */
#define CANR_MO122_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029F54u)

/** Alias (User Manual Name) for CANR_MO122_DATAH.
* To use register names with standard convension, please use CANR_MO122_DATAH.
*/
#define	CANR_MODATAH122	(CANR_MO122_DATAH)

/** \\brief  1F50, Message Object  Data Register Low */
#define CANR_MO122_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029F50u)

/** Alias (User Manual Name) for CANR_MO122_DATAL.
* To use register names with standard convension, please use CANR_MO122_DATAL.
*/
#define	CANR_MODATAL122	(CANR_MO122_DATAL)

/** \\brief  1F40, Message Object  Function Control Register */
#define CANR_MO122_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029F40u)

/** Alias (User Manual Name) for CANR_MO122_FCR.
* To use register names with standard convension, please use CANR_MO122_FCR.
*/
#define	CANR_MOFCR122	(CANR_MO122_FCR)

/** \\brief  1F44, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO122_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029F44u)

/** Alias (User Manual Name) for CANR_MO122_FGPR.
* To use register names with standard convension, please use CANR_MO122_FGPR.
*/
#define	CANR_MOFGPR122	(CANR_MO122_FGPR)

/** \\brief  1F48, Message Object  Interrupt Pointer Register */
#define CANR_MO122_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029F48u)

/** Alias (User Manual Name) for CANR_MO122_IPR.
* To use register names with standard convension, please use CANR_MO122_IPR.
*/
#define	CANR_MOIPR122	(CANR_MO122_IPR)

/** \\brief  1F5C, Message Object  Control Register */
#define CANR_MO122_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF0029F5Cu)

/** Alias (User Manual Name) for CANR_MO122_STAT.
* To use register names with standard convension, please use CANR_MO122_STAT.
*/
#define	CANR_MOSTAT122	(CANR_MO122_STAT)

/** \\brief  1F6C, Message Object  Acceptance Mask Register */
#define CANR_MO123_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF0029F6Cu)

/** Alias (User Manual Name) for CANR_MO123_AMR.
* To use register names with standard convension, please use CANR_MO123_AMR.
*/
#define	CANR_MOAMR123	(CANR_MO123_AMR)

/** \\brief  1F78, Message Object  Arbitration Register */
#define CANR_MO123_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029F78u)

/** Alias (User Manual Name) for CANR_MO123_AR.
* To use register names with standard convension, please use CANR_MO123_AR.
*/
#define	CANR_MOAR123	(CANR_MO123_AR)

/** \\brief  1F7C, Message Object  Control Register */
#define CANR_MO123_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF0029F7Cu)

