HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxCan_reg.h
/** \\brief  118C, Message Object  Acceptance Mask Register */
#define CANR_MO12_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002918Cu)

/** Alias (User Manual Name) for CANR_MO12_AMR.
* To use register names with standard convension, please use CANR_MO12_AMR.
*/
#define	CANR_MOAMR12	(CANR_MO12_AMR)

/** \\brief  1198, Message Object  Arbitration Register */
#define CANR_MO12_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029198u)

/** Alias (User Manual Name) for CANR_MO12_AR.
* To use register names with standard convension, please use CANR_MO12_AR.
*/
#define	CANR_MOAR12	(CANR_MO12_AR)

/** \\brief  119C, Message Object  Control Register */
#define CANR_MO12_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF002919Cu)

/** Alias (User Manual Name) for CANR_MO12_CTR.
* To use register names with standard convension, please use CANR_MO12_CTR.
*/
#define	CANR_MOCTR12	(CANR_MO12_CTR)

/** \\brief  1194, Message Object  Data Register High */
#define CANR_MO12_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029194u)

/** Alias (User Manual Name) for CANR_MO12_DATAH.
* To use register names with standard convension, please use CANR_MO12_DATAH.
*/
#define	CANR_MODATAH12	(CANR_MO12_DATAH)

/** \\brief  1190, Message Object  Data Register Low */
#define CANR_MO12_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029190u)

/** Alias (User Manual Name) for CANR_MO12_DATAL.
* To use register names with standard convension, please use CANR_MO12_DATAL.
*/
#define	CANR_MODATAL12	(CANR_MO12_DATAL)

/** \\brief  1180, Message Object  Function Control Register */
#define CANR_MO12_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029180u)

/** Alias (User Manual Name) for CANR_MO12_FCR.
* To use register names with standard convension, please use CANR_MO12_FCR.
*/
#define	CANR_MOFCR12	(CANR_MO12_FCR)

/** \\brief  1184, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO12_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029184u)

/** Alias (User Manual Name) for CANR_MO12_FGPR.
* To use register names with standard convension, please use CANR_MO12_FGPR.
*/
#define	CANR_MOFGPR12	(CANR_MO12_FGPR)

/** \\brief  1188, Message Object  Interrupt Pointer Register */
#define CANR_MO12_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029188u)

/** Alias (User Manual Name) for CANR_MO12_IPR.
* To use register names with standard convension, please use CANR_MO12_IPR.
*/
#define	CANR_MOIPR12	(CANR_MO12_IPR)

/** \\brief  119C, Message Object  Control Register */
#define CANR_MO12_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF002919Cu)

/** Alias (User Manual Name) for CANR_MO12_STAT.
* To use register names with standard convension, please use CANR_MO12_STAT.
*/
#define	CANR_MOSTAT12	(CANR_MO12_STAT)



























































































/** \\brief  11AC, Message Object  Acceptance Mask Register */
#define CANR_MO13_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF00291ACu)

/** Alias (User Manual Name) for CANR_MO13_AMR.
* To use register names with standard convension, please use CANR_MO13_AMR.
*/
#define	CANR_MOAMR13	(CANR_MO13_AMR)

/** \\brief  11B8, Message Object  Arbitration Register */
#define CANR_MO13_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF00291B8u)

/** Alias (User Manual Name) for CANR_MO13_AR.
* To use register names with standard convension, please use CANR_MO13_AR.
*/
#define	CANR_MOAR13	(CANR_MO13_AR)

/** \\brief  11BC, Message Object  Control Register */
#define CANR_MO13_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF00291BCu)

/** Alias (User Manual Name) for CANR_MO13_CTR.
* To use register names with standard convension, please use CANR_MO13_CTR.
*/
#define	CANR_MOCTR13	(CANR_MO13_CTR)

/** \\brief  11B4, Message Object  Data Register High */
#define CANR_MO13_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF00291B4u)

/** Alias (User Manual Name) for CANR_MO13_DATAH.
* To use register names with standard convension, please use CANR_MO13_DATAH.
*/
#define	CANR_MODATAH13	(CANR_MO13_DATAH)

/** \\brief  11B0, Message Object  Data Register Low */
#define CANR_MO13_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF00291B0u)

/** Alias (User Manual Name) for CANR_MO13_DATAL.
* To use register names with standard convension, please use CANR_MO13_DATAL.
*/
#define	CANR_MODATAL13	(CANR_MO13_DATAL)

/** \\brief  11A0, Message Object  Function Control Register */
#define CANR_MO13_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF00291A0u)

/** Alias (User Manual Name) for CANR_MO13_FCR.
* To use register names with standard convension, please use CANR_MO13_FCR.
*/
#define	CANR_MOFCR13	(CANR_MO13_FCR)

/** \\brief  11A4, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO13_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF00291A4u)

/** Alias (User Manual Name) for CANR_MO13_FGPR.
* To use register names with standard convension, please use CANR_MO13_FGPR.
*/
#define	CANR_MOFGPR13	(CANR_MO13_FGPR)

/** \\brief  11A8, Message Object  Interrupt Pointer Register */
#define CANR_MO13_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF00291A8u)

/** Alias (User Manual Name) for CANR_MO13_IPR.
* To use register names with standard convension, please use CANR_MO13_IPR.
*/
#define	CANR_MOIPR13	(CANR_MO13_IPR)

/** \\brief  11BC, Message Object  Control Register */
#define CANR_MO13_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF00291BCu)

/** Alias (User Manual Name) for CANR_MO13_STAT.
* To use register names with standard convension, please use CANR_MO13_STAT.
*/
#define	CANR_MOSTAT13	(CANR_MO13_STAT)



























































































/** \\brief  11CC, Message Object  Acceptance Mask Register */
#define CANR_MO14_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF00291CCu)

/** Alias (User Manual Name) for CANR_MO14_AMR.
* To use register names with standard convension, please use CANR_MO14_AMR.
*/
#define	CANR_MOAMR14	(CANR_MO14_AMR)

