HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxCan_reg.h
/** \\brief  11D8, Message Object  Arbitration Register */
#define CANR_MO14_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF00291D8u)

/** Alias (User Manual Name) for CANR_MO14_AR.
* To use register names with standard convension, please use CANR_MO14_AR.
*/
#define	CANR_MOAR14	(CANR_MO14_AR)

/** \\brief  11DC, Message Object  Control Register */
#define CANR_MO14_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF00291DCu)

/** Alias (User Manual Name) for CANR_MO14_CTR.
* To use register names with standard convension, please use CANR_MO14_CTR.
*/
#define	CANR_MOCTR14	(CANR_MO14_CTR)

/** \\brief  11D4, Message Object  Data Register High */
#define CANR_MO14_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF00291D4u)

/** Alias (User Manual Name) for CANR_MO14_DATAH.
* To use register names with standard convension, please use CANR_MO14_DATAH.
*/
#define	CANR_MODATAH14	(CANR_MO14_DATAH)

/** \\brief  11D0, Message Object  Data Register Low */
#define CANR_MO14_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF00291D0u)

/** Alias (User Manual Name) for CANR_MO14_DATAL.
* To use register names with standard convension, please use CANR_MO14_DATAL.
*/
#define	CANR_MODATAL14	(CANR_MO14_DATAL)

/** \\brief  11C0, Message Object  Function Control Register */
#define CANR_MO14_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF00291C0u)

/** Alias (User Manual Name) for CANR_MO14_FCR.
* To use register names with standard convension, please use CANR_MO14_FCR.
*/
#define	CANR_MOFCR14	(CANR_MO14_FCR)

/** \\brief  11C4, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO14_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF00291C4u)

/** Alias (User Manual Name) for CANR_MO14_FGPR.
* To use register names with standard convension, please use CANR_MO14_FGPR.
*/
#define	CANR_MOFGPR14	(CANR_MO14_FGPR)

/** \\brief  11C8, Message Object  Interrupt Pointer Register */
#define CANR_MO14_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF00291C8u)

/** Alias (User Manual Name) for CANR_MO14_IPR.
* To use register names with standard convension, please use CANR_MO14_IPR.
*/
#define	CANR_MOIPR14	(CANR_MO14_IPR)

/** \\brief  11DC, Message Object  Control Register */
#define CANR_MO14_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF00291DCu)

/** Alias (User Manual Name) for CANR_MO14_STAT.
* To use register names with standard convension, please use CANR_MO14_STAT.
*/
#define	CANR_MOSTAT14	(CANR_MO14_STAT)



























































































/** \\brief  11EC, Message Object  Acceptance Mask Register */
#define CANR_MO15_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF00291ECu)

/** Alias (User Manual Name) for CANR_MO15_AMR.
* To use register names with standard convension, please use CANR_MO15_AMR.
*/
#define	CANR_MOAMR15	(CANR_MO15_AMR)

/** \\brief  11F8, Message Object  Arbitration Register */
#define CANR_MO15_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF00291F8u)

/** Alias (User Manual Name) for CANR_MO15_AR.
* To use register names with standard convension, please use CANR_MO15_AR.
*/
#define	CANR_MOAR15	(CANR_MO15_AR)

/** \\brief  11FC, Message Object  Control Register */
#define CANR_MO15_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF00291FCu)

/** Alias (User Manual Name) for CANR_MO15_CTR.
* To use register names with standard convension, please use CANR_MO15_CTR.
*/
#define	CANR_MOCTR15	(CANR_MO15_CTR)

/** \\brief  11F4, Message Object  Data Register High */
#define CANR_MO15_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF00291F4u)

/** Alias (User Manual Name) for CANR_MO15_DATAH.
* To use register names with standard convension, please use CANR_MO15_DATAH.
*/
#define	CANR_MODATAH15	(CANR_MO15_DATAH)

/** \\brief  11F0, Message Object  Data Register Low */
#define CANR_MO15_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF00291F0u)

/** Alias (User Manual Name) for CANR_MO15_DATAL.
* To use register names with standard convension, please use CANR_MO15_DATAL.
*/
#define	CANR_MODATAL15	(CANR_MO15_DATAL)

/** \\brief  11E0, Message Object  Function Control Register */
#define CANR_MO15_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF00291E0u)

/** Alias (User Manual Name) for CANR_MO15_FCR.
* To use register names with standard convension, please use CANR_MO15_FCR.
*/
#define	CANR_MOFCR15	(CANR_MO15_FCR)

/** \\brief  11E4, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO15_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF00291E4u)

/** Alias (User Manual Name) for CANR_MO15_FGPR.
* To use register names with standard convension, please use CANR_MO15_FGPR.
*/
#define	CANR_MOFGPR15	(CANR_MO15_FGPR)

/** \\brief  11E8, Message Object  Interrupt Pointer Register */
#define CANR_MO15_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF00291E8u)

/** Alias (User Manual Name) for CANR_MO15_IPR.
* To use register names with standard convension, please use CANR_MO15_IPR.
*/
#define	CANR_MOIPR15	(CANR_MO15_IPR)

/** \\brief  11FC, Message Object  Control Register */
#define CANR_MO15_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF00291FCu)

/** Alias (User Manual Name) for CANR_MO15_STAT.
* To use register names with standard convension, please use CANR_MO15_STAT.
*/
#define	CANR_MOSTAT15	(CANR_MO15_STAT)



























































































/** \\brief  120C, Message Object  Acceptance Mask Register */
#define CANR_MO16_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002920Cu)

/** Alias (User Manual Name) for CANR_MO16_AMR.
* To use register names with standard convension, please use CANR_MO16_AMR.
*/
#define	CANR_MOAMR16	(CANR_MO16_AMR)

/** \\brief  1218, Message Object  Arbitration Register */
#define CANR_MO16_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029218u)

/** Alias (User Manual Name) for CANR_MO16_AR.
* To use register names with standard convension, please use CANR_MO16_AR.
*/
#define	CANR_MOAR16	(CANR_MO16_AR)

