HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxCan_reg.h
/** \\brief  121C, Message Object  Control Register */
#define CANR_MO16_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF002921Cu)

/** Alias (User Manual Name) for CANR_MO16_CTR.
* To use register names with standard convension, please use CANR_MO16_CTR.
*/
#define	CANR_MOCTR16	(CANR_MO16_CTR)

/** \\brief  1214, Message Object  Data Register High */
#define CANR_MO16_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029214u)

/** Alias (User Manual Name) for CANR_MO16_DATAH.
* To use register names with standard convension, please use CANR_MO16_DATAH.
*/
#define	CANR_MODATAH16	(CANR_MO16_DATAH)

/** \\brief  1210, Message Object  Data Register Low */
#define CANR_MO16_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029210u)

/** Alias (User Manual Name) for CANR_MO16_DATAL.
* To use register names with standard convension, please use CANR_MO16_DATAL.
*/
#define	CANR_MODATAL16	(CANR_MO16_DATAL)

/** \\brief  1200, Message Object  Function Control Register */
#define CANR_MO16_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029200u)

/** Alias (User Manual Name) for CANR_MO16_FCR.
* To use register names with standard convension, please use CANR_MO16_FCR.
*/
#define	CANR_MOFCR16	(CANR_MO16_FCR)

/** \\brief  1204, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO16_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029204u)

/** Alias (User Manual Name) for CANR_MO16_FGPR.
* To use register names with standard convension, please use CANR_MO16_FGPR.
*/
#define	CANR_MOFGPR16	(CANR_MO16_FGPR)

/** \\brief  1208, Message Object  Interrupt Pointer Register */
#define CANR_MO16_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029208u)

/** Alias (User Manual Name) for CANR_MO16_IPR.
* To use register names with standard convension, please use CANR_MO16_IPR.
*/
#define	CANR_MOIPR16	(CANR_MO16_IPR)

/** \\brief  121C, Message Object  Control Register */
#define CANR_MO16_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF002921Cu)

/** Alias (User Manual Name) for CANR_MO16_STAT.
* To use register names with standard convension, please use CANR_MO16_STAT.
*/
#define	CANR_MOSTAT16	(CANR_MO16_STAT)



























































































/** \\brief  122C, Message Object  Acceptance Mask Register */
#define CANR_MO17_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002922Cu)

/** Alias (User Manual Name) for CANR_MO17_AMR.
* To use register names with standard convension, please use CANR_MO17_AMR.
*/
#define	CANR_MOAMR17	(CANR_MO17_AMR)

/** \\brief  1238, Message Object  Arbitration Register */
#define CANR_MO17_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029238u)

/** Alias (User Manual Name) for CANR_MO17_AR.
* To use register names with standard convension, please use CANR_MO17_AR.
*/
#define	CANR_MOAR17	(CANR_MO17_AR)

/** \\brief  123C, Message Object  Control Register */
#define CANR_MO17_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF002923Cu)

/** Alias (User Manual Name) for CANR_MO17_CTR.
* To use register names with standard convension, please use CANR_MO17_CTR.
*/
#define	CANR_MOCTR17	(CANR_MO17_CTR)

/** \\brief  1234, Message Object  Data Register High */
#define CANR_MO17_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029234u)

/** Alias (User Manual Name) for CANR_MO17_DATAH.
* To use register names with standard convension, please use CANR_MO17_DATAH.
*/
#define	CANR_MODATAH17	(CANR_MO17_DATAH)

/** \\brief  1230, Message Object  Data Register Low */
#define CANR_MO17_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029230u)

/** Alias (User Manual Name) for CANR_MO17_DATAL.
* To use register names with standard convension, please use CANR_MO17_DATAL.
*/
#define	CANR_MODATAL17	(CANR_MO17_DATAL)

/** \\brief  1220, Message Object  Function Control Register */
#define CANR_MO17_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029220u)

/** Alias (User Manual Name) for CANR_MO17_FCR.
* To use register names with standard convension, please use CANR_MO17_FCR.
*/
#define	CANR_MOFCR17	(CANR_MO17_FCR)

/** \\brief  1224, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO17_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029224u)

/** Alias (User Manual Name) for CANR_MO17_FGPR.
* To use register names with standard convension, please use CANR_MO17_FGPR.
*/
#define	CANR_MOFGPR17	(CANR_MO17_FGPR)

/** \\brief  1228, Message Object  Interrupt Pointer Register */
#define CANR_MO17_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029228u)

/** Alias (User Manual Name) for CANR_MO17_IPR.
* To use register names with standard convension, please use CANR_MO17_IPR.
*/
#define	CANR_MOIPR17	(CANR_MO17_IPR)

/** \\brief  123C, Message Object  Control Register */
#define CANR_MO17_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF002923Cu)

/** Alias (User Manual Name) for CANR_MO17_STAT.
* To use register names with standard convension, please use CANR_MO17_STAT.
*/
#define	CANR_MOSTAT17	(CANR_MO17_STAT)



























































































/** \\brief  124C, Message Object  Acceptance Mask Register */
#define CANR_MO18_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002924Cu)

/** Alias (User Manual Name) for CANR_MO18_AMR.
* To use register names with standard convension, please use CANR_MO18_AMR.
*/
#define	CANR_MOAMR18	(CANR_MO18_AMR)

/** \\brief  1258, Message Object  Arbitration Register */
#define CANR_MO18_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029258u)

/** Alias (User Manual Name) for CANR_MO18_AR.
* To use register names with standard convension, please use CANR_MO18_AR.
*/
#define	CANR_MOAR18	(CANR_MO18_AR)

/** \\brief  125C, Message Object  Control Register */
#define CANR_MO18_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF002925Cu)

/** Alias (User Manual Name) for CANR_MO18_CTR.
* To use register names with standard convension, please use CANR_MO18_CTR.
*/
#define	CANR_MOCTR18	(CANR_MO18_CTR)

/** \\brief  1254, Message Object  Data Register High */
#define CANR_MO18_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029254u)

/** Alias (User Manual Name) for CANR_MO18_DATAH.
* To use register names with standard convension, please use CANR_MO18_DATAH.
*/
#define	CANR_MODATAH18	(CANR_MO18_DATAH)

