HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxCan_reg.h
/** Alias (User Manual Name) for CANR_MO1_STAT.
* To use register names with standard convension, please use CANR_MO1_STAT.
*/
#define	CANR_MOSTAT1	(CANR_MO1_STAT)



























































































/** \\brief  128C, Message Object  Acceptance Mask Register */
#define CANR_MO20_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002928Cu)

/** Alias (User Manual Name) for CANR_MO20_AMR.
* To use register names with standard convension, please use CANR_MO20_AMR.
*/
#define	CANR_MOAMR20	(CANR_MO20_AMR)

/** \\brief  1298, Message Object  Arbitration Register */
#define CANR_MO20_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029298u)

/** Alias (User Manual Name) for CANR_MO20_AR.
* To use register names with standard convension, please use CANR_MO20_AR.
*/
#define	CANR_MOAR20	(CANR_MO20_AR)

/** \\brief  129C, Message Object  Control Register */
#define CANR_MO20_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF002929Cu)

/** Alias (User Manual Name) for CANR_MO20_CTR.
* To use register names with standard convension, please use CANR_MO20_CTR.
*/
#define	CANR_MOCTR20	(CANR_MO20_CTR)

/** \\brief  1294, Message Object  Data Register High */
#define CANR_MO20_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029294u)

/** Alias (User Manual Name) for CANR_MO20_DATAH.
* To use register names with standard convension, please use CANR_MO20_DATAH.
*/
#define	CANR_MODATAH20	(CANR_MO20_DATAH)

/** \\brief  1290, Message Object  Data Register Low */
#define CANR_MO20_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029290u)

/** Alias (User Manual Name) for CANR_MO20_DATAL.
* To use register names with standard convension, please use CANR_MO20_DATAL.
*/
#define	CANR_MODATAL20	(CANR_MO20_DATAL)

/** \\brief  1280, Message Object  Function Control Register */
#define CANR_MO20_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029280u)

/** Alias (User Manual Name) for CANR_MO20_FCR.
* To use register names with standard convension, please use CANR_MO20_FCR.
*/
#define	CANR_MOFCR20	(CANR_MO20_FCR)

/** \\brief  1284, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO20_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029284u)

/** Alias (User Manual Name) for CANR_MO20_FGPR.
* To use register names with standard convension, please use CANR_MO20_FGPR.
*/
#define	CANR_MOFGPR20	(CANR_MO20_FGPR)

/** \\brief  1288, Message Object  Interrupt Pointer Register */
#define CANR_MO20_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029288u)

/** Alias (User Manual Name) for CANR_MO20_IPR.
* To use register names with standard convension, please use CANR_MO20_IPR.
*/
#define	CANR_MOIPR20	(CANR_MO20_IPR)

/** \\brief  129C, Message Object  Control Register */
#define CANR_MO20_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF002929Cu)

/** Alias (User Manual Name) for CANR_MO20_STAT.
* To use register names with standard convension, please use CANR_MO20_STAT.
*/
#define	CANR_MOSTAT20	(CANR_MO20_STAT)



























































































/** \\brief  12AC, Message Object  Acceptance Mask Register */
#define CANR_MO21_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF00292ACu)

/** Alias (User Manual Name) for CANR_MO21_AMR.
* To use register names with standard convension, please use CANR_MO21_AMR.
*/
#define	CANR_MOAMR21	(CANR_MO21_AMR)

/** \\brief  12B8, Message Object  Arbitration Register */
#define CANR_MO21_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF00292B8u)

/** Alias (User Manual Name) for CANR_MO21_AR.
* To use register names with standard convension, please use CANR_MO21_AR.
*/
#define	CANR_MOAR21	(CANR_MO21_AR)

/** \\brief  12BC, Message Object  Control Register */
#define CANR_MO21_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF00292BCu)

/** Alias (User Manual Name) for CANR_MO21_CTR.
* To use register names with standard convension, please use CANR_MO21_CTR.
*/
#define	CANR_MOCTR21	(CANR_MO21_CTR)

/** \\brief  12B4, Message Object  Data Register High */
#define CANR_MO21_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF00292B4u)

/** Alias (User Manual Name) for CANR_MO21_DATAH.
* To use register names with standard convension, please use CANR_MO21_DATAH.
*/
#define	CANR_MODATAH21	(CANR_MO21_DATAH)

/** \\brief  12B0, Message Object  Data Register Low */
#define CANR_MO21_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF00292B0u)

/** Alias (User Manual Name) for CANR_MO21_DATAL.
* To use register names with standard convension, please use CANR_MO21_DATAL.
*/
#define	CANR_MODATAL21	(CANR_MO21_DATAL)

/** \\brief  12A0, Message Object  Function Control Register */
#define CANR_MO21_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF00292A0u)

/** Alias (User Manual Name) for CANR_MO21_FCR.
* To use register names with standard convension, please use CANR_MO21_FCR.
*/
#define	CANR_MOFCR21	(CANR_MO21_FCR)

/** \\brief  12A4, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO21_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF00292A4u)

/** Alias (User Manual Name) for CANR_MO21_FGPR.
* To use register names with standard convension, please use CANR_MO21_FGPR.
*/
#define	CANR_MOFGPR21	(CANR_MO21_FGPR)

/** \\brief  12A8, Message Object  Interrupt Pointer Register */
#define CANR_MO21_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF00292A8u)

/** Alias (User Manual Name) for CANR_MO21_IPR.
* To use register names with standard convension, please use CANR_MO21_IPR.
*/
#define	CANR_MOIPR21	(CANR_MO21_IPR)

/** \\brief  12BC, Message Object  Control Register */
#define CANR_MO21_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF00292BCu)

/** Alias (User Manual Name) for CANR_MO21_STAT.
* To use register names with standard convension, please use CANR_MO21_STAT.
*/
#define	CANR_MOSTAT21	(CANR_MO21_STAT)



























































































/** \\brief  12CC, Message Object  Acceptance Mask Register */
#define CANR_MO22_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF00292CCu)

/** Alias (User Manual Name) for CANR_MO22_AMR.
* To use register names with standard convension, please use CANR_MO22_AMR.
*/
#define	CANR_MOAMR22	(CANR_MO22_AMR)

/** \\brief  12D8, Message Object  Arbitration Register */
#define CANR_MO22_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF00292D8u)

/** Alias (User Manual Name) for CANR_MO22_AR.
* To use register names with standard convension, please use CANR_MO22_AR.
*/
#define	CANR_MOAR22	(CANR_MO22_AR)

/** \\brief  12DC, Message Object  Control Register */
#define CANR_MO22_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF00292DCu)

/** Alias (User Manual Name) for CANR_MO22_CTR.
* To use register names with standard convension, please use CANR_MO22_CTR.
*/
#define	CANR_MOCTR22	(CANR_MO22_CTR)

/** \\brief  12D4, Message Object  Data Register High */
#define CANR_MO22_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF00292D4u)

/** Alias (User Manual Name) for CANR_MO22_DATAH.
* To use register names with standard convension, please use CANR_MO22_DATAH.
*/
#define	CANR_MODATAH22	(CANR_MO22_DATAH)

/** \\brief  12D0, Message Object  Data Register Low */
#define CANR_MO22_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF00292D0u)

/** Alias (User Manual Name) for CANR_MO22_DATAL.
* To use register names with standard convension, please use CANR_MO22_DATAL.
*/
#define	CANR_MODATAL22	(CANR_MO22_DATAL)

