HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxCan_reg.h
/** \\brief  12C0, Message Object  Function Control Register */
#define CANR_MO22_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF00292C0u)

/** Alias (User Manual Name) for CANR_MO22_FCR.
* To use register names with standard convension, please use CANR_MO22_FCR.
*/
#define	CANR_MOFCR22	(CANR_MO22_FCR)

/** \\brief  12C4, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO22_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF00292C4u)

/** Alias (User Manual Name) for CANR_MO22_FGPR.
* To use register names with standard convension, please use CANR_MO22_FGPR.
*/
#define	CANR_MOFGPR22	(CANR_MO22_FGPR)

/** \\brief  12C8, Message Object  Interrupt Pointer Register */
#define CANR_MO22_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF00292C8u)

/** Alias (User Manual Name) for CANR_MO22_IPR.
* To use register names with standard convension, please use CANR_MO22_IPR.
*/
#define	CANR_MOIPR22	(CANR_MO22_IPR)

/** \\brief  12DC, Message Object  Control Register */
#define CANR_MO22_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF00292DCu)

/** Alias (User Manual Name) for CANR_MO22_STAT.
* To use register names with standard convension, please use CANR_MO22_STAT.
*/
#define	CANR_MOSTAT22	(CANR_MO22_STAT)



























































































/** \\brief  12EC, Message Object  Acceptance Mask Register */
#define CANR_MO23_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF00292ECu)

/** Alias (User Manual Name) for CANR_MO23_AMR.
* To use register names with standard convension, please use CANR_MO23_AMR.
*/
#define	CANR_MOAMR23	(CANR_MO23_AMR)

/** \\brief  12F8, Message Object  Arbitration Register */
#define CANR_MO23_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF00292F8u)

/** Alias (User Manual Name) for CANR_MO23_AR.
* To use register names with standard convension, please use CANR_MO23_AR.
*/
#define	CANR_MOAR23	(CANR_MO23_AR)

/** \\brief  12FC, Message Object  Control Register */
#define CANR_MO23_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF00292FCu)

/** Alias (User Manual Name) for CANR_MO23_CTR.
* To use register names with standard convension, please use CANR_MO23_CTR.
*/
#define	CANR_MOCTR23	(CANR_MO23_CTR)

/** \\brief  12F4, Message Object  Data Register High */
#define CANR_MO23_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF00292F4u)

/** Alias (User Manual Name) for CANR_MO23_DATAH.
* To use register names with standard convension, please use CANR_MO23_DATAH.
*/
#define	CANR_MODATAH23	(CANR_MO23_DATAH)

/** \\brief  12F0, Message Object  Data Register Low */
#define CANR_MO23_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF00292F0u)

/** Alias (User Manual Name) for CANR_MO23_DATAL.
* To use register names with standard convension, please use CANR_MO23_DATAL.
*/
#define	CANR_MODATAL23	(CANR_MO23_DATAL)

/** \\brief  12E0, Message Object  Function Control Register */
#define CANR_MO23_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF00292E0u)

/** Alias (User Manual Name) for CANR_MO23_FCR.
* To use register names with standard convension, please use CANR_MO23_FCR.
*/
#define	CANR_MOFCR23	(CANR_MO23_FCR)

/** \\brief  12E4, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO23_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF00292E4u)

/** Alias (User Manual Name) for CANR_MO23_FGPR.
* To use register names with standard convension, please use CANR_MO23_FGPR.
*/
#define	CANR_MOFGPR23	(CANR_MO23_FGPR)

/** \\brief  12E8, Message Object  Interrupt Pointer Register */
#define CANR_MO23_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF00292E8u)

/** Alias (User Manual Name) for CANR_MO23_IPR.
* To use register names with standard convension, please use CANR_MO23_IPR.
*/
#define	CANR_MOIPR23	(CANR_MO23_IPR)

/** \\brief  12FC, Message Object  Control Register */
#define CANR_MO23_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF00292FCu)

/** Alias (User Manual Name) for CANR_MO23_STAT.
* To use register names with standard convension, please use CANR_MO23_STAT.
*/
#define	CANR_MOSTAT23	(CANR_MO23_STAT)



























































































/** \\brief  130C, Message Object  Acceptance Mask Register */
#define CANR_MO24_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002930Cu)

/** Alias (User Manual Name) for CANR_MO24_AMR.
* To use register names with standard convension, please use CANR_MO24_AMR.
*/
#define	CANR_MOAMR24	(CANR_MO24_AMR)

/** \\brief  1318, Message Object  Arbitration Register */
#define CANR_MO24_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029318u)

/** Alias (User Manual Name) for CANR_MO24_AR.
* To use register names with standard convension, please use CANR_MO24_AR.
*/
#define	CANR_MOAR24	(CANR_MO24_AR)

/** \\brief  131C, Message Object  Control Register */
#define CANR_MO24_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF002931Cu)

/** Alias (User Manual Name) for CANR_MO24_CTR.
* To use register names with standard convension, please use CANR_MO24_CTR.
*/
#define	CANR_MOCTR24	(CANR_MO24_CTR)

/** \\brief  1314, Message Object  Data Register High */
#define CANR_MO24_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029314u)

/** Alias (User Manual Name) for CANR_MO24_DATAH.
* To use register names with standard convension, please use CANR_MO24_DATAH.
*/
#define	CANR_MODATAH24	(CANR_MO24_DATAH)

/** \\brief  1310, Message Object  Data Register Low */
#define CANR_MO24_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029310u)

/** Alias (User Manual Name) for CANR_MO24_DATAL.
* To use register names with standard convension, please use CANR_MO24_DATAL.
*/
#define	CANR_MODATAL24	(CANR_MO24_DATAL)

/** \\brief  1300, Message Object  Function Control Register */
#define CANR_MO24_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029300u)

/** Alias (User Manual Name) for CANR_MO24_FCR.
* To use register names with standard convension, please use CANR_MO24_FCR.
*/
#define	CANR_MOFCR24	(CANR_MO24_FCR)

