HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxCan_reg.h
/** Alias (User Manual Name) for CANR_MO29_CTR.
* To use register names with standard convension, please use CANR_MO29_CTR.
*/
#define	CANR_MOCTR29	(CANR_MO29_CTR)

/** \\brief  13B4, Message Object  Data Register High */
#define CANR_MO29_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF00293B4u)

/** Alias (User Manual Name) for CANR_MO29_DATAH.
* To use register names with standard convension, please use CANR_MO29_DATAH.
*/
#define	CANR_MODATAH29	(CANR_MO29_DATAH)

/** \\brief  13B0, Message Object  Data Register Low */
#define CANR_MO29_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF00293B0u)

/** Alias (User Manual Name) for CANR_MO29_DATAL.
* To use register names with standard convension, please use CANR_MO29_DATAL.
*/
#define	CANR_MODATAL29	(CANR_MO29_DATAL)

/** \\brief  13A0, Message Object  Function Control Register */
#define CANR_MO29_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF00293A0u)

/** Alias (User Manual Name) for CANR_MO29_FCR.
* To use register names with standard convension, please use CANR_MO29_FCR.
*/
#define	CANR_MOFCR29	(CANR_MO29_FCR)

/** \\brief  13A4, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO29_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF00293A4u)

/** Alias (User Manual Name) for CANR_MO29_FGPR.
* To use register names with standard convension, please use CANR_MO29_FGPR.
*/
#define	CANR_MOFGPR29	(CANR_MO29_FGPR)

/** \\brief  13A8, Message Object  Interrupt Pointer Register */
#define CANR_MO29_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF00293A8u)

/** Alias (User Manual Name) for CANR_MO29_IPR.
* To use register names with standard convension, please use CANR_MO29_IPR.
*/
#define	CANR_MOIPR29	(CANR_MO29_IPR)

/** \\brief  13BC, Message Object  Control Register */
#define CANR_MO29_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF00293BCu)

/** Alias (User Manual Name) for CANR_MO29_STAT.
* To use register names with standard convension, please use CANR_MO29_STAT.
*/
#define	CANR_MOSTAT29	(CANR_MO29_STAT)

/** \\brief  104C, Message Object  Acceptance Mask Register */
#define CANR_MO2_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002904Cu)

/** Alias (User Manual Name) for CANR_MO2_AMR.
* To use register names with standard convension, please use CANR_MO2_AMR.
*/
#define	CANR_MOAMR2	(CANR_MO2_AMR)

/** \\brief  1058, Message Object  Arbitration Register */
#define CANR_MO2_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029058u)

/** Alias (User Manual Name) for CANR_MO2_AR.
* To use register names with standard convension, please use CANR_MO2_AR.
*/
#define	CANR_MOAR2	(CANR_MO2_AR)

/** \\brief  105C, Message Object  Control Register */
#define CANR_MO2_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF002905Cu)

/** Alias (User Manual Name) for CANR_MO2_CTR.
* To use register names with standard convension, please use CANR_MO2_CTR.
*/
#define	CANR_MOCTR2	(CANR_MO2_CTR)

/** \\brief  1054, Message Object  Data Register High */
#define CANR_MO2_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029054u)

/** Alias (User Manual Name) for CANR_MO2_DATAH.
* To use register names with standard convension, please use CANR_MO2_DATAH.
*/
#define	CANR_MODATAH2	(CANR_MO2_DATAH)

/** \\brief  1050, Message Object  Data Register Low */
#define CANR_MO2_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029050u)

/** Alias (User Manual Name) for CANR_MO2_DATAL.
* To use register names with standard convension, please use CANR_MO2_DATAL.
*/
#define	CANR_MODATAL2	(CANR_MO2_DATAL)

/** \\brief  1040, Message Object  Function Control Register */
#define CANR_MO2_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029040u)

/** Alias (User Manual Name) for CANR_MO2_FCR.
* To use register names with standard convension, please use CANR_MO2_FCR.
*/
#define	CANR_MOFCR2	(CANR_MO2_FCR)

/** \\brief  1044, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO2_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029044u)

/** Alias (User Manual Name) for CANR_MO2_FGPR.
* To use register names with standard convension, please use CANR_MO2_FGPR.
*/
#define	CANR_MOFGPR2	(CANR_MO2_FGPR)

/** \\brief  1048, Message Object  Interrupt Pointer Register */
#define CANR_MO2_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029048u)

/** Alias (User Manual Name) for CANR_MO2_IPR.
* To use register names with standard convension, please use CANR_MO2_IPR.
*/
#define	CANR_MOIPR2	(CANR_MO2_IPR)

/** \\brief  105C, Message Object  Control Register */
#define CANR_MO2_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF002905Cu)

/** Alias (User Manual Name) for CANR_MO2_STAT.
* To use register names with standard convension, please use CANR_MO2_STAT.
*/
#define	CANR_MOSTAT2	(CANR_MO2_STAT)

/** \\brief  13CC, Message Object  Acceptance Mask Register */
#define CANR_MO30_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF00293CCu)

/** Alias (User Manual Name) for CANR_MO30_AMR.
* To use register names with standard convension, please use CANR_MO30_AMR.
*/
#define	CANR_MOAMR30	(CANR_MO30_AMR)

/** \\brief  13D8, Message Object  Arbitration Register */
#define CANR_MO30_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF00293D8u)

/** Alias (User Manual Name) for CANR_MO30_AR.
* To use register names with standard convension, please use CANR_MO30_AR.
*/
#define	CANR_MOAR30	(CANR_MO30_AR)

/** \\brief  13DC, Message Object  Control Register */
#define CANR_MO30_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF00293DCu)

/** Alias (User Manual Name) for CANR_MO30_CTR.
* To use register names with standard convension, please use CANR_MO30_CTR.
*/
#define	CANR_MOCTR30	(CANR_MO30_CTR)

/** \\brief  13D4, Message Object  Data Register High */
#define CANR_MO30_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF00293D4u)

/** Alias (User Manual Name) for CANR_MO30_DATAH.
* To use register names with standard convension, please use CANR_MO30_DATAH.
*/
#define	CANR_MODATAH30	(CANR_MO30_DATAH)

/** \\brief  13D0, Message Object  Data Register Low */
#define CANR_MO30_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF00293D0u)

/** Alias (User Manual Name) for CANR_MO30_DATAL.
* To use register names with standard convension, please use CANR_MO30_DATAL.
*/
#define	CANR_MODATAL30	(CANR_MO30_DATAL)

/** \\brief  13C0, Message Object  Function Control Register */
#define CANR_MO30_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF00293C0u)

/** Alias (User Manual Name) for CANR_MO30_FCR.
* To use register names with standard convension, please use CANR_MO30_FCR.
*/
#define	CANR_MOFCR30	(CANR_MO30_FCR)

