HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxCan_reg.h
/** \\brief  13C4, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO30_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF00293C4u)

/** Alias (User Manual Name) for CANR_MO30_FGPR.
* To use register names with standard convension, please use CANR_MO30_FGPR.
*/
#define	CANR_MOFGPR30	(CANR_MO30_FGPR)

/** \\brief  13C8, Message Object  Interrupt Pointer Register */
#define CANR_MO30_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF00293C8u)

/** Alias (User Manual Name) for CANR_MO30_IPR.
* To use register names with standard convension, please use CANR_MO30_IPR.
*/
#define	CANR_MOIPR30	(CANR_MO30_IPR)

/** \\brief  13DC, Message Object  Control Register */
#define CANR_MO30_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF00293DCu)

/** Alias (User Manual Name) for CANR_MO30_STAT.
* To use register names with standard convension, please use CANR_MO30_STAT.
*/
#define	CANR_MOSTAT30	(CANR_MO30_STAT)

/** \\brief  13EC, Message Object  Acceptance Mask Register */
#define CANR_MO31_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF00293ECu)

/** Alias (User Manual Name) for CANR_MO31_AMR.
* To use register names with standard convension, please use CANR_MO31_AMR.
*/
#define	CANR_MOAMR31	(CANR_MO31_AMR)

/** \\brief  13F8, Message Object  Arbitration Register */
#define CANR_MO31_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF00293F8u)

/** Alias (User Manual Name) for CANR_MO31_AR.
* To use register names with standard convension, please use CANR_MO31_AR.
*/
#define	CANR_MOAR31	(CANR_MO31_AR)

/** \\brief  13FC, Message Object  Control Register */
#define CANR_MO31_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF00293FCu)

/** Alias (User Manual Name) for CANR_MO31_CTR.
* To use register names with standard convension, please use CANR_MO31_CTR.
*/
#define	CANR_MOCTR31	(CANR_MO31_CTR)

/** \\brief  13F4, Message Object  Data Register High */
#define CANR_MO31_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF00293F4u)

/** Alias (User Manual Name) for CANR_MO31_DATAH.
* To use register names with standard convension, please use CANR_MO31_DATAH.
*/
#define	CANR_MODATAH31	(CANR_MO31_DATAH)

/** \\brief  13F0, Message Object  Data Register Low */
#define CANR_MO31_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF00293F0u)

/** Alias (User Manual Name) for CANR_MO31_DATAL.
* To use register names with standard convension, please use CANR_MO31_DATAL.
*/
#define	CANR_MODATAL31	(CANR_MO31_DATAL)

/** \\brief  13E0, Message Object  Function Control Register */
#define CANR_MO31_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF00293E0u)

/** Alias (User Manual Name) for CANR_MO31_FCR.
* To use register names with standard convension, please use CANR_MO31_FCR.
*/
#define	CANR_MOFCR31	(CANR_MO31_FCR)

/** \\brief  13E4, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO31_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF00293E4u)

/** Alias (User Manual Name) for CANR_MO31_FGPR.
* To use register names with standard convension, please use CANR_MO31_FGPR.
*/
#define	CANR_MOFGPR31	(CANR_MO31_FGPR)

/** \\brief  13E8, Message Object  Interrupt Pointer Register */
#define CANR_MO31_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF00293E8u)

/** Alias (User Manual Name) for CANR_MO31_IPR.
* To use register names with standard convension, please use CANR_MO31_IPR.
*/
#define	CANR_MOIPR31	(CANR_MO31_IPR)

/** \\brief  13FC, Message Object  Control Register */
#define CANR_MO31_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF00293FCu)

/** Alias (User Manual Name) for CANR_MO31_STAT.
* To use register names with standard convension, please use CANR_MO31_STAT.
*/
#define	CANR_MOSTAT31	(CANR_MO31_STAT)

/** \\brief  140C, Message Object  Acceptance Mask Register */
#define CANR_MO32_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002940Cu)

/** Alias (User Manual Name) for CANR_MO32_AMR.
* To use register names with standard convension, please use CANR_MO32_AMR.
*/
#define	CANR_MOAMR32	(CANR_MO32_AMR)

/** \\brief  1418, Message Object  Arbitration Register */
#define CANR_MO32_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029418u)

/** Alias (User Manual Name) for CANR_MO32_AR.
* To use register names with standard convension, please use CANR_MO32_AR.
*/
#define	CANR_MOAR32	(CANR_MO32_AR)

/** \\brief  141C, Message Object  Control Register */
#define CANR_MO32_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF002941Cu)

/** Alias (User Manual Name) for CANR_MO32_CTR.
* To use register names with standard convension, please use CANR_MO32_CTR.
*/
#define	CANR_MOCTR32	(CANR_MO32_CTR)

/** \\brief  1414, Message Object  Data Register High */
#define CANR_MO32_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029414u)

/** Alias (User Manual Name) for CANR_MO32_DATAH.
* To use register names with standard convension, please use CANR_MO32_DATAH.
*/
#define	CANR_MODATAH32	(CANR_MO32_DATAH)

/** \\brief  1410, Message Object  Data Register Low */
#define CANR_MO32_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029410u)

/** Alias (User Manual Name) for CANR_MO32_DATAL.
* To use register names with standard convension, please use CANR_MO32_DATAL.
*/
#define	CANR_MODATAL32	(CANR_MO32_DATAL)

/** \\brief  1400, Message Object  Function Control Register */
#define CANR_MO32_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029400u)

/** Alias (User Manual Name) for CANR_MO32_FCR.
* To use register names with standard convension, please use CANR_MO32_FCR.
*/
#define	CANR_MOFCR32	(CANR_MO32_FCR)

/** \\brief  1404, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO32_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029404u)

/** Alias (User Manual Name) for CANR_MO32_FGPR.
* To use register names with standard convension, please use CANR_MO32_FGPR.
*/
#define	CANR_MOFGPR32	(CANR_MO32_FGPR)

/** \\brief  1408, Message Object  Interrupt Pointer Register */
#define CANR_MO32_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029408u)

/** Alias (User Manual Name) for CANR_MO32_IPR.
* To use register names with standard convension, please use CANR_MO32_IPR.
*/
#define	CANR_MOIPR32	(CANR_MO32_IPR)

