HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxCan_reg.h
/** \\brief  1474, Message Object  Data Register High */
#define CANR_MO35_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029474u)

/** Alias (User Manual Name) for CANR_MO35_DATAH.
* To use register names with standard convension, please use CANR_MO35_DATAH.
*/
#define	CANR_MODATAH35	(CANR_MO35_DATAH)

/** \\brief  1470, Message Object  Data Register Low */
#define CANR_MO35_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029470u)

/** Alias (User Manual Name) for CANR_MO35_DATAL.
* To use register names with standard convension, please use CANR_MO35_DATAL.
*/
#define	CANR_MODATAL35	(CANR_MO35_DATAL)

/** \\brief  1460, Message Object  Function Control Register */
#define CANR_MO35_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029460u)

/** Alias (User Manual Name) for CANR_MO35_FCR.
* To use register names with standard convension, please use CANR_MO35_FCR.
*/
#define	CANR_MOFCR35	(CANR_MO35_FCR)

/** \\brief  1464, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO35_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029464u)

/** Alias (User Manual Name) for CANR_MO35_FGPR.
* To use register names with standard convension, please use CANR_MO35_FGPR.
*/
#define	CANR_MOFGPR35	(CANR_MO35_FGPR)

/** \\brief  1468, Message Object  Interrupt Pointer Register */
#define CANR_MO35_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029468u)

/** Alias (User Manual Name) for CANR_MO35_IPR.
* To use register names with standard convension, please use CANR_MO35_IPR.
*/
#define	CANR_MOIPR35	(CANR_MO35_IPR)

/** \\brief  147C, Message Object  Control Register */
#define CANR_MO35_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF002947Cu)

/** Alias (User Manual Name) for CANR_MO35_STAT.
* To use register names with standard convension, please use CANR_MO35_STAT.
*/
#define	CANR_MOSTAT35	(CANR_MO35_STAT)

/** \\brief  148C, Message Object  Acceptance Mask Register */
#define CANR_MO36_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002948Cu)

/** Alias (User Manual Name) for CANR_MO36_AMR.
* To use register names with standard convension, please use CANR_MO36_AMR.
*/
#define	CANR_MOAMR36	(CANR_MO36_AMR)

/** \\brief  1498, Message Object  Arbitration Register */
#define CANR_MO36_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029498u)

/** Alias (User Manual Name) for CANR_MO36_AR.
* To use register names with standard convension, please use CANR_MO36_AR.
*/
#define	CANR_MOAR36	(CANR_MO36_AR)

/** \\brief  149C, Message Object  Control Register */
#define CANR_MO36_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF002949Cu)

/** Alias (User Manual Name) for CANR_MO36_CTR.
* To use register names with standard convension, please use CANR_MO36_CTR.
*/
#define	CANR_MOCTR36	(CANR_MO36_CTR)

/** \\brief  1494, Message Object  Data Register High */
#define CANR_MO36_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029494u)

/** Alias (User Manual Name) for CANR_MO36_DATAH.
* To use register names with standard convension, please use CANR_MO36_DATAH.
*/
#define	CANR_MODATAH36	(CANR_MO36_DATAH)

/** \\brief  1490, Message Object  Data Register Low */
#define CANR_MO36_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029490u)

/** Alias (User Manual Name) for CANR_MO36_DATAL.
* To use register names with standard convension, please use CANR_MO36_DATAL.
*/
#define	CANR_MODATAL36	(CANR_MO36_DATAL)

/** \\brief  1480, Message Object  Function Control Register */
#define CANR_MO36_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029480u)

/** Alias (User Manual Name) for CANR_MO36_FCR.
* To use register names with standard convension, please use CANR_MO36_FCR.
*/
#define	CANR_MOFCR36	(CANR_MO36_FCR)

/** \\brief  1484, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO36_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029484u)

/** Alias (User Manual Name) for CANR_MO36_FGPR.
* To use register names with standard convension, please use CANR_MO36_FGPR.
*/
#define	CANR_MOFGPR36	(CANR_MO36_FGPR)

/** \\brief  1488, Message Object  Interrupt Pointer Register */
#define CANR_MO36_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029488u)

/** Alias (User Manual Name) for CANR_MO36_IPR.
* To use register names with standard convension, please use CANR_MO36_IPR.
*/
#define	CANR_MOIPR36	(CANR_MO36_IPR)

/** \\brief  149C, Message Object  Control Register */
#define CANR_MO36_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF002949Cu)

/** Alias (User Manual Name) for CANR_MO36_STAT.
* To use register names with standard convension, please use CANR_MO36_STAT.
*/
#define	CANR_MOSTAT36	(CANR_MO36_STAT)

/** \\brief  14AC, Message Object  Acceptance Mask Register */
#define CANR_MO37_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF00294ACu)

/** Alias (User Manual Name) for CANR_MO37_AMR.
* To use register names with standard convension, please use CANR_MO37_AMR.
*/
#define	CANR_MOAMR37	(CANR_MO37_AMR)

/** \\brief  14B8, Message Object  Arbitration Register */
#define CANR_MO37_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF00294B8u)

/** Alias (User Manual Name) for CANR_MO37_AR.
* To use register names with standard convension, please use CANR_MO37_AR.
*/
#define	CANR_MOAR37	(CANR_MO37_AR)

/** \\brief  14BC, Message Object  Control Register */
#define CANR_MO37_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF00294BCu)

/** Alias (User Manual Name) for CANR_MO37_CTR.
* To use register names with standard convension, please use CANR_MO37_CTR.
*/
#define	CANR_MOCTR37	(CANR_MO37_CTR)

/** \\brief  14B4, Message Object  Data Register High */
#define CANR_MO37_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF00294B4u)

/** Alias (User Manual Name) for CANR_MO37_DATAH.
* To use register names with standard convension, please use CANR_MO37_DATAH.
*/
#define	CANR_MODATAH37	(CANR_MO37_DATAH)

/** \\brief  14B0, Message Object  Data Register Low */
#define CANR_MO37_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF00294B0u)

