HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxCan_reg.h
/** Alias (User Manual Name) for CANR_MO37_DATAL.
* To use register names with standard convension, please use CANR_MO37_DATAL.
*/
#define	CANR_MODATAL37	(CANR_MO37_DATAL)

/** \\brief  14A0, Message Object  Function Control Register */
#define CANR_MO37_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF00294A0u)

/** Alias (User Manual Name) for CANR_MO37_FCR.
* To use register names with standard convension, please use CANR_MO37_FCR.
*/
#define	CANR_MOFCR37	(CANR_MO37_FCR)

/** \\brief  14A4, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO37_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF00294A4u)

/** Alias (User Manual Name) for CANR_MO37_FGPR.
* To use register names with standard convension, please use CANR_MO37_FGPR.
*/
#define	CANR_MOFGPR37	(CANR_MO37_FGPR)

/** \\brief  14A8, Message Object  Interrupt Pointer Register */
#define CANR_MO37_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF00294A8u)

/** Alias (User Manual Name) for CANR_MO37_IPR.
* To use register names with standard convension, please use CANR_MO37_IPR.
*/
#define	CANR_MOIPR37	(CANR_MO37_IPR)

/** \\brief  14BC, Message Object  Control Register */
#define CANR_MO37_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF00294BCu)

/** Alias (User Manual Name) for CANR_MO37_STAT.
* To use register names with standard convension, please use CANR_MO37_STAT.
*/
#define	CANR_MOSTAT37	(CANR_MO37_STAT)

/** \\brief  14CC, Message Object  Acceptance Mask Register */
#define CANR_MO38_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF00294CCu)

/** Alias (User Manual Name) for CANR_MO38_AMR.
* To use register names with standard convension, please use CANR_MO38_AMR.
*/
#define	CANR_MOAMR38	(CANR_MO38_AMR)

/** \\brief  14D8, Message Object  Arbitration Register */
#define CANR_MO38_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF00294D8u)

/** Alias (User Manual Name) for CANR_MO38_AR.
* To use register names with standard convension, please use CANR_MO38_AR.
*/
#define	CANR_MOAR38	(CANR_MO38_AR)

/** \\brief  14DC, Message Object  Control Register */
#define CANR_MO38_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF00294DCu)

/** Alias (User Manual Name) for CANR_MO38_CTR.
* To use register names with standard convension, please use CANR_MO38_CTR.
*/
#define	CANR_MOCTR38	(CANR_MO38_CTR)

/** \\brief  14D4, Message Object  Data Register High */
#define CANR_MO38_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF00294D4u)

/** Alias (User Manual Name) for CANR_MO38_DATAH.
* To use register names with standard convension, please use CANR_MO38_DATAH.
*/
#define	CANR_MODATAH38	(CANR_MO38_DATAH)

/** \\brief  14D0, Message Object  Data Register Low */
#define CANR_MO38_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF00294D0u)

/** Alias (User Manual Name) for CANR_MO38_DATAL.
* To use register names with standard convension, please use CANR_MO38_DATAL.
*/
#define	CANR_MODATAL38	(CANR_MO38_DATAL)

/** \\brief  14C0, Message Object  Function Control Register */
#define CANR_MO38_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF00294C0u)

/** Alias (User Manual Name) for CANR_MO38_FCR.
* To use register names with standard convension, please use CANR_MO38_FCR.
*/
#define	CANR_MOFCR38	(CANR_MO38_FCR)

/** \\brief  14C4, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO38_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF00294C4u)

/** Alias (User Manual Name) for CANR_MO38_FGPR.
* To use register names with standard convension, please use CANR_MO38_FGPR.
*/
#define	CANR_MOFGPR38	(CANR_MO38_FGPR)

/** \\brief  14C8, Message Object  Interrupt Pointer Register */
#define CANR_MO38_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF00294C8u)

/** Alias (User Manual Name) for CANR_MO38_IPR.
* To use register names with standard convension, please use CANR_MO38_IPR.
*/
#define	CANR_MOIPR38	(CANR_MO38_IPR)

/** \\brief  14DC, Message Object  Control Register */
#define CANR_MO38_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF00294DCu)

/** Alias (User Manual Name) for CANR_MO38_STAT.
* To use register names with standard convension, please use CANR_MO38_STAT.
*/
#define	CANR_MOSTAT38	(CANR_MO38_STAT)

/** \\brief  14EC, Message Object  Acceptance Mask Register */
#define CANR_MO39_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF00294ECu)

/** Alias (User Manual Name) for CANR_MO39_AMR.
* To use register names with standard convension, please use CANR_MO39_AMR.
*/
#define	CANR_MOAMR39	(CANR_MO39_AMR)

/** \\brief  14F8, Message Object  Arbitration Register */
#define CANR_MO39_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF00294F8u)

/** Alias (User Manual Name) for CANR_MO39_AR.
* To use register names with standard convension, please use CANR_MO39_AR.
*/
#define	CANR_MOAR39	(CANR_MO39_AR)

/** \\brief  14FC, Message Object  Control Register */
#define CANR_MO39_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF00294FCu)

/** Alias (User Manual Name) for CANR_MO39_CTR.
* To use register names with standard convension, please use CANR_MO39_CTR.
*/
#define	CANR_MOCTR39	(CANR_MO39_CTR)

/** \\brief  14F4, Message Object  Data Register High */
#define CANR_MO39_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF00294F4u)

/** Alias (User Manual Name) for CANR_MO39_DATAH.
* To use register names with standard convension, please use CANR_MO39_DATAH.
*/
#define	CANR_MODATAH39	(CANR_MO39_DATAH)

/** \\brief  14F0, Message Object  Data Register Low */
#define CANR_MO39_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF00294F0u)

/** Alias (User Manual Name) for CANR_MO39_DATAL.
* To use register names with standard convension, please use CANR_MO39_DATAL.
*/
#define	CANR_MODATAL39	(CANR_MO39_DATAL)

/** \\brief  14E0, Message Object  Function Control Register */
#define CANR_MO39_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF00294E0u)

/** Alias (User Manual Name) for CANR_MO39_FCR.
* To use register names with standard convension, please use CANR_MO39_FCR.
*/
#define	CANR_MOFCR39	(CANR_MO39_FCR)

/** \\brief  14E4, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO39_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF00294E4u)

/** Alias (User Manual Name) for CANR_MO39_FGPR.
* To use register names with standard convension, please use CANR_MO39_FGPR.
*/
#define	CANR_MOFGPR39	(CANR_MO39_FGPR)

/** \\brief  14E8, Message Object  Interrupt Pointer Register */
#define CANR_MO39_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF00294E8u)

