HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxCan_reg.h
/** Alias (User Manual Name) for CANR_MO39_IPR.
* To use register names with standard convension, please use CANR_MO39_IPR.
*/
#define	CANR_MOIPR39	(CANR_MO39_IPR)

/** \\brief  14FC, Message Object  Control Register */
#define CANR_MO39_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF00294FCu)

/** Alias (User Manual Name) for CANR_MO39_STAT.
* To use register names with standard convension, please use CANR_MO39_STAT.
*/
#define	CANR_MOSTAT39	(CANR_MO39_STAT)

/** \\brief  106C, Message Object  Acceptance Mask Register */
#define CANR_MO3_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002906Cu)

/** Alias (User Manual Name) for CANR_MO3_AMR.
* To use register names with standard convension, please use CANR_MO3_AMR.
*/
#define	CANR_MOAMR3	(CANR_MO3_AMR)

/** \\brief  1078, Message Object  Arbitration Register */
#define CANR_MO3_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029078u)

/** Alias (User Manual Name) for CANR_MO3_AR.
* To use register names with standard convension, please use CANR_MO3_AR.
*/
#define	CANR_MOAR3	(CANR_MO3_AR)

/** \\brief  107C, Message Object  Control Register */
#define CANR_MO3_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF002907Cu)

/** Alias (User Manual Name) for CANR_MO3_CTR.
* To use register names with standard convension, please use CANR_MO3_CTR.
*/
#define	CANR_MOCTR3	(CANR_MO3_CTR)

/** \\brief  1074, Message Object  Data Register High */
#define CANR_MO3_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029074u)

/** Alias (User Manual Name) for CANR_MO3_DATAH.
* To use register names with standard convension, please use CANR_MO3_DATAH.
*/
#define	CANR_MODATAH3	(CANR_MO3_DATAH)

/** \\brief  1070, Message Object  Data Register Low */
#define CANR_MO3_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029070u)

/** Alias (User Manual Name) for CANR_MO3_DATAL.
* To use register names with standard convension, please use CANR_MO3_DATAL.
*/
#define	CANR_MODATAL3	(CANR_MO3_DATAL)

/** \\brief  1060, Message Object  Function Control Register */
#define CANR_MO3_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029060u)

/** Alias (User Manual Name) for CANR_MO3_FCR.
* To use register names with standard convension, please use CANR_MO3_FCR.
*/
#define	CANR_MOFCR3	(CANR_MO3_FCR)

/** \\brief  1064, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO3_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029064u)

/** Alias (User Manual Name) for CANR_MO3_FGPR.
* To use register names with standard convension, please use CANR_MO3_FGPR.
*/
#define	CANR_MOFGPR3	(CANR_MO3_FGPR)

/** \\brief  1068, Message Object  Interrupt Pointer Register */
#define CANR_MO3_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029068u)

/** Alias (User Manual Name) for CANR_MO3_IPR.
* To use register names with standard convension, please use CANR_MO3_IPR.
*/
#define	CANR_MOIPR3	(CANR_MO3_IPR)

/** \\brief  107C, Message Object  Control Register */
#define CANR_MO3_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF002907Cu)

/** Alias (User Manual Name) for CANR_MO3_STAT.
* To use register names with standard convension, please use CANR_MO3_STAT.
*/
#define	CANR_MOSTAT3	(CANR_MO3_STAT)

/** \\brief  150C, Message Object  Acceptance Mask Register */
#define CANR_MO40_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002950Cu)

/** Alias (User Manual Name) for CANR_MO40_AMR.
* To use register names with standard convension, please use CANR_MO40_AMR.
*/
#define	CANR_MOAMR40	(CANR_MO40_AMR)

/** \\brief  1518, Message Object  Arbitration Register */
#define CANR_MO40_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029518u)

/** Alias (User Manual Name) for CANR_MO40_AR.
* To use register names with standard convension, please use CANR_MO40_AR.
*/
#define	CANR_MOAR40	(CANR_MO40_AR)

/** \\brief  151C, Message Object  Control Register */
#define CANR_MO40_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF002951Cu)

/** Alias (User Manual Name) for CANR_MO40_CTR.
* To use register names with standard convension, please use CANR_MO40_CTR.
*/
#define	CANR_MOCTR40	(CANR_MO40_CTR)

/** \\brief  1514, Message Object  Data Register High */
#define CANR_MO40_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029514u)

/** Alias (User Manual Name) for CANR_MO40_DATAH.
* To use register names with standard convension, please use CANR_MO40_DATAH.
*/
#define	CANR_MODATAH40	(CANR_MO40_DATAH)

/** \\brief  1510, Message Object  Data Register Low */
#define CANR_MO40_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029510u)

/** Alias (User Manual Name) for CANR_MO40_DATAL.
* To use register names with standard convension, please use CANR_MO40_DATAL.
*/
#define	CANR_MODATAL40	(CANR_MO40_DATAL)

/** \\brief  1500, Message Object  Function Control Register */
#define CANR_MO40_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029500u)

/** Alias (User Manual Name) for CANR_MO40_FCR.
* To use register names with standard convension, please use CANR_MO40_FCR.
*/
#define	CANR_MOFCR40	(CANR_MO40_FCR)

/** \\brief  1504, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO40_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029504u)

/** Alias (User Manual Name) for CANR_MO40_FGPR.
* To use register names with standard convension, please use CANR_MO40_FGPR.
*/
#define	CANR_MOFGPR40	(CANR_MO40_FGPR)

/** \\brief  1508, Message Object  Interrupt Pointer Register */
#define CANR_MO40_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029508u)

/** Alias (User Manual Name) for CANR_MO40_IPR.
* To use register names with standard convension, please use CANR_MO40_IPR.
*/
#define	CANR_MOIPR40	(CANR_MO40_IPR)

/** \\brief  151C, Message Object  Control Register */
#define CANR_MO40_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF002951Cu)

/** Alias (User Manual Name) for CANR_MO40_STAT.
* To use register names with standard convension, please use CANR_MO40_STAT.
*/
#define	CANR_MOSTAT40	(CANR_MO40_STAT)

