HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxCan_reg.h
/** \\brief  152C, Message Object  Acceptance Mask Register */
#define CANR_MO41_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002952Cu)

/** Alias (User Manual Name) for CANR_MO41_AMR.
* To use register names with standard convension, please use CANR_MO41_AMR.
*/
#define	CANR_MOAMR41	(CANR_MO41_AMR)

/** \\brief  1538, Message Object  Arbitration Register */
#define CANR_MO41_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029538u)

/** Alias (User Manual Name) for CANR_MO41_AR.
* To use register names with standard convension, please use CANR_MO41_AR.
*/
#define	CANR_MOAR41	(CANR_MO41_AR)

/** \\brief  153C, Message Object  Control Register */
#define CANR_MO41_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF002953Cu)

/** Alias (User Manual Name) for CANR_MO41_CTR.
* To use register names with standard convension, please use CANR_MO41_CTR.
*/
#define	CANR_MOCTR41	(CANR_MO41_CTR)

/** \\brief  1534, Message Object  Data Register High */
#define CANR_MO41_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029534u)

/** Alias (User Manual Name) for CANR_MO41_DATAH.
* To use register names with standard convension, please use CANR_MO41_DATAH.
*/
#define	CANR_MODATAH41	(CANR_MO41_DATAH)

/** \\brief  1530, Message Object  Data Register Low */
#define CANR_MO41_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029530u)

/** Alias (User Manual Name) for CANR_MO41_DATAL.
* To use register names with standard convension, please use CANR_MO41_DATAL.
*/
#define	CANR_MODATAL41	(CANR_MO41_DATAL)

/** \\brief  1520, Message Object  Function Control Register */
#define CANR_MO41_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029520u)

/** Alias (User Manual Name) for CANR_MO41_FCR.
* To use register names with standard convension, please use CANR_MO41_FCR.
*/
#define	CANR_MOFCR41	(CANR_MO41_FCR)

/** \\brief  1524, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO41_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029524u)

/** Alias (User Manual Name) for CANR_MO41_FGPR.
* To use register names with standard convension, please use CANR_MO41_FGPR.
*/
#define	CANR_MOFGPR41	(CANR_MO41_FGPR)

/** \\brief  1528, Message Object  Interrupt Pointer Register */
#define CANR_MO41_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029528u)

/** Alias (User Manual Name) for CANR_MO41_IPR.
* To use register names with standard convension, please use CANR_MO41_IPR.
*/
#define	CANR_MOIPR41	(CANR_MO41_IPR)

/** \\brief  153C, Message Object  Control Register */
#define CANR_MO41_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF002953Cu)

/** Alias (User Manual Name) for CANR_MO41_STAT.
* To use register names with standard convension, please use CANR_MO41_STAT.
*/
#define	CANR_MOSTAT41	(CANR_MO41_STAT)

/** \\brief  154C, Message Object  Acceptance Mask Register */
#define CANR_MO42_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002954Cu)

/** Alias (User Manual Name) for CANR_MO42_AMR.
* To use register names with standard convension, please use CANR_MO42_AMR.
*/
#define	CANR_MOAMR42	(CANR_MO42_AMR)

/** \\brief  1558, Message Object  Arbitration Register */
#define CANR_MO42_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029558u)

/** Alias (User Manual Name) for CANR_MO42_AR.
* To use register names with standard convension, please use CANR_MO42_AR.
*/
#define	CANR_MOAR42	(CANR_MO42_AR)

/** \\brief  155C, Message Object  Control Register */
#define CANR_MO42_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF002955Cu)

/** Alias (User Manual Name) for CANR_MO42_CTR.
* To use register names with standard convension, please use CANR_MO42_CTR.
*/
#define	CANR_MOCTR42	(CANR_MO42_CTR)

/** \\brief  1554, Message Object  Data Register High */
#define CANR_MO42_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029554u)

/** Alias (User Manual Name) for CANR_MO42_DATAH.
* To use register names with standard convension, please use CANR_MO42_DATAH.
*/
#define	CANR_MODATAH42	(CANR_MO42_DATAH)

/** \\brief  1550, Message Object  Data Register Low */
#define CANR_MO42_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029550u)

/** Alias (User Manual Name) for CANR_MO42_DATAL.
* To use register names with standard convension, please use CANR_MO42_DATAL.
*/
#define	CANR_MODATAL42	(CANR_MO42_DATAL)

/** \\brief  1540, Message Object  Function Control Register */
#define CANR_MO42_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029540u)

/** Alias (User Manual Name) for CANR_MO42_FCR.
* To use register names with standard convension, please use CANR_MO42_FCR.
*/
#define	CANR_MOFCR42	(CANR_MO42_FCR)

/** \\brief  1544, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO42_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029544u)

/** Alias (User Manual Name) for CANR_MO42_FGPR.
* To use register names with standard convension, please use CANR_MO42_FGPR.
*/
#define	CANR_MOFGPR42	(CANR_MO42_FGPR)

/** \\brief  1548, Message Object  Interrupt Pointer Register */
#define CANR_MO42_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029548u)

/** Alias (User Manual Name) for CANR_MO42_IPR.
* To use register names with standard convension, please use CANR_MO42_IPR.
*/
#define	CANR_MOIPR42	(CANR_MO42_IPR)

/** \\brief  155C, Message Object  Control Register */
#define CANR_MO42_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF002955Cu)

/** Alias (User Manual Name) for CANR_MO42_STAT.
* To use register names with standard convension, please use CANR_MO42_STAT.
*/
#define	CANR_MOSTAT42	(CANR_MO42_STAT)

/** \\brief  156C, Message Object  Acceptance Mask Register */
#define CANR_MO43_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002956Cu)

/** Alias (User Manual Name) for CANR_MO43_AMR.
* To use register names with standard convension, please use CANR_MO43_AMR.
*/
#define	CANR_MOAMR43	(CANR_MO43_AMR)

/** \\brief  1578, Message Object  Arbitration Register */
#define CANR_MO43_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029578u)

/** Alias (User Manual Name) for CANR_MO43_AR.
* To use register names with standard convension, please use CANR_MO43_AR.
*/
#define	CANR_MOAR43	(CANR_MO43_AR)

