HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxCan_reg.h
/** \\brief  157C, Message Object  Control Register */
#define CANR_MO43_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF002957Cu)

/** Alias (User Manual Name) for CANR_MO43_CTR.
* To use register names with standard convension, please use CANR_MO43_CTR.
*/
#define	CANR_MOCTR43	(CANR_MO43_CTR)

/** \\brief  1574, Message Object  Data Register High */
#define CANR_MO43_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029574u)

/** Alias (User Manual Name) for CANR_MO43_DATAH.
* To use register names with standard convension, please use CANR_MO43_DATAH.
*/
#define	CANR_MODATAH43	(CANR_MO43_DATAH)

/** \\brief  1570, Message Object  Data Register Low */
#define CANR_MO43_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029570u)

/** Alias (User Manual Name) for CANR_MO43_DATAL.
* To use register names with standard convension, please use CANR_MO43_DATAL.
*/
#define	CANR_MODATAL43	(CANR_MO43_DATAL)

/** \\brief  1560, Message Object  Function Control Register */
#define CANR_MO43_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029560u)

/** Alias (User Manual Name) for CANR_MO43_FCR.
* To use register names with standard convension, please use CANR_MO43_FCR.
*/
#define	CANR_MOFCR43	(CANR_MO43_FCR)

/** \\brief  1564, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO43_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029564u)

/** Alias (User Manual Name) for CANR_MO43_FGPR.
* To use register names with standard convension, please use CANR_MO43_FGPR.
*/
#define	CANR_MOFGPR43	(CANR_MO43_FGPR)

/** \\brief  1568, Message Object  Interrupt Pointer Register */
#define CANR_MO43_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029568u)

/** Alias (User Manual Name) for CANR_MO43_IPR.
* To use register names with standard convension, please use CANR_MO43_IPR.
*/
#define	CANR_MOIPR43	(CANR_MO43_IPR)

/** \\brief  157C, Message Object  Control Register */
#define CANR_MO43_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF002957Cu)

/** Alias (User Manual Name) for CANR_MO43_STAT.
* To use register names with standard convension, please use CANR_MO43_STAT.
*/
#define	CANR_MOSTAT43	(CANR_MO43_STAT)

/** \\brief  158C, Message Object  Acceptance Mask Register */
#define CANR_MO44_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002958Cu)

/** Alias (User Manual Name) for CANR_MO44_AMR.
* To use register names with standard convension, please use CANR_MO44_AMR.
*/
#define	CANR_MOAMR44	(CANR_MO44_AMR)

/** \\brief  1598, Message Object  Arbitration Register */
#define CANR_MO44_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029598u)

/** Alias (User Manual Name) for CANR_MO44_AR.
* To use register names with standard convension, please use CANR_MO44_AR.
*/
#define	CANR_MOAR44	(CANR_MO44_AR)

/** \\brief  159C, Message Object  Control Register */
#define CANR_MO44_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF002959Cu)

/** Alias (User Manual Name) for CANR_MO44_CTR.
* To use register names with standard convension, please use CANR_MO44_CTR.
*/
#define	CANR_MOCTR44	(CANR_MO44_CTR)

/** \\brief  1594, Message Object  Data Register High */
#define CANR_MO44_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029594u)

/** Alias (User Manual Name) for CANR_MO44_DATAH.
* To use register names with standard convension, please use CANR_MO44_DATAH.
*/
#define	CANR_MODATAH44	(CANR_MO44_DATAH)

/** \\brief  1590, Message Object  Data Register Low */
#define CANR_MO44_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029590u)

/** Alias (User Manual Name) for CANR_MO44_DATAL.
* To use register names with standard convension, please use CANR_MO44_DATAL.
*/
#define	CANR_MODATAL44	(CANR_MO44_DATAL)

/** \\brief  1580, Message Object  Function Control Register */
#define CANR_MO44_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029580u)

/** Alias (User Manual Name) for CANR_MO44_FCR.
* To use register names with standard convension, please use CANR_MO44_FCR.
*/
#define	CANR_MOFCR44	(CANR_MO44_FCR)

/** \\brief  1584, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO44_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029584u)

/** Alias (User Manual Name) for CANR_MO44_FGPR.
* To use register names with standard convension, please use CANR_MO44_FGPR.
*/
#define	CANR_MOFGPR44	(CANR_MO44_FGPR)

/** \\brief  1588, Message Object  Interrupt Pointer Register */
#define CANR_MO44_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029588u)

/** Alias (User Manual Name) for CANR_MO44_IPR.
* To use register names with standard convension, please use CANR_MO44_IPR.
*/
#define	CANR_MOIPR44	(CANR_MO44_IPR)

/** \\brief  159C, Message Object  Control Register */
#define CANR_MO44_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF002959Cu)

/** Alias (User Manual Name) for CANR_MO44_STAT.
* To use register names with standard convension, please use CANR_MO44_STAT.
*/
#define	CANR_MOSTAT44	(CANR_MO44_STAT)

/** \\brief  15AC, Message Object  Acceptance Mask Register */
#define CANR_MO45_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF00295ACu)

/** Alias (User Manual Name) for CANR_MO45_AMR.
* To use register names with standard convension, please use CANR_MO45_AMR.
*/
#define	CANR_MOAMR45	(CANR_MO45_AMR)

/** \\brief  15B8, Message Object  Arbitration Register */
#define CANR_MO45_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF00295B8u)

/** Alias (User Manual Name) for CANR_MO45_AR.
* To use register names with standard convension, please use CANR_MO45_AR.
*/
#define	CANR_MOAR45	(CANR_MO45_AR)

/** \\brief  15BC, Message Object  Control Register */
#define CANR_MO45_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF00295BCu)

/** Alias (User Manual Name) for CANR_MO45_CTR.
* To use register names with standard convension, please use CANR_MO45_CTR.
*/
#define	CANR_MOCTR45	(CANR_MO45_CTR)

/** \\brief  15B4, Message Object  Data Register High */
#define CANR_MO45_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF00295B4u)

