HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxCan_reg.h
/** Alias (User Manual Name) for CANR_MO45_DATAH.
* To use register names with standard convension, please use CANR_MO45_DATAH.
*/
#define	CANR_MODATAH45	(CANR_MO45_DATAH)

/** \\brief  15B0, Message Object  Data Register Low */
#define CANR_MO45_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF00295B0u)

/** Alias (User Manual Name) for CANR_MO45_DATAL.
* To use register names with standard convension, please use CANR_MO45_DATAL.
*/
#define	CANR_MODATAL45	(CANR_MO45_DATAL)

/** \\brief  15A0, Message Object  Function Control Register */
#define CANR_MO45_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF00295A0u)

/** Alias (User Manual Name) for CANR_MO45_FCR.
* To use register names with standard convension, please use CANR_MO45_FCR.
*/
#define	CANR_MOFCR45	(CANR_MO45_FCR)

/** \\brief  15A4, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO45_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF00295A4u)

/** Alias (User Manual Name) for CANR_MO45_FGPR.
* To use register names with standard convension, please use CANR_MO45_FGPR.
*/
#define	CANR_MOFGPR45	(CANR_MO45_FGPR)

/** \\brief  15A8, Message Object  Interrupt Pointer Register */
#define CANR_MO45_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF00295A8u)

/** Alias (User Manual Name) for CANR_MO45_IPR.
* To use register names with standard convension, please use CANR_MO45_IPR.
*/
#define	CANR_MOIPR45	(CANR_MO45_IPR)

/** \\brief  15BC, Message Object  Control Register */
#define CANR_MO45_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF00295BCu)

/** Alias (User Manual Name) for CANR_MO45_STAT.
* To use register names with standard convension, please use CANR_MO45_STAT.
*/
#define	CANR_MOSTAT45	(CANR_MO45_STAT)

/** \\brief  15CC, Message Object  Acceptance Mask Register */
#define CANR_MO46_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF00295CCu)

/** Alias (User Manual Name) for CANR_MO46_AMR.
* To use register names with standard convension, please use CANR_MO46_AMR.
*/
#define	CANR_MOAMR46	(CANR_MO46_AMR)

/** \\brief  15D8, Message Object  Arbitration Register */
#define CANR_MO46_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF00295D8u)

/** Alias (User Manual Name) for CANR_MO46_AR.
* To use register names with standard convension, please use CANR_MO46_AR.
*/
#define	CANR_MOAR46	(CANR_MO46_AR)

/** \\brief  15DC, Message Object  Control Register */
#define CANR_MO46_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF00295DCu)

/** Alias (User Manual Name) for CANR_MO46_CTR.
* To use register names with standard convension, please use CANR_MO46_CTR.
*/
#define	CANR_MOCTR46	(CANR_MO46_CTR)

/** \\brief  15D4, Message Object  Data Register High */
#define CANR_MO46_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF00295D4u)

/** Alias (User Manual Name) for CANR_MO46_DATAH.
* To use register names with standard convension, please use CANR_MO46_DATAH.
*/
#define	CANR_MODATAH46	(CANR_MO46_DATAH)

/** \\brief  15D0, Message Object  Data Register Low */
#define CANR_MO46_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF00295D0u)

/** Alias (User Manual Name) for CANR_MO46_DATAL.
* To use register names with standard convension, please use CANR_MO46_DATAL.
*/
#define	CANR_MODATAL46	(CANR_MO46_DATAL)

/** \\brief  15C0, Message Object  Function Control Register */
#define CANR_MO46_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF00295C0u)

/** Alias (User Manual Name) for CANR_MO46_FCR.
* To use register names with standard convension, please use CANR_MO46_FCR.
*/
#define	CANR_MOFCR46	(CANR_MO46_FCR)

/** \\brief  15C4, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO46_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF00295C4u)

/** Alias (User Manual Name) for CANR_MO46_FGPR.
* To use register names with standard convension, please use CANR_MO46_FGPR.
*/
#define	CANR_MOFGPR46	(CANR_MO46_FGPR)

/** \\brief  15C8, Message Object  Interrupt Pointer Register */
#define CANR_MO46_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF00295C8u)

/** Alias (User Manual Name) for CANR_MO46_IPR.
* To use register names with standard convension, please use CANR_MO46_IPR.
*/
#define	CANR_MOIPR46	(CANR_MO46_IPR)

/** \\brief  15DC, Message Object  Control Register */
#define CANR_MO46_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF00295DCu)

/** Alias (User Manual Name) for CANR_MO46_STAT.
* To use register names with standard convension, please use CANR_MO46_STAT.
*/
#define	CANR_MOSTAT46	(CANR_MO46_STAT)

/** \\brief  15EC, Message Object  Acceptance Mask Register */
#define CANR_MO47_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF00295ECu)

/** Alias (User Manual Name) for CANR_MO47_AMR.
* To use register names with standard convension, please use CANR_MO47_AMR.
*/
#define	CANR_MOAMR47	(CANR_MO47_AMR)

/** \\brief  15F8, Message Object  Arbitration Register */
#define CANR_MO47_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF00295F8u)

/** Alias (User Manual Name) for CANR_MO47_AR.
* To use register names with standard convension, please use CANR_MO47_AR.
*/
#define	CANR_MOAR47	(CANR_MO47_AR)

/** \\brief  15FC, Message Object  Control Register */
#define CANR_MO47_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF00295FCu)

/** Alias (User Manual Name) for CANR_MO47_CTR.
* To use register names with standard convension, please use CANR_MO47_CTR.
*/
#define	CANR_MOCTR47	(CANR_MO47_CTR)

/** \\brief  15F4, Message Object  Data Register High */
#define CANR_MO47_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF00295F4u)

/** Alias (User Manual Name) for CANR_MO47_DATAH.
* To use register names with standard convension, please use CANR_MO47_DATAH.
*/
#define	CANR_MODATAH47	(CANR_MO47_DATAH)

/** \\brief  15F0, Message Object  Data Register Low */
#define CANR_MO47_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF00295F0u)

/** Alias (User Manual Name) for CANR_MO47_DATAL.
* To use register names with standard convension, please use CANR_MO47_DATAL.
*/
#define	CANR_MODATAL47	(CANR_MO47_DATAL)

/** \\brief  15E0, Message Object  Function Control Register */
#define CANR_MO47_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF00295E0u)

/** Alias (User Manual Name) for CANR_MO47_FCR.
* To use register names with standard convension, please use CANR_MO47_FCR.
*/
#define	CANR_MOFCR47	(CANR_MO47_FCR)

