HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxCan_reg.h
/** \\brief  108C, Message Object  Acceptance Mask Register */
#define CANR_MO4_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002908Cu)

/** Alias (User Manual Name) for CANR_MO4_AMR.
* To use register names with standard convension, please use CANR_MO4_AMR.
*/
#define	CANR_MOAMR4	(CANR_MO4_AMR)

/** \\brief  1098, Message Object  Arbitration Register */
#define CANR_MO4_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029098u)

/** Alias (User Manual Name) for CANR_MO4_AR.
* To use register names with standard convension, please use CANR_MO4_AR.
*/
#define	CANR_MOAR4	(CANR_MO4_AR)

/** \\brief  109C, Message Object  Control Register */
#define CANR_MO4_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF002909Cu)

/** Alias (User Manual Name) for CANR_MO4_CTR.
* To use register names with standard convension, please use CANR_MO4_CTR.
*/
#define	CANR_MOCTR4	(CANR_MO4_CTR)

/** \\brief  1094, Message Object  Data Register High */
#define CANR_MO4_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029094u)

/** Alias (User Manual Name) for CANR_MO4_DATAH.
* To use register names with standard convension, please use CANR_MO4_DATAH.
*/
#define	CANR_MODATAH4	(CANR_MO4_DATAH)

/** \\brief  1090, Message Object  Data Register Low */
#define CANR_MO4_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029090u)

/** Alias (User Manual Name) for CANR_MO4_DATAL.
* To use register names with standard convension, please use CANR_MO4_DATAL.
*/
#define	CANR_MODATAL4	(CANR_MO4_DATAL)

/** \\brief  1080, Message Object  Function Control Register */
#define CANR_MO4_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029080u)

/** Alias (User Manual Name) for CANR_MO4_FCR.
* To use register names with standard convension, please use CANR_MO4_FCR.
*/
#define	CANR_MOFCR4	(CANR_MO4_FCR)

/** \\brief  1084, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO4_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029084u)

/** Alias (User Manual Name) for CANR_MO4_FGPR.
* To use register names with standard convension, please use CANR_MO4_FGPR.
*/
#define	CANR_MOFGPR4	(CANR_MO4_FGPR)

/** \\brief  1088, Message Object  Interrupt Pointer Register */
#define CANR_MO4_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029088u)

/** Alias (User Manual Name) for CANR_MO4_IPR.
* To use register names with standard convension, please use CANR_MO4_IPR.
*/
#define	CANR_MOIPR4	(CANR_MO4_IPR)

/** \\brief  109C, Message Object  Control Register */
#define CANR_MO4_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF002909Cu)

/** Alias (User Manual Name) for CANR_MO4_STAT.
* To use register names with standard convension, please use CANR_MO4_STAT.
*/
#define	CANR_MOSTAT4	(CANR_MO4_STAT)

/** \\brief  164C, Message Object  Acceptance Mask Register */
#define CANR_MO50_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002964Cu)

/** Alias (User Manual Name) for CANR_MO50_AMR.
* To use register names with standard convension, please use CANR_MO50_AMR.
*/
#define	CANR_MOAMR50	(CANR_MO50_AMR)

/** \\brief  1658, Message Object  Arbitration Register */
#define CANR_MO50_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029658u)

/** Alias (User Manual Name) for CANR_MO50_AR.
* To use register names with standard convension, please use CANR_MO50_AR.
*/
#define	CANR_MOAR50	(CANR_MO50_AR)

/** \\brief  165C, Message Object  Control Register */
#define CANR_MO50_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF002965Cu)

/** Alias (User Manual Name) for CANR_MO50_CTR.
* To use register names with standard convension, please use CANR_MO50_CTR.
*/
#define	CANR_MOCTR50	(CANR_MO50_CTR)

/** \\brief  1654, Message Object  Data Register High */
#define CANR_MO50_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029654u)

/** Alias (User Manual Name) for CANR_MO50_DATAH.
* To use register names with standard convension, please use CANR_MO50_DATAH.
*/
#define	CANR_MODATAH50	(CANR_MO50_DATAH)

/** \\brief  1650, Message Object  Data Register Low */
#define CANR_MO50_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029650u)

/** Alias (User Manual Name) for CANR_MO50_DATAL.
* To use register names with standard convension, please use CANR_MO50_DATAL.
*/
#define	CANR_MODATAL50	(CANR_MO50_DATAL)

/** \\brief  1640, Message Object  Function Control Register */
#define CANR_MO50_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029640u)

/** Alias (User Manual Name) for CANR_MO50_FCR.
* To use register names with standard convension, please use CANR_MO50_FCR.
*/
#define	CANR_MOFCR50	(CANR_MO50_FCR)

/** \\brief  1644, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO50_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029644u)

/** Alias (User Manual Name) for CANR_MO50_FGPR.
* To use register names with standard convension, please use CANR_MO50_FGPR.
*/
#define	CANR_MOFGPR50	(CANR_MO50_FGPR)

/** \\brief  1648, Message Object  Interrupt Pointer Register */
#define CANR_MO50_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029648u)

/** Alias (User Manual Name) for CANR_MO50_IPR.
* To use register names with standard convension, please use CANR_MO50_IPR.
*/
#define	CANR_MOIPR50	(CANR_MO50_IPR)

/** \\brief  165C, Message Object  Control Register */
#define CANR_MO50_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF002965Cu)

/** Alias (User Manual Name) for CANR_MO50_STAT.
* To use register names with standard convension, please use CANR_MO50_STAT.
*/
#define	CANR_MOSTAT50	(CANR_MO50_STAT)

/** \\brief  166C, Message Object  Acceptance Mask Register */
#define CANR_MO51_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002966Cu)

/** Alias (User Manual Name) for CANR_MO51_AMR.
* To use register names with standard convension, please use CANR_MO51_AMR.
*/
#define	CANR_MOAMR51	(CANR_MO51_AMR)

/** \\brief  1678, Message Object  Arbitration Register */
#define CANR_MO51_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029678u)

/** Alias (User Manual Name) for CANR_MO51_AR.
* To use register names with standard convension, please use CANR_MO51_AR.
*/
#define	CANR_MOAR51	(CANR_MO51_AR)

