HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxCan_reg.h
/** \\brief  167C, Message Object  Control Register */
#define CANR_MO51_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF002967Cu)

/** Alias (User Manual Name) for CANR_MO51_CTR.
* To use register names with standard convension, please use CANR_MO51_CTR.
*/
#define	CANR_MOCTR51	(CANR_MO51_CTR)

/** \\brief  1674, Message Object  Data Register High */
#define CANR_MO51_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029674u)

/** Alias (User Manual Name) for CANR_MO51_DATAH.
* To use register names with standard convension, please use CANR_MO51_DATAH.
*/
#define	CANR_MODATAH51	(CANR_MO51_DATAH)

/** \\brief  1670, Message Object  Data Register Low */
#define CANR_MO51_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029670u)

/** Alias (User Manual Name) for CANR_MO51_DATAL.
* To use register names with standard convension, please use CANR_MO51_DATAL.
*/
#define	CANR_MODATAL51	(CANR_MO51_DATAL)

/** \\brief  1660, Message Object  Function Control Register */
#define CANR_MO51_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029660u)

/** Alias (User Manual Name) for CANR_MO51_FCR.
* To use register names with standard convension, please use CANR_MO51_FCR.
*/
#define	CANR_MOFCR51	(CANR_MO51_FCR)

/** \\brief  1664, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO51_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029664u)

/** Alias (User Manual Name) for CANR_MO51_FGPR.
* To use register names with standard convension, please use CANR_MO51_FGPR.
*/
#define	CANR_MOFGPR51	(CANR_MO51_FGPR)

/** \\brief  1668, Message Object  Interrupt Pointer Register */
#define CANR_MO51_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029668u)

/** Alias (User Manual Name) for CANR_MO51_IPR.
* To use register names with standard convension, please use CANR_MO51_IPR.
*/
#define	CANR_MOIPR51	(CANR_MO51_IPR)

/** \\brief  167C, Message Object  Control Register */
#define CANR_MO51_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF002967Cu)

/** Alias (User Manual Name) for CANR_MO51_STAT.
* To use register names with standard convension, please use CANR_MO51_STAT.
*/
#define	CANR_MOSTAT51	(CANR_MO51_STAT)

/** \\brief  168C, Message Object  Acceptance Mask Register */
#define CANR_MO52_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002968Cu)

/** Alias (User Manual Name) for CANR_MO52_AMR.
* To use register names with standard convension, please use CANR_MO52_AMR.
*/
#define	CANR_MOAMR52	(CANR_MO52_AMR)

/** \\brief  1698, Message Object  Arbitration Register */
#define CANR_MO52_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029698u)

/** Alias (User Manual Name) for CANR_MO52_AR.
* To use register names with standard convension, please use CANR_MO52_AR.
*/
#define	CANR_MOAR52	(CANR_MO52_AR)

/** \\brief  169C, Message Object  Control Register */
#define CANR_MO52_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF002969Cu)

/** Alias (User Manual Name) for CANR_MO52_CTR.
* To use register names with standard convension, please use CANR_MO52_CTR.
*/
#define	CANR_MOCTR52	(CANR_MO52_CTR)

/** \\brief  1694, Message Object  Data Register High */
#define CANR_MO52_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029694u)

/** Alias (User Manual Name) for CANR_MO52_DATAH.
* To use register names with standard convension, please use CANR_MO52_DATAH.
*/
#define	CANR_MODATAH52	(CANR_MO52_DATAH)

/** \\brief  1690, Message Object  Data Register Low */
#define CANR_MO52_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029690u)

/** Alias (User Manual Name) for CANR_MO52_DATAL.
* To use register names with standard convension, please use CANR_MO52_DATAL.
*/
#define	CANR_MODATAL52	(CANR_MO52_DATAL)

/** \\brief  1680, Message Object  Function Control Register */
#define CANR_MO52_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029680u)

/** Alias (User Manual Name) for CANR_MO52_FCR.
* To use register names with standard convension, please use CANR_MO52_FCR.
*/
#define	CANR_MOFCR52	(CANR_MO52_FCR)

/** \\brief  1684, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO52_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029684u)

/** Alias (User Manual Name) for CANR_MO52_FGPR.
* To use register names with standard convension, please use CANR_MO52_FGPR.
*/
#define	CANR_MOFGPR52	(CANR_MO52_FGPR)

/** \\brief  1688, Message Object  Interrupt Pointer Register */
#define CANR_MO52_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029688u)

/** Alias (User Manual Name) for CANR_MO52_IPR.
* To use register names with standard convension, please use CANR_MO52_IPR.
*/
#define	CANR_MOIPR52	(CANR_MO52_IPR)

/** \\brief  169C, Message Object  Control Register */
#define CANR_MO52_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF002969Cu)

/** Alias (User Manual Name) for CANR_MO52_STAT.
* To use register names with standard convension, please use CANR_MO52_STAT.
*/
#define	CANR_MOSTAT52	(CANR_MO52_STAT)

/** \\brief  16AC, Message Object  Acceptance Mask Register */
#define CANR_MO53_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF00296ACu)

/** Alias (User Manual Name) for CANR_MO53_AMR.
* To use register names with standard convension, please use CANR_MO53_AMR.
*/
#define	CANR_MOAMR53	(CANR_MO53_AMR)

/** \\brief  16B8, Message Object  Arbitration Register */
#define CANR_MO53_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF00296B8u)

/** Alias (User Manual Name) for CANR_MO53_AR.
* To use register names with standard convension, please use CANR_MO53_AR.
*/
#define	CANR_MOAR53	(CANR_MO53_AR)

/** \\brief  16BC, Message Object  Control Register */
#define CANR_MO53_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF00296BCu)

/** Alias (User Manual Name) for CANR_MO53_CTR.
* To use register names with standard convension, please use CANR_MO53_CTR.
*/
#define	CANR_MOCTR53	(CANR_MO53_CTR)

/** \\brief  16B4, Message Object  Data Register High */
#define CANR_MO53_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF00296B4u)

