HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxCan_reg.h
/** Alias (User Manual Name) for CANR_MO53_DATAH.
* To use register names with standard convension, please use CANR_MO53_DATAH.
*/
#define	CANR_MODATAH53	(CANR_MO53_DATAH)

/** \\brief  16B0, Message Object  Data Register Low */
#define CANR_MO53_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF00296B0u)

/** Alias (User Manual Name) for CANR_MO53_DATAL.
* To use register names with standard convension, please use CANR_MO53_DATAL.
*/
#define	CANR_MODATAL53	(CANR_MO53_DATAL)

/** \\brief  16A0, Message Object  Function Control Register */
#define CANR_MO53_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF00296A0u)

/** Alias (User Manual Name) for CANR_MO53_FCR.
* To use register names with standard convension, please use CANR_MO53_FCR.
*/
#define	CANR_MOFCR53	(CANR_MO53_FCR)

/** \\brief  16A4, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO53_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF00296A4u)

/** Alias (User Manual Name) for CANR_MO53_FGPR.
* To use register names with standard convension, please use CANR_MO53_FGPR.
*/
#define	CANR_MOFGPR53	(CANR_MO53_FGPR)

/** \\brief  16A8, Message Object  Interrupt Pointer Register */
#define CANR_MO53_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF00296A8u)

/** Alias (User Manual Name) for CANR_MO53_IPR.
* To use register names with standard convension, please use CANR_MO53_IPR.
*/
#define	CANR_MOIPR53	(CANR_MO53_IPR)

/** \\brief  16BC, Message Object  Control Register */
#define CANR_MO53_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF00296BCu)

/** Alias (User Manual Name) for CANR_MO53_STAT.
* To use register names with standard convension, please use CANR_MO53_STAT.
*/
#define	CANR_MOSTAT53	(CANR_MO53_STAT)

/** \\brief  16CC, Message Object  Acceptance Mask Register */
#define CANR_MO54_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF00296CCu)

/** Alias (User Manual Name) for CANR_MO54_AMR.
* To use register names with standard convension, please use CANR_MO54_AMR.
*/
#define	CANR_MOAMR54	(CANR_MO54_AMR)

/** \\brief  16D8, Message Object  Arbitration Register */
#define CANR_MO54_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF00296D8u)

/** Alias (User Manual Name) for CANR_MO54_AR.
* To use register names with standard convension, please use CANR_MO54_AR.
*/
#define	CANR_MOAR54	(CANR_MO54_AR)

/** \\brief  16DC, Message Object  Control Register */
#define CANR_MO54_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF00296DCu)

/** Alias (User Manual Name) for CANR_MO54_CTR.
* To use register names with standard convension, please use CANR_MO54_CTR.
*/
#define	CANR_MOCTR54	(CANR_MO54_CTR)

/** \\brief  16D4, Message Object  Data Register High */
#define CANR_MO54_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF00296D4u)

/** Alias (User Manual Name) for CANR_MO54_DATAH.
* To use register names with standard convension, please use CANR_MO54_DATAH.
*/
#define	CANR_MODATAH54	(CANR_MO54_DATAH)

/** \\brief  16D0, Message Object  Data Register Low */
#define CANR_MO54_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF00296D0u)

/** Alias (User Manual Name) for CANR_MO54_DATAL.
* To use register names with standard convension, please use CANR_MO54_DATAL.
*/
#define	CANR_MODATAL54	(CANR_MO54_DATAL)

/** \\brief  16C0, Message Object  Function Control Register */
#define CANR_MO54_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF00296C0u)

/** Alias (User Manual Name) for CANR_MO54_FCR.
* To use register names with standard convension, please use CANR_MO54_FCR.
*/
#define	CANR_MOFCR54	(CANR_MO54_FCR)

/** \\brief  16C4, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO54_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF00296C4u)

/** Alias (User Manual Name) for CANR_MO54_FGPR.
* To use register names with standard convension, please use CANR_MO54_FGPR.
*/
#define	CANR_MOFGPR54	(CANR_MO54_FGPR)

/** \\brief  16C8, Message Object  Interrupt Pointer Register */
#define CANR_MO54_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF00296C8u)

/** Alias (User Manual Name) for CANR_MO54_IPR.
* To use register names with standard convension, please use CANR_MO54_IPR.
*/
#define	CANR_MOIPR54	(CANR_MO54_IPR)

/** \\brief  16DC, Message Object  Control Register */
#define CANR_MO54_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF00296DCu)

/** Alias (User Manual Name) for CANR_MO54_STAT.
* To use register names with standard convension, please use CANR_MO54_STAT.
*/
#define	CANR_MOSTAT54	(CANR_MO54_STAT)

/** \\brief  16EC, Message Object  Acceptance Mask Register */
#define CANR_MO55_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF00296ECu)

/** Alias (User Manual Name) for CANR_MO55_AMR.
* To use register names with standard convension, please use CANR_MO55_AMR.
*/
#define	CANR_MOAMR55	(CANR_MO55_AMR)

/** \\brief  16F8, Message Object  Arbitration Register */
#define CANR_MO55_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF00296F8u)

/** Alias (User Manual Name) for CANR_MO55_AR.
* To use register names with standard convension, please use CANR_MO55_AR.
*/
#define	CANR_MOAR55	(CANR_MO55_AR)

/** \\brief  16FC, Message Object  Control Register */
#define CANR_MO55_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF00296FCu)

/** Alias (User Manual Name) for CANR_MO55_CTR.
* To use register names with standard convension, please use CANR_MO55_CTR.
*/
#define	CANR_MOCTR55	(CANR_MO55_CTR)

/** \\brief  16F4, Message Object  Data Register High */
#define CANR_MO55_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF00296F4u)

/** Alias (User Manual Name) for CANR_MO55_DATAH.
* To use register names with standard convension, please use CANR_MO55_DATAH.
*/
#define	CANR_MODATAH55	(CANR_MO55_DATAH)

/** \\brief  16F0, Message Object  Data Register Low */
#define CANR_MO55_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF00296F0u)

/** Alias (User Manual Name) for CANR_MO55_DATAL.
* To use register names with standard convension, please use CANR_MO55_DATAL.
*/
#define	CANR_MODATAL55	(CANR_MO55_DATAL)

/** \\brief  16E0, Message Object  Function Control Register */
#define CANR_MO55_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF00296E0u)

/** Alias (User Manual Name) for CANR_MO55_FCR.
* To use register names with standard convension, please use CANR_MO55_FCR.
*/
#define	CANR_MOFCR55	(CANR_MO55_FCR)

/** \\brief  16E4, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO55_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF00296E4u)

/** Alias (User Manual Name) for CANR_MO55_FGPR.
* To use register names with standard convension, please use CANR_MO55_FGPR.
*/
#define	CANR_MOFGPR55	(CANR_MO55_FGPR)

/** \\brief  16E8, Message Object  Interrupt Pointer Register */
#define CANR_MO55_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF00296E8u)

/** Alias (User Manual Name) for CANR_MO55_IPR.
* To use register names with standard convension, please use CANR_MO55_IPR.
*/
#define	CANR_MOIPR55	(CANR_MO55_IPR)

/** \\brief  16FC, Message Object  Control Register */
#define CANR_MO55_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF00296FCu)

/** Alias (User Manual Name) for CANR_MO55_STAT.
* To use register names with standard convension, please use CANR_MO55_STAT.
*/
#define	CANR_MOSTAT55	(CANR_MO55_STAT)

/** \\brief  170C, Message Object  Acceptance Mask Register */
#define CANR_MO56_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002970Cu)

/** Alias (User Manual Name) for CANR_MO56_AMR.
* To use register names with standard convension, please use CANR_MO56_AMR.
*/
#define	CANR_MOAMR56	(CANR_MO56_AMR)

/** \\brief  1718, Message Object  Arbitration Register */
#define CANR_MO56_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029718u)

/** Alias (User Manual Name) for CANR_MO56_AR.
* To use register names with standard convension, please use CANR_MO56_AR.
*/
#define	CANR_MOAR56	(CANR_MO56_AR)

