HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxCan_reg.h
/** Alias (User Manual Name) for CANR_MO58_FCR.
* To use register names with standard convension, please use CANR_MO58_FCR.
*/
#define	CANR_MOFCR58	(CANR_MO58_FCR)

/** \\brief  1744, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO58_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029744u)

/** Alias (User Manual Name) for CANR_MO58_FGPR.
* To use register names with standard convension, please use CANR_MO58_FGPR.
*/
#define	CANR_MOFGPR58	(CANR_MO58_FGPR)

/** \\brief  1748, Message Object  Interrupt Pointer Register */
#define CANR_MO58_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029748u)

/** Alias (User Manual Name) for CANR_MO58_IPR.
* To use register names with standard convension, please use CANR_MO58_IPR.
*/
#define	CANR_MOIPR58	(CANR_MO58_IPR)

/** \\brief  175C, Message Object  Control Register */
#define CANR_MO58_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF002975Cu)

/** Alias (User Manual Name) for CANR_MO58_STAT.
* To use register names with standard convension, please use CANR_MO58_STAT.
*/
#define	CANR_MOSTAT58	(CANR_MO58_STAT)

/** \\brief  176C, Message Object  Acceptance Mask Register */
#define CANR_MO59_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002976Cu)

/** Alias (User Manual Name) for CANR_MO59_AMR.
* To use register names with standard convension, please use CANR_MO59_AMR.
*/
#define	CANR_MOAMR59	(CANR_MO59_AMR)

/** \\brief  1778, Message Object  Arbitration Register */
#define CANR_MO59_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029778u)

/** Alias (User Manual Name) for CANR_MO59_AR.
* To use register names with standard convension, please use CANR_MO59_AR.
*/
#define	CANR_MOAR59	(CANR_MO59_AR)

/** \\brief  177C, Message Object  Control Register */
#define CANR_MO59_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF002977Cu)

/** Alias (User Manual Name) for CANR_MO59_CTR.
* To use register names with standard convension, please use CANR_MO59_CTR.
*/
#define	CANR_MOCTR59	(CANR_MO59_CTR)

/** \\brief  1774, Message Object  Data Register High */
#define CANR_MO59_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029774u)

/** Alias (User Manual Name) for CANR_MO59_DATAH.
* To use register names with standard convension, please use CANR_MO59_DATAH.
*/
#define	CANR_MODATAH59	(CANR_MO59_DATAH)

/** \\brief  1770, Message Object  Data Register Low */
#define CANR_MO59_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029770u)

/** Alias (User Manual Name) for CANR_MO59_DATAL.
* To use register names with standard convension, please use CANR_MO59_DATAL.
*/
#define	CANR_MODATAL59	(CANR_MO59_DATAL)

/** \\brief  1760, Message Object  Function Control Register */
#define CANR_MO59_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029760u)

/** Alias (User Manual Name) for CANR_MO59_FCR.
* To use register names with standard convension, please use CANR_MO59_FCR.
*/
#define	CANR_MOFCR59	(CANR_MO59_FCR)

/** \\brief  1764, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO59_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029764u)

/** Alias (User Manual Name) for CANR_MO59_FGPR.
* To use register names with standard convension, please use CANR_MO59_FGPR.
*/
#define	CANR_MOFGPR59	(CANR_MO59_FGPR)

/** \\brief  1768, Message Object  Interrupt Pointer Register */
#define CANR_MO59_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029768u)

/** Alias (User Manual Name) for CANR_MO59_IPR.
* To use register names with standard convension, please use CANR_MO59_IPR.
*/
#define	CANR_MOIPR59	(CANR_MO59_IPR)

/** \\brief  177C, Message Object  Control Register */
#define CANR_MO59_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF002977Cu)

/** Alias (User Manual Name) for CANR_MO59_STAT.
* To use register names with standard convension, please use CANR_MO59_STAT.
*/
#define	CANR_MOSTAT59	(CANR_MO59_STAT)

/** \\brief  10AC, Message Object  Acceptance Mask Register */
#define CANR_MO5_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF00290ACu)

/** Alias (User Manual Name) for CANR_MO5_AMR.
* To use register names with standard convension, please use CANR_MO5_AMR.
*/
#define	CANR_MOAMR5	(CANR_MO5_AMR)

/** \\brief  10B8, Message Object  Arbitration Register */
#define CANR_MO5_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF00290B8u)

/** Alias (User Manual Name) for CANR_MO5_AR.
* To use register names with standard convension, please use CANR_MO5_AR.
*/
#define	CANR_MOAR5	(CANR_MO5_AR)

/** \\brief  10BC, Message Object  Control Register */
#define CANR_MO5_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF00290BCu)

/** Alias (User Manual Name) for CANR_MO5_CTR.
* To use register names with standard convension, please use CANR_MO5_CTR.
*/
#define	CANR_MOCTR5	(CANR_MO5_CTR)

/** \\brief  10B4, Message Object  Data Register High */
#define CANR_MO5_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF00290B4u)

/** Alias (User Manual Name) for CANR_MO5_DATAH.
* To use register names with standard convension, please use CANR_MO5_DATAH.
*/
#define	CANR_MODATAH5	(CANR_MO5_DATAH)

/** \\brief  10B0, Message Object  Data Register Low */
#define CANR_MO5_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF00290B0u)

/** Alias (User Manual Name) for CANR_MO5_DATAL.
* To use register names with standard convension, please use CANR_MO5_DATAL.
*/
#define	CANR_MODATAL5	(CANR_MO5_DATAL)

/** \\brief  10A0, Message Object  Function Control Register */
#define CANR_MO5_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF00290A0u)

/** Alias (User Manual Name) for CANR_MO5_FCR.
* To use register names with standard convension, please use CANR_MO5_FCR.
*/
#define	CANR_MOFCR5	(CANR_MO5_FCR)

/** \\brief  10A4, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO5_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF00290A4u)

/** Alias (User Manual Name) for CANR_MO5_FGPR.
* To use register names with standard convension, please use CANR_MO5_FGPR.
*/
#define	CANR_MOFGPR5	(CANR_MO5_FGPR)

/** \\brief  10A8, Message Object  Interrupt Pointer Register */
#define CANR_MO5_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF00290A8u)

/** Alias (User Manual Name) for CANR_MO5_IPR.
* To use register names with standard convension, please use CANR_MO5_IPR.
*/
#define	CANR_MOIPR5	(CANR_MO5_IPR)

/** \\brief  10BC, Message Object  Control Register */
#define CANR_MO5_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF00290BCu)

/** Alias (User Manual Name) for CANR_MO5_STAT.
* To use register names with standard convension, please use CANR_MO5_STAT.
*/
#define	CANR_MOSTAT5	(CANR_MO5_STAT)

