HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxCan_reg.h
/** \\brief  1810, Message Object  Data Register Low */
#define CANR_MO64_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029810u)

/** Alias (User Manual Name) for CANR_MO64_DATAL.
* To use register names with standard convension, please use CANR_MO64_DATAL.
*/
#define	CANR_MODATAL64	(CANR_MO64_DATAL)

/** \\brief  1800, Message Object  Function Control Register */
#define CANR_MO64_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029800u)

/** Alias (User Manual Name) for CANR_MO64_FCR.
* To use register names with standard convension, please use CANR_MO64_FCR.
*/
#define	CANR_MOFCR64	(CANR_MO64_FCR)

/** \\brief  1804, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO64_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029804u)

/** Alias (User Manual Name) for CANR_MO64_FGPR.
* To use register names with standard convension, please use CANR_MO64_FGPR.
*/
#define	CANR_MOFGPR64	(CANR_MO64_FGPR)

/** \\brief  1808, Message Object  Interrupt Pointer Register */
#define CANR_MO64_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029808u)

/** Alias (User Manual Name) for CANR_MO64_IPR.
* To use register names with standard convension, please use CANR_MO64_IPR.
*/
#define	CANR_MOIPR64	(CANR_MO64_IPR)

/** \\brief  181C, Message Object  Control Register */
#define CANR_MO64_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF002981Cu)

/** Alias (User Manual Name) for CANR_MO64_STAT.
* To use register names with standard convension, please use CANR_MO64_STAT.
*/
#define	CANR_MOSTAT64	(CANR_MO64_STAT)

/** \\brief  182C, Message Object  Acceptance Mask Register */
#define CANR_MO65_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002982Cu)

/** Alias (User Manual Name) for CANR_MO65_AMR.
* To use register names with standard convension, please use CANR_MO65_AMR.
*/
#define	CANR_MOAMR65	(CANR_MO65_AMR)

/** \\brief  1838, Message Object  Arbitration Register */
#define CANR_MO65_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029838u)

/** Alias (User Manual Name) for CANR_MO65_AR.
* To use register names with standard convension, please use CANR_MO65_AR.
*/
#define	CANR_MOAR65	(CANR_MO65_AR)

/** \\brief  183C, Message Object  Control Register */
#define CANR_MO65_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF002983Cu)

/** Alias (User Manual Name) for CANR_MO65_CTR.
* To use register names with standard convension, please use CANR_MO65_CTR.
*/
#define	CANR_MOCTR65	(CANR_MO65_CTR)

/** \\brief  1834, Message Object  Data Register High */
#define CANR_MO65_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029834u)

/** Alias (User Manual Name) for CANR_MO65_DATAH.
* To use register names with standard convension, please use CANR_MO65_DATAH.
*/
#define	CANR_MODATAH65	(CANR_MO65_DATAH)

/** \\brief  1830, Message Object  Data Register Low */
#define CANR_MO65_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029830u)

/** Alias (User Manual Name) for CANR_MO65_DATAL.
* To use register names with standard convension, please use CANR_MO65_DATAL.
*/
#define	CANR_MODATAL65	(CANR_MO65_DATAL)

/** \\brief  1820, Message Object  Function Control Register */
#define CANR_MO65_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029820u)

/** Alias (User Manual Name) for CANR_MO65_FCR.
* To use register names with standard convension, please use CANR_MO65_FCR.
*/
#define	CANR_MOFCR65	(CANR_MO65_FCR)

/** \\brief  1824, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO65_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029824u)

/** Alias (User Manual Name) for CANR_MO65_FGPR.
* To use register names with standard convension, please use CANR_MO65_FGPR.
*/
#define	CANR_MOFGPR65	(CANR_MO65_FGPR)

/** \\brief  1828, Message Object  Interrupt Pointer Register */
#define CANR_MO65_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029828u)

/** Alias (User Manual Name) for CANR_MO65_IPR.
* To use register names with standard convension, please use CANR_MO65_IPR.
*/
#define	CANR_MOIPR65	(CANR_MO65_IPR)

/** \\brief  183C, Message Object  Control Register */
#define CANR_MO65_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF002983Cu)

/** Alias (User Manual Name) for CANR_MO65_STAT.
* To use register names with standard convension, please use CANR_MO65_STAT.
*/
#define	CANR_MOSTAT65	(CANR_MO65_STAT)

/** \\brief  184C, Message Object  Acceptance Mask Register */
#define CANR_MO66_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002984Cu)

/** Alias (User Manual Name) for CANR_MO66_AMR.
* To use register names with standard convension, please use CANR_MO66_AMR.
*/
#define	CANR_MOAMR66	(CANR_MO66_AMR)

/** \\brief  1858, Message Object  Arbitration Register */
#define CANR_MO66_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029858u)

/** Alias (User Manual Name) for CANR_MO66_AR.
* To use register names with standard convension, please use CANR_MO66_AR.
*/
#define	CANR_MOAR66	(CANR_MO66_AR)

/** \\brief  185C, Message Object  Control Register */
#define CANR_MO66_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF002985Cu)

/** Alias (User Manual Name) for CANR_MO66_CTR.
* To use register names with standard convension, please use CANR_MO66_CTR.
*/
#define	CANR_MOCTR66	(CANR_MO66_CTR)

/** \\brief  1854, Message Object  Data Register High */
#define CANR_MO66_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029854u)

/** Alias (User Manual Name) for CANR_MO66_DATAH.
* To use register names with standard convension, please use CANR_MO66_DATAH.
*/
#define	CANR_MODATAH66	(CANR_MO66_DATAH)

/** \\brief  1850, Message Object  Data Register Low */
#define CANR_MO66_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029850u)

/** Alias (User Manual Name) for CANR_MO66_DATAL.
* To use register names with standard convension, please use CANR_MO66_DATAL.
*/
#define	CANR_MODATAL66	(CANR_MO66_DATAL)

/** \\brief  1840, Message Object  Function Control Register */
#define CANR_MO66_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029840u)

/** Alias (User Manual Name) for CANR_MO66_FCR.
* To use register names with standard convension, please use CANR_MO66_FCR.
*/
#define	CANR_MOFCR66	(CANR_MO66_FCR)

