HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxCan_reg.h
/** Alias (User Manual Name) for CANR_MO68_STAT.
* To use register names with standard convension, please use CANR_MO68_STAT.
*/
#define	CANR_MOSTAT68	(CANR_MO68_STAT)

/** \\brief  18AC, Message Object  Acceptance Mask Register */
#define CANR_MO69_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF00298ACu)

/** Alias (User Manual Name) for CANR_MO69_AMR.
* To use register names with standard convension, please use CANR_MO69_AMR.
*/
#define	CANR_MOAMR69	(CANR_MO69_AMR)

/** \\brief  18B8, Message Object  Arbitration Register */
#define CANR_MO69_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF00298B8u)

/** Alias (User Manual Name) for CANR_MO69_AR.
* To use register names with standard convension, please use CANR_MO69_AR.
*/
#define	CANR_MOAR69	(CANR_MO69_AR)

/** \\brief  18BC, Message Object  Control Register */
#define CANR_MO69_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF00298BCu)

/** Alias (User Manual Name) for CANR_MO69_CTR.
* To use register names with standard convension, please use CANR_MO69_CTR.
*/
#define	CANR_MOCTR69	(CANR_MO69_CTR)

/** \\brief  18B4, Message Object  Data Register High */
#define CANR_MO69_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF00298B4u)

/** Alias (User Manual Name) for CANR_MO69_DATAH.
* To use register names with standard convension, please use CANR_MO69_DATAH.
*/
#define	CANR_MODATAH69	(CANR_MO69_DATAH)

/** \\brief  18B0, Message Object  Data Register Low */
#define CANR_MO69_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF00298B0u)

/** Alias (User Manual Name) for CANR_MO69_DATAL.
* To use register names with standard convension, please use CANR_MO69_DATAL.
*/
#define	CANR_MODATAL69	(CANR_MO69_DATAL)

/** \\brief  18A0, Message Object  Function Control Register */
#define CANR_MO69_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF00298A0u)

/** Alias (User Manual Name) for CANR_MO69_FCR.
* To use register names with standard convension, please use CANR_MO69_FCR.
*/
#define	CANR_MOFCR69	(CANR_MO69_FCR)

/** \\brief  18A4, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO69_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF00298A4u)

/** Alias (User Manual Name) for CANR_MO69_FGPR.
* To use register names with standard convension, please use CANR_MO69_FGPR.
*/
#define	CANR_MOFGPR69	(CANR_MO69_FGPR)

/** \\brief  18A8, Message Object  Interrupt Pointer Register */
#define CANR_MO69_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF00298A8u)

/** Alias (User Manual Name) for CANR_MO69_IPR.
* To use register names with standard convension, please use CANR_MO69_IPR.
*/
#define	CANR_MOIPR69	(CANR_MO69_IPR)

/** \\brief  18BC, Message Object  Control Register */
#define CANR_MO69_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF00298BCu)

/** Alias (User Manual Name) for CANR_MO69_STAT.
* To use register names with standard convension, please use CANR_MO69_STAT.
*/
#define	CANR_MOSTAT69	(CANR_MO69_STAT)

/** \\brief  10CC, Message Object  Acceptance Mask Register */
#define CANR_MO6_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF00290CCu)

/** Alias (User Manual Name) for CANR_MO6_AMR.
* To use register names with standard convension, please use CANR_MO6_AMR.
*/
#define	CANR_MOAMR6	(CANR_MO6_AMR)

/** \\brief  10D8, Message Object  Arbitration Register */
#define CANR_MO6_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF00290D8u)

/** Alias (User Manual Name) for CANR_MO6_AR.
* To use register names with standard convension, please use CANR_MO6_AR.
*/
#define	CANR_MOAR6	(CANR_MO6_AR)

/** \\brief  10DC, Message Object  Control Register */
#define CANR_MO6_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF00290DCu)

/** Alias (User Manual Name) for CANR_MO6_CTR.
* To use register names with standard convension, please use CANR_MO6_CTR.
*/
#define	CANR_MOCTR6	(CANR_MO6_CTR)

/** \\brief  10D4, Message Object  Data Register High */
#define CANR_MO6_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF00290D4u)

/** Alias (User Manual Name) for CANR_MO6_DATAH.
* To use register names with standard convension, please use CANR_MO6_DATAH.
*/
#define	CANR_MODATAH6	(CANR_MO6_DATAH)

/** \\brief  10D0, Message Object  Data Register Low */
#define CANR_MO6_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF00290D0u)

/** Alias (User Manual Name) for CANR_MO6_DATAL.
* To use register names with standard convension, please use CANR_MO6_DATAL.
*/
#define	CANR_MODATAL6	(CANR_MO6_DATAL)

/** \\brief  10C0, Message Object  Function Control Register */
#define CANR_MO6_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF00290C0u)

/** Alias (User Manual Name) for CANR_MO6_FCR.
* To use register names with standard convension, please use CANR_MO6_FCR.
*/
#define	CANR_MOFCR6	(CANR_MO6_FCR)

/** \\brief  10C4, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO6_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF00290C4u)

/** Alias (User Manual Name) for CANR_MO6_FGPR.
* To use register names with standard convension, please use CANR_MO6_FGPR.
*/
#define	CANR_MOFGPR6	(CANR_MO6_FGPR)

/** \\brief  10C8, Message Object  Interrupt Pointer Register */
#define CANR_MO6_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF00290C8u)

/** Alias (User Manual Name) for CANR_MO6_IPR.
* To use register names with standard convension, please use CANR_MO6_IPR.
*/
#define	CANR_MOIPR6	(CANR_MO6_IPR)

/** \\brief  10DC, Message Object  Control Register */
#define CANR_MO6_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF00290DCu)

/** Alias (User Manual Name) for CANR_MO6_STAT.
* To use register names with standard convension, please use CANR_MO6_STAT.
*/
#define	CANR_MOSTAT6	(CANR_MO6_STAT)

/** \\brief  18CC, Message Object  Acceptance Mask Register */
#define CANR_MO70_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF00298CCu)

/** Alias (User Manual Name) for CANR_MO70_AMR.
* To use register names with standard convension, please use CANR_MO70_AMR.
*/
#define	CANR_MOAMR70	(CANR_MO70_AMR)

/** \\brief  18D8, Message Object  Arbitration Register */
#define CANR_MO70_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF00298D8u)

