HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxCan_reg.h
/** Alias (User Manual Name) for CANR_MO74_FGPR.
* To use register names with standard convension, please use CANR_MO74_FGPR.
*/
#define	CANR_MOFGPR74	(CANR_MO74_FGPR)

/** \\brief  1948, Message Object  Interrupt Pointer Register */
#define CANR_MO74_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029948u)

/** Alias (User Manual Name) for CANR_MO74_IPR.
* To use register names with standard convension, please use CANR_MO74_IPR.
*/
#define	CANR_MOIPR74	(CANR_MO74_IPR)

/** \\brief  195C, Message Object  Control Register */
#define CANR_MO74_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF002995Cu)

/** Alias (User Manual Name) for CANR_MO74_STAT.
* To use register names with standard convension, please use CANR_MO74_STAT.
*/
#define	CANR_MOSTAT74	(CANR_MO74_STAT)

/** \\brief  196C, Message Object  Acceptance Mask Register */
#define CANR_MO75_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002996Cu)

/** Alias (User Manual Name) for CANR_MO75_AMR.
* To use register names with standard convension, please use CANR_MO75_AMR.
*/
#define	CANR_MOAMR75	(CANR_MO75_AMR)

/** \\brief  1978, Message Object  Arbitration Register */
#define CANR_MO75_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029978u)

/** Alias (User Manual Name) for CANR_MO75_AR.
* To use register names with standard convension, please use CANR_MO75_AR.
*/
#define	CANR_MOAR75	(CANR_MO75_AR)

/** \\brief  197C, Message Object  Control Register */
#define CANR_MO75_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF002997Cu)

/** Alias (User Manual Name) for CANR_MO75_CTR.
* To use register names with standard convension, please use CANR_MO75_CTR.
*/
#define	CANR_MOCTR75	(CANR_MO75_CTR)

/** \\brief  1974, Message Object  Data Register High */
#define CANR_MO75_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029974u)

/** Alias (User Manual Name) for CANR_MO75_DATAH.
* To use register names with standard convension, please use CANR_MO75_DATAH.
*/
#define	CANR_MODATAH75	(CANR_MO75_DATAH)

/** \\brief  1970, Message Object  Data Register Low */
#define CANR_MO75_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029970u)

/** Alias (User Manual Name) for CANR_MO75_DATAL.
* To use register names with standard convension, please use CANR_MO75_DATAL.
*/
#define	CANR_MODATAL75	(CANR_MO75_DATAL)

/** \\brief  1960, Message Object  Function Control Register */
#define CANR_MO75_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029960u)

/** Alias (User Manual Name) for CANR_MO75_FCR.
* To use register names with standard convension, please use CANR_MO75_FCR.
*/
#define	CANR_MOFCR75	(CANR_MO75_FCR)

/** \\brief  1964, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO75_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029964u)

/** Alias (User Manual Name) for CANR_MO75_FGPR.
* To use register names with standard convension, please use CANR_MO75_FGPR.
*/
#define	CANR_MOFGPR75	(CANR_MO75_FGPR)

/** \\brief  1968, Message Object  Interrupt Pointer Register */
#define CANR_MO75_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029968u)

/** Alias (User Manual Name) for CANR_MO75_IPR.
* To use register names with standard convension, please use CANR_MO75_IPR.
*/
#define	CANR_MOIPR75	(CANR_MO75_IPR)

/** \\brief  197C, Message Object  Control Register */
#define CANR_MO75_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF002997Cu)

/** Alias (User Manual Name) for CANR_MO75_STAT.
* To use register names with standard convension, please use CANR_MO75_STAT.
*/
#define	CANR_MOSTAT75	(CANR_MO75_STAT)

/** \\brief  198C, Message Object  Acceptance Mask Register */
#define CANR_MO76_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002998Cu)

/** Alias (User Manual Name) for CANR_MO76_AMR.
* To use register names with standard convension, please use CANR_MO76_AMR.
*/
#define	CANR_MOAMR76	(CANR_MO76_AMR)

/** \\brief  1998, Message Object  Arbitration Register */
#define CANR_MO76_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029998u)

/** Alias (User Manual Name) for CANR_MO76_AR.
* To use register names with standard convension, please use CANR_MO76_AR.
*/
#define	CANR_MOAR76	(CANR_MO76_AR)

/** \\brief  199C, Message Object  Control Register */
#define CANR_MO76_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF002999Cu)

/** Alias (User Manual Name) for CANR_MO76_CTR.
* To use register names with standard convension, please use CANR_MO76_CTR.
*/
#define	CANR_MOCTR76	(CANR_MO76_CTR)

/** \\brief  1994, Message Object  Data Register High */
#define CANR_MO76_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029994u)

/** Alias (User Manual Name) for CANR_MO76_DATAH.
* To use register names with standard convension, please use CANR_MO76_DATAH.
*/
#define	CANR_MODATAH76	(CANR_MO76_DATAH)

/** \\brief  1990, Message Object  Data Register Low */
#define CANR_MO76_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029990u)

/** Alias (User Manual Name) for CANR_MO76_DATAL.
* To use register names with standard convension, please use CANR_MO76_DATAL.
*/
#define	CANR_MODATAL76	(CANR_MO76_DATAL)

/** \\brief  1980, Message Object  Function Control Register */
#define CANR_MO76_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029980u)

/** Alias (User Manual Name) for CANR_MO76_FCR.
* To use register names with standard convension, please use CANR_MO76_FCR.
*/
#define	CANR_MOFCR76	(CANR_MO76_FCR)

/** \\brief  1984, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO76_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029984u)

/** Alias (User Manual Name) for CANR_MO76_FGPR.
* To use register names with standard convension, please use CANR_MO76_FGPR.
*/
#define	CANR_MOFGPR76	(CANR_MO76_FGPR)

/** \\brief  1988, Message Object  Interrupt Pointer Register */
#define CANR_MO76_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029988u)

/** Alias (User Manual Name) for CANR_MO76_IPR.
* To use register names with standard convension, please use CANR_MO76_IPR.
*/
#define	CANR_MOIPR76	(CANR_MO76_IPR)

