HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxCan_reg.h
/** Alias (User Manual Name) for CANR_MO79_FCR.
* To use register names with standard convension, please use CANR_MO79_FCR.
*/
#define	CANR_MOFCR79	(CANR_MO79_FCR)

/** \\brief  19E4, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO79_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF00299E4u)

/** Alias (User Manual Name) for CANR_MO79_FGPR.
* To use register names with standard convension, please use CANR_MO79_FGPR.
*/
#define	CANR_MOFGPR79	(CANR_MO79_FGPR)

/** \\brief  19E8, Message Object  Interrupt Pointer Register */
#define CANR_MO79_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF00299E8u)

/** Alias (User Manual Name) for CANR_MO79_IPR.
* To use register names with standard convension, please use CANR_MO79_IPR.
*/
#define	CANR_MOIPR79	(CANR_MO79_IPR)

/** \\brief  19FC, Message Object  Control Register */
#define CANR_MO79_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF00299FCu)

/** Alias (User Manual Name) for CANR_MO79_STAT.
* To use register names with standard convension, please use CANR_MO79_STAT.
*/
#define	CANR_MOSTAT79	(CANR_MO79_STAT)

/** \\brief  10EC, Message Object  Acceptance Mask Register */
#define CANR_MO7_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF00290ECu)

/** Alias (User Manual Name) for CANR_MO7_AMR.
* To use register names with standard convension, please use CANR_MO7_AMR.
*/
#define	CANR_MOAMR7	(CANR_MO7_AMR)

/** \\brief  10F8, Message Object  Arbitration Register */
#define CANR_MO7_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF00290F8u)

/** Alias (User Manual Name) for CANR_MO7_AR.
* To use register names with standard convension, please use CANR_MO7_AR.
*/
#define	CANR_MOAR7	(CANR_MO7_AR)

/** \\brief  10FC, Message Object  Control Register */
#define CANR_MO7_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF00290FCu)

/** Alias (User Manual Name) for CANR_MO7_CTR.
* To use register names with standard convension, please use CANR_MO7_CTR.
*/
#define	CANR_MOCTR7	(CANR_MO7_CTR)

/** \\brief  10F4, Message Object  Data Register High */
#define CANR_MO7_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF00290F4u)

/** Alias (User Manual Name) for CANR_MO7_DATAH.
* To use register names with standard convension, please use CANR_MO7_DATAH.
*/
#define	CANR_MODATAH7	(CANR_MO7_DATAH)

/** \\brief  10F0, Message Object  Data Register Low */
#define CANR_MO7_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF00290F0u)

/** Alias (User Manual Name) for CANR_MO7_DATAL.
* To use register names with standard convension, please use CANR_MO7_DATAL.
*/
#define	CANR_MODATAL7	(CANR_MO7_DATAL)

/** \\brief  10E0, Message Object  Function Control Register */
#define CANR_MO7_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF00290E0u)

/** Alias (User Manual Name) for CANR_MO7_FCR.
* To use register names with standard convension, please use CANR_MO7_FCR.
*/
#define	CANR_MOFCR7	(CANR_MO7_FCR)

/** \\brief  10E4, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO7_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF00290E4u)

/** Alias (User Manual Name) for CANR_MO7_FGPR.
* To use register names with standard convension, please use CANR_MO7_FGPR.
*/
#define	CANR_MOFGPR7	(CANR_MO7_FGPR)

/** \\brief  10E8, Message Object  Interrupt Pointer Register */
#define CANR_MO7_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF00290E8u)

/** Alias (User Manual Name) for CANR_MO7_IPR.
* To use register names with standard convension, please use CANR_MO7_IPR.
*/
#define	CANR_MOIPR7	(CANR_MO7_IPR)

/** \\brief  10FC, Message Object  Control Register */
#define CANR_MO7_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF00290FCu)

/** Alias (User Manual Name) for CANR_MO7_STAT.
* To use register names with standard convension, please use CANR_MO7_STAT.
*/
#define	CANR_MOSTAT7	(CANR_MO7_STAT)

/** \\brief  1A0C, Message Object  Acceptance Mask Register */
#define CANR_MO80_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF0029A0Cu)

/** Alias (User Manual Name) for CANR_MO80_AMR.
* To use register names with standard convension, please use CANR_MO80_AMR.
*/
#define	CANR_MOAMR80	(CANR_MO80_AMR)

/** \\brief  1A18, Message Object  Arbitration Register */
#define CANR_MO80_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029A18u)

/** Alias (User Manual Name) for CANR_MO80_AR.
* To use register names with standard convension, please use CANR_MO80_AR.
*/
#define	CANR_MOAR80	(CANR_MO80_AR)

/** \\brief  1A1C, Message Object  Control Register */
#define CANR_MO80_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF0029A1Cu)

/** Alias (User Manual Name) for CANR_MO80_CTR.
* To use register names with standard convension, please use CANR_MO80_CTR.
*/
#define	CANR_MOCTR80	(CANR_MO80_CTR)

/** \\brief  1A14, Message Object  Data Register High */
#define CANR_MO80_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029A14u)

/** Alias (User Manual Name) for CANR_MO80_DATAH.
* To use register names with standard convension, please use CANR_MO80_DATAH.
*/
#define	CANR_MODATAH80	(CANR_MO80_DATAH)

/** \\brief  1A10, Message Object  Data Register Low */
#define CANR_MO80_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029A10u)

/** Alias (User Manual Name) for CANR_MO80_DATAL.
* To use register names with standard convension, please use CANR_MO80_DATAL.
*/
#define	CANR_MODATAL80	(CANR_MO80_DATAL)

/** \\brief  1A00, Message Object  Function Control Register */
#define CANR_MO80_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029A00u)

/** Alias (User Manual Name) for CANR_MO80_FCR.
* To use register names with standard convension, please use CANR_MO80_FCR.
*/
#define	CANR_MOFCR80	(CANR_MO80_FCR)

/** \\brief  1A04, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO80_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029A04u)

/** Alias (User Manual Name) for CANR_MO80_FGPR.
* To use register names with standard convension, please use CANR_MO80_FGPR.
*/
#define	CANR_MOFGPR80	(CANR_MO80_FGPR)

/** \\brief  1A08, Message Object  Interrupt Pointer Register */
#define CANR_MO80_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029A08u)

/** Alias (User Manual Name) for CANR_MO80_IPR.
* To use register names with standard convension, please use CANR_MO80_IPR.
*/
#define	CANR_MOIPR80	(CANR_MO80_IPR)

/** \\brief  1A1C, Message Object  Control Register */
#define CANR_MO80_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF0029A1Cu)

/** Alias (User Manual Name) for CANR_MO80_STAT.
* To use register names with standard convension, please use CANR_MO80_STAT.
*/
#define	CANR_MOSTAT80	(CANR_MO80_STAT)

/** \\brief  1A2C, Message Object  Acceptance Mask Register */
#define CANR_MO81_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF0029A2Cu)

/** Alias (User Manual Name) for CANR_MO81_AMR.
* To use register names with standard convension, please use CANR_MO81_AMR.
*/
#define	CANR_MOAMR81	(CANR_MO81_AMR)

/** \\brief  1A38, Message Object  Arbitration Register */
#define CANR_MO81_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029A38u)

/** Alias (User Manual Name) for CANR_MO81_AR.
* To use register names with standard convension, please use CANR_MO81_AR.
*/
#define	CANR_MOAR81	(CANR_MO81_AR)

/** \\brief  1A3C, Message Object  Control Register */
#define CANR_MO81_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF0029A3Cu)

/** Alias (User Manual Name) for CANR_MO81_CTR.
* To use register names with standard convension, please use CANR_MO81_CTR.
*/
#define	CANR_MOCTR81	(CANR_MO81_CTR)

/** \\brief  1A34, Message Object  Data Register High */
#define CANR_MO81_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029A34u)

/** Alias (User Manual Name) for CANR_MO81_DATAH.
* To use register names with standard convension, please use CANR_MO81_DATAH.
*/
#define	CANR_MODATAH81	(CANR_MO81_DATAH)

/** \\brief  1A30, Message Object  Data Register Low */
#define CANR_MO81_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029A30u)

/** Alias (User Manual Name) for CANR_MO81_DATAL.
* To use register names with standard convension, please use CANR_MO81_DATAL.
*/
#define	CANR_MODATAL81	(CANR_MO81_DATAL)

/** \\brief  1A20, Message Object  Function Control Register */
#define CANR_MO81_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029A20u)

