HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxCan_reg.h
/** Alias (User Manual Name) for CANR_MO81_FCR.
* To use register names with standard convension, please use CANR_MO81_FCR.
*/
#define	CANR_MOFCR81	(CANR_MO81_FCR)

/** \\brief  1A24, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO81_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029A24u)

/** Alias (User Manual Name) for CANR_MO81_FGPR.
* To use register names with standard convension, please use CANR_MO81_FGPR.
*/
#define	CANR_MOFGPR81	(CANR_MO81_FGPR)

/** \\brief  1A28, Message Object  Interrupt Pointer Register */
#define CANR_MO81_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029A28u)

/** Alias (User Manual Name) for CANR_MO81_IPR.
* To use register names with standard convension, please use CANR_MO81_IPR.
*/
#define	CANR_MOIPR81	(CANR_MO81_IPR)

/** \\brief  1A3C, Message Object  Control Register */
#define CANR_MO81_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF0029A3Cu)

/** Alias (User Manual Name) for CANR_MO81_STAT.
* To use register names with standard convension, please use CANR_MO81_STAT.
*/
#define	CANR_MOSTAT81	(CANR_MO81_STAT)

/** \\brief  1A4C, Message Object  Acceptance Mask Register */
#define CANR_MO82_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF0029A4Cu)

/** Alias (User Manual Name) for CANR_MO82_AMR.
* To use register names with standard convension, please use CANR_MO82_AMR.
*/
#define	CANR_MOAMR82	(CANR_MO82_AMR)

/** \\brief  1A58, Message Object  Arbitration Register */
#define CANR_MO82_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029A58u)

/** Alias (User Manual Name) for CANR_MO82_AR.
* To use register names with standard convension, please use CANR_MO82_AR.
*/
#define	CANR_MOAR82	(CANR_MO82_AR)

/** \\brief  1A5C, Message Object  Control Register */
#define CANR_MO82_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF0029A5Cu)

/** Alias (User Manual Name) for CANR_MO82_CTR.
* To use register names with standard convension, please use CANR_MO82_CTR.
*/
#define	CANR_MOCTR82	(CANR_MO82_CTR)

/** \\brief  1A54, Message Object  Data Register High */
#define CANR_MO82_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029A54u)

/** Alias (User Manual Name) for CANR_MO82_DATAH.
* To use register names with standard convension, please use CANR_MO82_DATAH.
*/
#define	CANR_MODATAH82	(CANR_MO82_DATAH)

/** \\brief  1A50, Message Object  Data Register Low */
#define CANR_MO82_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029A50u)

/** Alias (User Manual Name) for CANR_MO82_DATAL.
* To use register names with standard convension, please use CANR_MO82_DATAL.
*/
#define	CANR_MODATAL82	(CANR_MO82_DATAL)

/** \\brief  1A40, Message Object  Function Control Register */
#define CANR_MO82_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029A40u)

/** Alias (User Manual Name) for CANR_MO82_FCR.
* To use register names with standard convension, please use CANR_MO82_FCR.
*/
#define	CANR_MOFCR82	(CANR_MO82_FCR)

/** \\brief  1A44, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO82_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029A44u)

/** Alias (User Manual Name) for CANR_MO82_FGPR.
* To use register names with standard convension, please use CANR_MO82_FGPR.
*/
#define	CANR_MOFGPR82	(CANR_MO82_FGPR)

/** \\brief  1A48, Message Object  Interrupt Pointer Register */
#define CANR_MO82_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029A48u)

/** Alias (User Manual Name) for CANR_MO82_IPR.
* To use register names with standard convension, please use CANR_MO82_IPR.
*/
#define	CANR_MOIPR82	(CANR_MO82_IPR)

/** \\brief  1A5C, Message Object  Control Register */
#define CANR_MO82_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF0029A5Cu)

/** Alias (User Manual Name) for CANR_MO82_STAT.
* To use register names with standard convension, please use CANR_MO82_STAT.
*/
#define	CANR_MOSTAT82	(CANR_MO82_STAT)

/** \\brief  1A6C, Message Object  Acceptance Mask Register */
#define CANR_MO83_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF0029A6Cu)

/** Alias (User Manual Name) for CANR_MO83_AMR.
* To use register names with standard convension, please use CANR_MO83_AMR.
*/
#define	CANR_MOAMR83	(CANR_MO83_AMR)

/** \\brief  1A78, Message Object  Arbitration Register */
#define CANR_MO83_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029A78u)

/** Alias (User Manual Name) for CANR_MO83_AR.
* To use register names with standard convension, please use CANR_MO83_AR.
*/
#define	CANR_MOAR83	(CANR_MO83_AR)

/** \\brief  1A7C, Message Object  Control Register */
#define CANR_MO83_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF0029A7Cu)

/** Alias (User Manual Name) for CANR_MO83_CTR.
* To use register names with standard convension, please use CANR_MO83_CTR.
*/
#define	CANR_MOCTR83	(CANR_MO83_CTR)

/** \\brief  1A74, Message Object  Data Register High */
#define CANR_MO83_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029A74u)

/** Alias (User Manual Name) for CANR_MO83_DATAH.
* To use register names with standard convension, please use CANR_MO83_DATAH.
*/
#define	CANR_MODATAH83	(CANR_MO83_DATAH)

/** \\brief  1A70, Message Object  Data Register Low */
#define CANR_MO83_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029A70u)

/** Alias (User Manual Name) for CANR_MO83_DATAL.
* To use register names with standard convension, please use CANR_MO83_DATAL.
*/
#define	CANR_MODATAL83	(CANR_MO83_DATAL)

/** \\brief  1A60, Message Object  Function Control Register */
#define CANR_MO83_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029A60u)

/** Alias (User Manual Name) for CANR_MO83_FCR.
* To use register names with standard convension, please use CANR_MO83_FCR.
*/
#define	CANR_MOFCR83	(CANR_MO83_FCR)

/** \\brief  1A64, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO83_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029A64u)

/** Alias (User Manual Name) for CANR_MO83_FGPR.
* To use register names with standard convension, please use CANR_MO83_FGPR.
*/
#define	CANR_MOFGPR83	(CANR_MO83_FGPR)

/** \\brief  1A68, Message Object  Interrupt Pointer Register */
#define CANR_MO83_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029A68u)

