HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxCan_reg.h
/** Alias (User Manual Name) for CANR_MO83_IPR.
* To use register names with standard convension, please use CANR_MO83_IPR.
*/
#define	CANR_MOIPR83	(CANR_MO83_IPR)

/** \\brief  1A7C, Message Object  Control Register */
#define CANR_MO83_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF0029A7Cu)

/** Alias (User Manual Name) for CANR_MO83_STAT.
* To use register names with standard convension, please use CANR_MO83_STAT.
*/
#define	CANR_MOSTAT83	(CANR_MO83_STAT)

/** \\brief  1A8C, Message Object  Acceptance Mask Register */
#define CANR_MO84_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF0029A8Cu)

/** Alias (User Manual Name) for CANR_MO84_AMR.
* To use register names with standard convension, please use CANR_MO84_AMR.
*/
#define	CANR_MOAMR84	(CANR_MO84_AMR)

/** \\brief  1A98, Message Object  Arbitration Register */
#define CANR_MO84_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029A98u)

/** Alias (User Manual Name) for CANR_MO84_AR.
* To use register names with standard convension, please use CANR_MO84_AR.
*/
#define	CANR_MOAR84	(CANR_MO84_AR)

/** \\brief  1A9C, Message Object  Control Register */
#define CANR_MO84_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF0029A9Cu)

/** Alias (User Manual Name) for CANR_MO84_CTR.
* To use register names with standard convension, please use CANR_MO84_CTR.
*/
#define	CANR_MOCTR84	(CANR_MO84_CTR)

/** \\brief  1A94, Message Object  Data Register High */
#define CANR_MO84_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029A94u)

/** Alias (User Manual Name) for CANR_MO84_DATAH.
* To use register names with standard convension, please use CANR_MO84_DATAH.
*/
#define	CANR_MODATAH84	(CANR_MO84_DATAH)

/** \\brief  1A90, Message Object  Data Register Low */
#define CANR_MO84_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029A90u)

/** Alias (User Manual Name) for CANR_MO84_DATAL.
* To use register names with standard convension, please use CANR_MO84_DATAL.
*/
#define	CANR_MODATAL84	(CANR_MO84_DATAL)

/** \\brief  1A80, Message Object  Function Control Register */
#define CANR_MO84_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029A80u)

/** Alias (User Manual Name) for CANR_MO84_FCR.
* To use register names with standard convension, please use CANR_MO84_FCR.
*/
#define	CANR_MOFCR84	(CANR_MO84_FCR)

/** \\brief  1A84, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO84_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029A84u)

/** Alias (User Manual Name) for CANR_MO84_FGPR.
* To use register names with standard convension, please use CANR_MO84_FGPR.
*/
#define	CANR_MOFGPR84	(CANR_MO84_FGPR)

/** \\brief  1A88, Message Object  Interrupt Pointer Register */
#define CANR_MO84_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029A88u)

/** Alias (User Manual Name) for CANR_MO84_IPR.
* To use register names with standard convension, please use CANR_MO84_IPR.
*/
#define	CANR_MOIPR84	(CANR_MO84_IPR)

/** \\brief  1A9C, Message Object  Control Register */
#define CANR_MO84_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF0029A9Cu)

/** Alias (User Manual Name) for CANR_MO84_STAT.
* To use register names with standard convension, please use CANR_MO84_STAT.
*/
#define	CANR_MOSTAT84	(CANR_MO84_STAT)

/** \\brief  1AAC, Message Object  Acceptance Mask Register */
#define CANR_MO85_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF0029AACu)

/** Alias (User Manual Name) for CANR_MO85_AMR.
* To use register names with standard convension, please use CANR_MO85_AMR.
*/
#define	CANR_MOAMR85	(CANR_MO85_AMR)

/** \\brief  1AB8, Message Object  Arbitration Register */
#define CANR_MO85_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029AB8u)

/** Alias (User Manual Name) for CANR_MO85_AR.
* To use register names with standard convension, please use CANR_MO85_AR.
*/
#define	CANR_MOAR85	(CANR_MO85_AR)

/** \\brief  1ABC, Message Object  Control Register */
#define CANR_MO85_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF0029ABCu)

/** Alias (User Manual Name) for CANR_MO85_CTR.
* To use register names with standard convension, please use CANR_MO85_CTR.
*/
#define	CANR_MOCTR85	(CANR_MO85_CTR)

/** \\brief  1AB4, Message Object  Data Register High */
#define CANR_MO85_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029AB4u)

/** Alias (User Manual Name) for CANR_MO85_DATAH.
* To use register names with standard convension, please use CANR_MO85_DATAH.
*/
#define	CANR_MODATAH85	(CANR_MO85_DATAH)

/** \\brief  1AB0, Message Object  Data Register Low */
#define CANR_MO85_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029AB0u)

/** Alias (User Manual Name) for CANR_MO85_DATAL.
* To use register names with standard convension, please use CANR_MO85_DATAL.
*/
#define	CANR_MODATAL85	(CANR_MO85_DATAL)

/** \\brief  1AA0, Message Object  Function Control Register */
#define CANR_MO85_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029AA0u)

/** Alias (User Manual Name) for CANR_MO85_FCR.
* To use register names with standard convension, please use CANR_MO85_FCR.
*/
#define	CANR_MOFCR85	(CANR_MO85_FCR)

/** \\brief  1AA4, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO85_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029AA4u)

/** Alias (User Manual Name) for CANR_MO85_FGPR.
* To use register names with standard convension, please use CANR_MO85_FGPR.
*/
#define	CANR_MOFGPR85	(CANR_MO85_FGPR)

/** \\brief  1AA8, Message Object  Interrupt Pointer Register */
#define CANR_MO85_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029AA8u)

/** Alias (User Manual Name) for CANR_MO85_IPR.
* To use register names with standard convension, please use CANR_MO85_IPR.
*/
#define	CANR_MOIPR85	(CANR_MO85_IPR)

/** \\brief  1ABC, Message Object  Control Register */
#define CANR_MO85_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF0029ABCu)

/** Alias (User Manual Name) for CANR_MO85_STAT.
* To use register names with standard convension, please use CANR_MO85_STAT.
*/
#define	CANR_MOSTAT85	(CANR_MO85_STAT)

/** \\brief  1ACC, Message Object  Acceptance Mask Register */
#define CANR_MO86_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF0029ACCu)

/** Alias (User Manual Name) for CANR_MO86_AMR.
* To use register names with standard convension, please use CANR_MO86_AMR.
*/
#define	CANR_MOAMR86	(CANR_MO86_AMR)

/** \\brief  1AD8, Message Object  Arbitration Register */
#define CANR_MO86_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029AD8u)

/** Alias (User Manual Name) for CANR_MO86_AR.
* To use register names with standard convension, please use CANR_MO86_AR.
*/
#define	CANR_MOAR86	(CANR_MO86_AR)

/** \\brief  1ADC, Message Object  Control Register */
#define CANR_MO86_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF0029ADCu)

/** Alias (User Manual Name) for CANR_MO86_CTR.
* To use register names with standard convension, please use CANR_MO86_CTR.
*/
#define	CANR_MOCTR86	(CANR_MO86_CTR)

