HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxCan_reg.h
/** \\brief  1AD4, Message Object  Data Register High */
#define CANR_MO86_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029AD4u)

/** Alias (User Manual Name) for CANR_MO86_DATAH.
* To use register names with standard convension, please use CANR_MO86_DATAH.
*/
#define	CANR_MODATAH86	(CANR_MO86_DATAH)

/** \\brief  1AD0, Message Object  Data Register Low */
#define CANR_MO86_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029AD0u)

/** Alias (User Manual Name) for CANR_MO86_DATAL.
* To use register names with standard convension, please use CANR_MO86_DATAL.
*/
#define	CANR_MODATAL86	(CANR_MO86_DATAL)

/** \\brief  1AC0, Message Object  Function Control Register */
#define CANR_MO86_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029AC0u)

/** Alias (User Manual Name) for CANR_MO86_FCR.
* To use register names with standard convension, please use CANR_MO86_FCR.
*/
#define	CANR_MOFCR86	(CANR_MO86_FCR)

/** \\brief  1AC4, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO86_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029AC4u)

/** Alias (User Manual Name) for CANR_MO86_FGPR.
* To use register names with standard convension, please use CANR_MO86_FGPR.
*/
#define	CANR_MOFGPR86	(CANR_MO86_FGPR)

/** \\brief  1AC8, Message Object  Interrupt Pointer Register */
#define CANR_MO86_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029AC8u)

/** Alias (User Manual Name) for CANR_MO86_IPR.
* To use register names with standard convension, please use CANR_MO86_IPR.
*/
#define	CANR_MOIPR86	(CANR_MO86_IPR)

/** \\brief  1ADC, Message Object  Control Register */
#define CANR_MO86_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF0029ADCu)

/** Alias (User Manual Name) for CANR_MO86_STAT.
* To use register names with standard convension, please use CANR_MO86_STAT.
*/
#define	CANR_MOSTAT86	(CANR_MO86_STAT)

/** \\brief  1AEC, Message Object  Acceptance Mask Register */
#define CANR_MO87_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF0029AECu)

/** Alias (User Manual Name) for CANR_MO87_AMR.
* To use register names with standard convension, please use CANR_MO87_AMR.
*/
#define	CANR_MOAMR87	(CANR_MO87_AMR)

/** \\brief  1AF8, Message Object  Arbitration Register */
#define CANR_MO87_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029AF8u)

/** Alias (User Manual Name) for CANR_MO87_AR.
* To use register names with standard convension, please use CANR_MO87_AR.
*/
#define	CANR_MOAR87	(CANR_MO87_AR)

/** \\brief  1AFC, Message Object  Control Register */
#define CANR_MO87_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF0029AFCu)

/** Alias (User Manual Name) for CANR_MO87_CTR.
* To use register names with standard convension, please use CANR_MO87_CTR.
*/
#define	CANR_MOCTR87	(CANR_MO87_CTR)

/** \\brief  1AF4, Message Object  Data Register High */
#define CANR_MO87_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029AF4u)

/** Alias (User Manual Name) for CANR_MO87_DATAH.
* To use register names with standard convension, please use CANR_MO87_DATAH.
*/
#define	CANR_MODATAH87	(CANR_MO87_DATAH)

/** \\brief  1AF0, Message Object  Data Register Low */
#define CANR_MO87_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029AF0u)

/** Alias (User Manual Name) for CANR_MO87_DATAL.
* To use register names with standard convension, please use CANR_MO87_DATAL.
*/
#define	CANR_MODATAL87	(CANR_MO87_DATAL)

/** \\brief  1AE0, Message Object  Function Control Register */
#define CANR_MO87_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029AE0u)

/** Alias (User Manual Name) for CANR_MO87_FCR.
* To use register names with standard convension, please use CANR_MO87_FCR.
*/
#define	CANR_MOFCR87	(CANR_MO87_FCR)

/** \\brief  1AE4, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO87_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029AE4u)

/** Alias (User Manual Name) for CANR_MO87_FGPR.
* To use register names with standard convension, please use CANR_MO87_FGPR.
*/
#define	CANR_MOFGPR87	(CANR_MO87_FGPR)

/** \\brief  1AE8, Message Object  Interrupt Pointer Register */
#define CANR_MO87_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029AE8u)

/** Alias (User Manual Name) for CANR_MO87_IPR.
* To use register names with standard convension, please use CANR_MO87_IPR.
*/
#define	CANR_MOIPR87	(CANR_MO87_IPR)

/** \\brief  1AFC, Message Object  Control Register */
#define CANR_MO87_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF0029AFCu)

/** Alias (User Manual Name) for CANR_MO87_STAT.
* To use register names with standard convension, please use CANR_MO87_STAT.
*/
#define	CANR_MOSTAT87	(CANR_MO87_STAT)

/** \\brief  1B0C, Message Object  Acceptance Mask Register */
#define CANR_MO88_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF0029B0Cu)

/** Alias (User Manual Name) for CANR_MO88_AMR.
* To use register names with standard convension, please use CANR_MO88_AMR.
*/
#define	CANR_MOAMR88	(CANR_MO88_AMR)

/** \\brief  1B18, Message Object  Arbitration Register */
#define CANR_MO88_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029B18u)

/** Alias (User Manual Name) for CANR_MO88_AR.
* To use register names with standard convension, please use CANR_MO88_AR.
*/
#define	CANR_MOAR88	(CANR_MO88_AR)

/** \\brief  1B1C, Message Object  Control Register */
#define CANR_MO88_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF0029B1Cu)

/** Alias (User Manual Name) for CANR_MO88_CTR.
* To use register names with standard convension, please use CANR_MO88_CTR.
*/
#define	CANR_MOCTR88	(CANR_MO88_CTR)

/** \\brief  1B14, Message Object  Data Register High */
#define CANR_MO88_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029B14u)

/** Alias (User Manual Name) for CANR_MO88_DATAH.
* To use register names with standard convension, please use CANR_MO88_DATAH.
*/
#define	CANR_MODATAH88	(CANR_MO88_DATAH)

/** \\brief  1B10, Message Object  Data Register Low */
#define CANR_MO88_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029B10u)

/** Alias (User Manual Name) for CANR_MO88_DATAL.
* To use register names with standard convension, please use CANR_MO88_DATAL.
*/
#define	CANR_MODATAL88	(CANR_MO88_DATAL)

/** \\brief  1B00, Message Object  Function Control Register */
#define CANR_MO88_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029B00u)

