HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxCan_reg.h
/** \\brief  111C, Message Object  Control Register */
#define CANR_MO8_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF002911Cu)

/** Alias (User Manual Name) for CANR_MO8_STAT.
* To use register names with standard convension, please use CANR_MO8_STAT.
*/
#define	CANR_MOSTAT8	(CANR_MO8_STAT)

/** \\brief  1B4C, Message Object  Acceptance Mask Register */
#define CANR_MO90_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF0029B4Cu)

/** Alias (User Manual Name) for CANR_MO90_AMR.
* To use register names with standard convension, please use CANR_MO90_AMR.
*/
#define	CANR_MOAMR90	(CANR_MO90_AMR)

/** \\brief  1B58, Message Object  Arbitration Register */
#define CANR_MO90_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029B58u)

/** Alias (User Manual Name) for CANR_MO90_AR.
* To use register names with standard convension, please use CANR_MO90_AR.
*/
#define	CANR_MOAR90	(CANR_MO90_AR)

/** \\brief  1B5C, Message Object  Control Register */
#define CANR_MO90_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF0029B5Cu)

/** Alias (User Manual Name) for CANR_MO90_CTR.
* To use register names with standard convension, please use CANR_MO90_CTR.
*/
#define	CANR_MOCTR90	(CANR_MO90_CTR)

/** \\brief  1B54, Message Object  Data Register High */
#define CANR_MO90_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029B54u)

/** Alias (User Manual Name) for CANR_MO90_DATAH.
* To use register names with standard convension, please use CANR_MO90_DATAH.
*/
#define	CANR_MODATAH90	(CANR_MO90_DATAH)

/** \\brief  1B50, Message Object  Data Register Low */
#define CANR_MO90_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029B50u)

/** Alias (User Manual Name) for CANR_MO90_DATAL.
* To use register names with standard convension, please use CANR_MO90_DATAL.
*/
#define	CANR_MODATAL90	(CANR_MO90_DATAL)

/** \\brief  1B40, Message Object  Function Control Register */
#define CANR_MO90_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029B40u)

/** Alias (User Manual Name) for CANR_MO90_FCR.
* To use register names with standard convension, please use CANR_MO90_FCR.
*/
#define	CANR_MOFCR90	(CANR_MO90_FCR)

/** \\brief  1B44, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO90_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029B44u)

/** Alias (User Manual Name) for CANR_MO90_FGPR.
* To use register names with standard convension, please use CANR_MO90_FGPR.
*/
#define	CANR_MOFGPR90	(CANR_MO90_FGPR)

/** \\brief  1B48, Message Object  Interrupt Pointer Register */
#define CANR_MO90_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029B48u)

/** Alias (User Manual Name) for CANR_MO90_IPR.
* To use register names with standard convension, please use CANR_MO90_IPR.
*/
#define	CANR_MOIPR90	(CANR_MO90_IPR)

/** \\brief  1B5C, Message Object  Control Register */
#define CANR_MO90_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF0029B5Cu)

/** Alias (User Manual Name) for CANR_MO90_STAT.
* To use register names with standard convension, please use CANR_MO90_STAT.
*/
#define	CANR_MOSTAT90	(CANR_MO90_STAT)

/** \\brief  1B6C, Message Object  Acceptance Mask Register */
#define CANR_MO91_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF0029B6Cu)

/** Alias (User Manual Name) for CANR_MO91_AMR.
* To use register names with standard convension, please use CANR_MO91_AMR.
*/
#define	CANR_MOAMR91	(CANR_MO91_AMR)

/** \\brief  1B78, Message Object  Arbitration Register */
#define CANR_MO91_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029B78u)

/** Alias (User Manual Name) for CANR_MO91_AR.
* To use register names with standard convension, please use CANR_MO91_AR.
*/
#define	CANR_MOAR91	(CANR_MO91_AR)

/** \\brief  1B7C, Message Object  Control Register */
#define CANR_MO91_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF0029B7Cu)

/** Alias (User Manual Name) for CANR_MO91_CTR.
* To use register names with standard convension, please use CANR_MO91_CTR.
*/
#define	CANR_MOCTR91	(CANR_MO91_CTR)

/** \\brief  1B74, Message Object  Data Register High */
#define CANR_MO91_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029B74u)

/** Alias (User Manual Name) for CANR_MO91_DATAH.
* To use register names with standard convension, please use CANR_MO91_DATAH.
*/
#define	CANR_MODATAH91	(CANR_MO91_DATAH)

/** \\brief  1B70, Message Object  Data Register Low */
#define CANR_MO91_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029B70u)

/** Alias (User Manual Name) for CANR_MO91_DATAL.
* To use register names with standard convension, please use CANR_MO91_DATAL.
*/
#define	CANR_MODATAL91	(CANR_MO91_DATAL)

/** \\brief  1B60, Message Object  Function Control Register */
#define CANR_MO91_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029B60u)

/** Alias (User Manual Name) for CANR_MO91_FCR.
* To use register names with standard convension, please use CANR_MO91_FCR.
*/
#define	CANR_MOFCR91	(CANR_MO91_FCR)

/** \\brief  1B64, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO91_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029B64u)

/** Alias (User Manual Name) for CANR_MO91_FGPR.
* To use register names with standard convension, please use CANR_MO91_FGPR.
*/
#define	CANR_MOFGPR91	(CANR_MO91_FGPR)

/** \\brief  1B68, Message Object  Interrupt Pointer Register */
#define CANR_MO91_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029B68u)

/** Alias (User Manual Name) for CANR_MO91_IPR.
* To use register names with standard convension, please use CANR_MO91_IPR.
*/
#define	CANR_MOIPR91	(CANR_MO91_IPR)

/** \\brief  1B7C, Message Object  Control Register */
#define CANR_MO91_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF0029B7Cu)

/** Alias (User Manual Name) for CANR_MO91_STAT.
* To use register names with standard convension, please use CANR_MO91_STAT.
*/
#define	CANR_MOSTAT91	(CANR_MO91_STAT)

/** \\brief  1B8C, Message Object  Acceptance Mask Register */
#define CANR_MO92_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF0029B8Cu)

/** Alias (User Manual Name) for CANR_MO92_AMR.
* To use register names with standard convension, please use CANR_MO92_AMR.
*/
#define	CANR_MOAMR92	(CANR_MO92_AMR)

/** \\brief  1B98, Message Object  Arbitration Register */
#define CANR_MO92_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029B98u)

