HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxCan_reg.h
/** Alias (User Manual Name) for CANR_MO92_AR.
* To use register names with standard convension, please use CANR_MO92_AR.
*/
#define	CANR_MOAR92	(CANR_MO92_AR)

/** \\brief  1B9C, Message Object  Control Register */
#define CANR_MO92_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF0029B9Cu)

/** Alias (User Manual Name) for CANR_MO92_CTR.
* To use register names with standard convension, please use CANR_MO92_CTR.
*/
#define	CANR_MOCTR92	(CANR_MO92_CTR)

/** \\brief  1B94, Message Object  Data Register High */
#define CANR_MO92_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029B94u)

/** Alias (User Manual Name) for CANR_MO92_DATAH.
* To use register names with standard convension, please use CANR_MO92_DATAH.
*/
#define	CANR_MODATAH92	(CANR_MO92_DATAH)

/** \\brief  1B90, Message Object  Data Register Low */
#define CANR_MO92_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029B90u)

/** Alias (User Manual Name) for CANR_MO92_DATAL.
* To use register names with standard convension, please use CANR_MO92_DATAL.
*/
#define	CANR_MODATAL92	(CANR_MO92_DATAL)

/** \\brief  1B80, Message Object  Function Control Register */
#define CANR_MO92_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029B80u)

/** Alias (User Manual Name) for CANR_MO92_FCR.
* To use register names with standard convension, please use CANR_MO92_FCR.
*/
#define	CANR_MOFCR92	(CANR_MO92_FCR)

/** \\brief  1B84, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO92_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029B84u)

/** Alias (User Manual Name) for CANR_MO92_FGPR.
* To use register names with standard convension, please use CANR_MO92_FGPR.
*/
#define	CANR_MOFGPR92	(CANR_MO92_FGPR)

/** \\brief  1B88, Message Object  Interrupt Pointer Register */
#define CANR_MO92_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029B88u)

/** Alias (User Manual Name) for CANR_MO92_IPR.
* To use register names with standard convension, please use CANR_MO92_IPR.
*/
#define	CANR_MOIPR92	(CANR_MO92_IPR)

/** \\brief  1B9C, Message Object  Control Register */
#define CANR_MO92_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF0029B9Cu)

/** Alias (User Manual Name) for CANR_MO92_STAT.
* To use register names with standard convension, please use CANR_MO92_STAT.
*/
#define	CANR_MOSTAT92	(CANR_MO92_STAT)

/** \\brief  1BAC, Message Object  Acceptance Mask Register */
#define CANR_MO93_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF0029BACu)

/** Alias (User Manual Name) for CANR_MO93_AMR.
* To use register names with standard convension, please use CANR_MO93_AMR.
*/
#define	CANR_MOAMR93	(CANR_MO93_AMR)

/** \\brief  1BB8, Message Object  Arbitration Register */
#define CANR_MO93_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029BB8u)

/** Alias (User Manual Name) for CANR_MO93_AR.
* To use register names with standard convension, please use CANR_MO93_AR.
*/
#define	CANR_MOAR93	(CANR_MO93_AR)

/** \\brief  1BBC, Message Object  Control Register */
#define CANR_MO93_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF0029BBCu)

/** Alias (User Manual Name) for CANR_MO93_CTR.
* To use register names with standard convension, please use CANR_MO93_CTR.
*/
#define	CANR_MOCTR93	(CANR_MO93_CTR)

/** \\brief  1BB4, Message Object  Data Register High */
#define CANR_MO93_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029BB4u)

/** Alias (User Manual Name) for CANR_MO93_DATAH.
* To use register names with standard convension, please use CANR_MO93_DATAH.
*/
#define	CANR_MODATAH93	(CANR_MO93_DATAH)

/** \\brief  1BB0, Message Object  Data Register Low */
#define CANR_MO93_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029BB0u)

/** Alias (User Manual Name) for CANR_MO93_DATAL.
* To use register names with standard convension, please use CANR_MO93_DATAL.
*/
#define	CANR_MODATAL93	(CANR_MO93_DATAL)

/** \\brief  1BA0, Message Object  Function Control Register */
#define CANR_MO93_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029BA0u)

/** Alias (User Manual Name) for CANR_MO93_FCR.
* To use register names with standard convension, please use CANR_MO93_FCR.
*/
#define	CANR_MOFCR93	(CANR_MO93_FCR)

/** \\brief  1BA4, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO93_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029BA4u)

/** Alias (User Manual Name) for CANR_MO93_FGPR.
* To use register names with standard convension, please use CANR_MO93_FGPR.
*/
#define	CANR_MOFGPR93	(CANR_MO93_FGPR)

/** \\brief  1BA8, Message Object  Interrupt Pointer Register */
#define CANR_MO93_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029BA8u)

/** Alias (User Manual Name) for CANR_MO93_IPR.
* To use register names with standard convension, please use CANR_MO93_IPR.
*/
#define	CANR_MOIPR93	(CANR_MO93_IPR)

/** \\brief  1BBC, Message Object  Control Register */
#define CANR_MO93_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF0029BBCu)

/** Alias (User Manual Name) for CANR_MO93_STAT.
* To use register names with standard convension, please use CANR_MO93_STAT.
*/
#define	CANR_MOSTAT93	(CANR_MO93_STAT)

/** \\brief  1BCC, Message Object  Acceptance Mask Register */
#define CANR_MO94_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF0029BCCu)

/** Alias (User Manual Name) for CANR_MO94_AMR.
* To use register names with standard convension, please use CANR_MO94_AMR.
*/
#define	CANR_MOAMR94	(CANR_MO94_AMR)

/** \\brief  1BD8, Message Object  Arbitration Register */
#define CANR_MO94_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029BD8u)

/** Alias (User Manual Name) for CANR_MO94_AR.
* To use register names with standard convension, please use CANR_MO94_AR.
*/
#define	CANR_MOAR94	(CANR_MO94_AR)

/** \\brief  1BDC, Message Object  Control Register */
#define CANR_MO94_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF0029BDCu)

/** Alias (User Manual Name) for CANR_MO94_CTR.
* To use register names with standard convension, please use CANR_MO94_CTR.
*/
#define	CANR_MOCTR94	(CANR_MO94_CTR)

/** \\brief  1BD4, Message Object  Data Register High */
#define CANR_MO94_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029BD4u)

/** Alias (User Manual Name) for CANR_MO94_DATAH.
* To use register names with standard convension, please use CANR_MO94_DATAH.
*/
#define	CANR_MODATAH94	(CANR_MO94_DATAH)

/** \\brief  1BD0, Message Object  Data Register Low */
#define CANR_MO94_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029BD0u)

/** Alias (User Manual Name) for CANR_MO94_DATAL.
* To use register names with standard convension, please use CANR_MO94_DATAL.
*/
#define	CANR_MODATAL94	(CANR_MO94_DATAL)

/** \\brief  1BC0, Message Object  Function Control Register */
#define CANR_MO94_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029BC0u)

/** Alias (User Manual Name) for CANR_MO94_FCR.
* To use register names with standard convension, please use CANR_MO94_FCR.
*/
#define	CANR_MOFCR94	(CANR_MO94_FCR)

/** \\brief  1BC4, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO94_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029BC4u)

/** Alias (User Manual Name) for CANR_MO94_FGPR.
* To use register names with standard convension, please use CANR_MO94_FGPR.
*/
#define	CANR_MOFGPR94	(CANR_MO94_FGPR)

/** \\brief  1BC8, Message Object  Interrupt Pointer Register */
#define CANR_MO94_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029BC8u)

