HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxCan_reg.h
/** Alias (User Manual Name) for CANR_MO99_DATAH.
* To use register names with standard convension, please use CANR_MO99_DATAH.
*/
#define	CANR_MODATAH99	(CANR_MO99_DATAH)

/** \\brief  1C70, Message Object  Data Register Low */
#define CANR_MO99_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029C70u)

/** Alias (User Manual Name) for CANR_MO99_DATAL.
* To use register names with standard convension, please use CANR_MO99_DATAL.
*/
#define	CANR_MODATAL99	(CANR_MO99_DATAL)

/** \\brief  1C60, Message Object  Function Control Register */
#define CANR_MO99_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029C60u)

/** Alias (User Manual Name) for CANR_MO99_FCR.
* To use register names with standard convension, please use CANR_MO99_FCR.
*/
#define	CANR_MOFCR99	(CANR_MO99_FCR)

/** \\brief  1C64, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO99_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029C64u)

/** Alias (User Manual Name) for CANR_MO99_FGPR.
* To use register names with standard convension, please use CANR_MO99_FGPR.
*/
#define	CANR_MOFGPR99	(CANR_MO99_FGPR)

/** \\brief  1C68, Message Object  Interrupt Pointer Register */
#define CANR_MO99_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029C68u)

/** Alias (User Manual Name) for CANR_MO99_IPR.
* To use register names with standard convension, please use CANR_MO99_IPR.
*/
#define	CANR_MOIPR99	(CANR_MO99_IPR)

/** \\brief  1C7C, Message Object  Control Register */
#define CANR_MO99_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF0029C7Cu)

/** Alias (User Manual Name) for CANR_MO99_STAT.
* To use register names with standard convension, please use CANR_MO99_STAT.
*/
#define	CANR_MOSTAT99	(CANR_MO99_STAT)

/** \\brief  112C, Message Object  Acceptance Mask Register */
#define CANR_MO9_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002912Cu)

/** Alias (User Manual Name) for CANR_MO9_AMR.
* To use register names with standard convension, please use CANR_MO9_AMR.
*/
#define	CANR_MOAMR9	(CANR_MO9_AMR)

/** \\brief  1138, Message Object  Arbitration Register */
#define CANR_MO9_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029138u)

/** Alias (User Manual Name) for CANR_MO9_AR.
* To use register names with standard convension, please use CANR_MO9_AR.
*/
#define	CANR_MOAR9	(CANR_MO9_AR)

/** \\brief  113C, Message Object  Control Register */
#define CANR_MO9_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF002913Cu)

/** Alias (User Manual Name) for CANR_MO9_CTR.
* To use register names with standard convension, please use CANR_MO9_CTR.
*/
#define	CANR_MOCTR9	(CANR_MO9_CTR)

/** \\brief  1134, Message Object  Data Register High */
#define CANR_MO9_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029134u)

/** Alias (User Manual Name) for CANR_MO9_DATAH.
* To use register names with standard convension, please use CANR_MO9_DATAH.
*/
#define	CANR_MODATAH9	(CANR_MO9_DATAH)

/** \\brief  1130, Message Object  Data Register Low */
#define CANR_MO9_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029130u)

/** Alias (User Manual Name) for CANR_MO9_DATAL.
* To use register names with standard convension, please use CANR_MO9_DATAL.
*/
#define	CANR_MODATAL9	(CANR_MO9_DATAL)

/** \\brief  1120, Message Object  Function Control Register */
#define CANR_MO9_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029120u)

/** Alias (User Manual Name) for CANR_MO9_FCR.
* To use register names with standard convension, please use CANR_MO9_FCR.
*/
#define	CANR_MOFCR9	(CANR_MO9_FCR)

/** \\brief  1124, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO9_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029124u)

/** Alias (User Manual Name) for CANR_MO9_FGPR.
* To use register names with standard convension, please use CANR_MO9_FGPR.
*/
#define	CANR_MOFGPR9	(CANR_MO9_FGPR)

/** \\brief  1128, Message Object  Interrupt Pointer Register */
#define CANR_MO9_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029128u)

/** Alias (User Manual Name) for CANR_MO9_IPR.
* To use register names with standard convension, please use CANR_MO9_IPR.
*/
#define	CANR_MOIPR9	(CANR_MO9_IPR)

/** \\brief  113C, Message Object  Control Register */
#define CANR_MO9_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF002913Cu)

/** Alias (User Manual Name) for CANR_MO9_STAT.
* To use register names with standard convension, please use CANR_MO9_STAT.
*/
#define	CANR_MOSTAT9	(CANR_MO9_STAT)

/** \\brief  180, Message Index Register */
#define CANR_MSID0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MSID*)0xF0028180u)

/** \\brief  184, Message Index Register */
#define CANR_MSID1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MSID*)0xF0028184u)

/** \\brief  188, Message Index Register */
#define CANR_MSID2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MSID*)0xF0028188u)

/** \\brief  18C, Message Index Register */
#define CANR_MSID3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MSID*)0xF002818Cu)

/** \\brief  190, Message Index Register */
#define CANR_MSID4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MSID*)0xF0028190u)

/** \\brief  194, Message Index Register */
#define CANR_MSID5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MSID*)0xF0028194u)

/** \\brief  198, Message Index Register */
#define CANR_MSID6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MSID*)0xF0028198u)

/** \\brief  19C, Message Index Register */
#define CANR_MSID7 /*lint --e(923)*/ (*(volatile Ifx_CAN_MSID*)0xF002819Cu)

/** \\brief  1C0, Message Index Mask Register */
#define CANR_MSIMASK /*lint --e(923)*/ (*(volatile Ifx_CAN_MSIMASK*)0xF00281C0u)

/** \\brief  140, Message Pending Register */
#define CANR_MSPND0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MSPND*)0xF0028140u)

/** \\brief  144, Message Pending Register */
#define CANR_MSPND1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MSPND*)0xF0028144u)

/** \\brief  148, Message Pending Register */
#define CANR_MSPND2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MSPND*)0xF0028148u)

/** \\brief  14C, Message Pending Register */
#define CANR_MSPND3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MSPND*)0xF002814Cu)

