HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxCan_reg.h
/** \\brief  150, Message Pending Register */
#define CANR_MSPND4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MSPND*)0xF0028150u)

/** \\brief  154, Message Pending Register */
#define CANR_MSPND5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MSPND*)0xF0028154u)

/** \\brief  158, Message Pending Register */
#define CANR_MSPND6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MSPND*)0xF0028158u)

/** \\brief  15C, Message Pending Register */
#define CANR_MSPND7 /*lint --e(923)*/ (*(volatile Ifx_CAN_MSPND*)0xF002815Cu)

/** \\brief  210, Node Bit Timing Register */
#define CANR_N0_BTR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_BTR*)0xF0028210u)

/** Alias (User Manual Name) for CANR_N0_BTR.
* To use register names with standard convension, please use CANR_N0_BTR.
*/
#define	CANR_NBTR0	(CANR_N0_BTR)

/** \\brief  200, Node Control Register */
#define CANR_N0_CR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_CR*)0xF0028200u)

/** Alias (User Manual Name) for CANR_N0_CR.
* To use register names with standard convension, please use CANR_N0_CR.
*/
#define	CANR_NCR0	(CANR_N0_CR)

/** \\brief  214, Node Error Counter Register */
#define CANR_N0_ECNT /*lint --e(923)*/ (*(volatile Ifx_CAN_N_ECNT*)0xF0028214u)

/** Alias (User Manual Name) for CANR_N0_ECNT.
* To use register names with standard convension, please use CANR_N0_ECNT.
*/
#define	CANR_NECNT0	(CANR_N0_ECNT)

/** \\brief  218, Node Frame Counter Register */
#define CANR_N0_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_FCR*)0xF0028218u)

/** Alias (User Manual Name) for CANR_N0_FCR.
* To use register names with standard convension, please use CANR_N0_FCR.
*/
#define	CANR_NFCR0	(CANR_N0_FCR)

/** \\brief  208, Node Interrupt Pointer Register */
#define CANR_N0_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_IPR*)0xF0028208u)

/** Alias (User Manual Name) for CANR_N0_IPR.
* To use register names with standard convension, please use CANR_N0_IPR.
*/
#define	CANR_NIPR0	(CANR_N0_IPR)

/** \\brief  20C, Node Port Control Register */
#define CANR_N0_PCR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_PCR*)0xF002820Cu)

/** Alias (User Manual Name) for CANR_N0_PCR.
* To use register names with standard convension, please use CANR_N0_PCR.
*/
#define	CANR_NPCR0	(CANR_N0_PCR)

/** \\brief  204, Node Status Register */
#define CANR_N0_SR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_SR*)0xF0028204u)

/** Alias (User Manual Name) for CANR_N0_SR.
* To use register names with standard convension, please use CANR_N0_SR.
*/
#define	CANR_NSR0	(CANR_N0_SR)

/** \\brief  224, Node Timer A Transmit Trigger Register */
#define CANR_N0_TATTR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TTTR*)0xF0028224u)

/** Alias (User Manual Name) for CANR_N0_TATTR.
* To use register names with standard convension, please use CANR_N0_TATTR.
*/
#define	CANR_NTATTR0	(CANR_N0_TATTR)

/** \\brief  228, Node Timer B Transmit Trigger Register */
#define CANR_N0_TBTTR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TTTR*)0xF0028228u)

/** Alias (User Manual Name) for CANR_N0_TBTTR.
* To use register names with standard convension, please use CANR_N0_TBTTR.
*/
#define	CANR_NTBTTR0	(CANR_N0_TBTTR)

/** \\brief  21C, Node Timer Clock Control Register */
#define CANR_N0_TCCR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TCCR*)0xF002821Cu)

/** Alias (User Manual Name) for CANR_N0_TCCR.
* To use register names with standard convension, please use CANR_N0_TCCR.
*/
#define	CANR_NTCCR0	(CANR_N0_TCCR)

/** \\brief  22C, Node Timer C Transmit Trigger Register */
#define CANR_N0_TCTTR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TTTR*)0xF002822Cu)

/** Alias (User Manual Name) for CANR_N0_TCTTR.
* To use register names with standard convension, please use CANR_N0_TCTTR.
*/
#define	CANR_NTCTTR0	(CANR_N0_TCTTR)

/** \\brief  220, Node Timer Receive Timeout Register */
#define CANR_N0_TRTR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TRTR*)0xF0028220u)

/** Alias (User Manual Name) for CANR_N0_TRTR.
* To use register names with standard convension, please use CANR_N0_TRTR.
*/
#define	CANR_NTRTR0	(CANR_N0_TRTR)

/** \\brief  310, Node Bit Timing Register */
#define CANR_N1_BTR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_BTR*)0xF0028310u)

/** Alias (User Manual Name) for CANR_N1_BTR.
* To use register names with standard convension, please use CANR_N1_BTR.
*/
#define	CANR_NBTR1	(CANR_N1_BTR)

/** \\brief  300, Node Control Register */
#define CANR_N1_CR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_CR*)0xF0028300u)

/** Alias (User Manual Name) for CANR_N1_CR.
* To use register names with standard convension, please use CANR_N1_CR.
*/
#define	CANR_NCR1	(CANR_N1_CR)

/** \\brief  314, Node Error Counter Register */
#define CANR_N1_ECNT /*lint --e(923)*/ (*(volatile Ifx_CAN_N_ECNT*)0xF0028314u)

/** Alias (User Manual Name) for CANR_N1_ECNT.
* To use register names with standard convension, please use CANR_N1_ECNT.
*/
#define	CANR_NECNT1	(CANR_N1_ECNT)

/** \\brief  318, Node Frame Counter Register */
#define CANR_N1_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_FCR*)0xF0028318u)

/** Alias (User Manual Name) for CANR_N1_FCR.
* To use register names with standard convension, please use CANR_N1_FCR.
*/
#define	CANR_NFCR1	(CANR_N1_FCR)

/** \\brief  308, Node Interrupt Pointer Register */
#define CANR_N1_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_IPR*)0xF0028308u)

/** Alias (User Manual Name) for CANR_N1_IPR.
* To use register names with standard convension, please use CANR_N1_IPR.
*/
#define	CANR_NIPR1	(CANR_N1_IPR)

/** \\brief  30C, Node Port Control Register */
#define CANR_N1_PCR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_PCR*)0xF002830Cu)

/** Alias (User Manual Name) for CANR_N1_PCR.
* To use register names with standard convension, please use CANR_N1_PCR.
*/
#define	CANR_NPCR1	(CANR_N1_PCR)

/** \\brief  304, Node Status Register */
#define CANR_N1_SR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_SR*)0xF0028304u)

/** Alias (User Manual Name) for CANR_N1_SR.
* To use register names with standard convension, please use CANR_N1_SR.
*/
#define	CANR_NSR1	(CANR_N1_SR)

/** \\brief  324, Node Timer A Transmit Trigger Register */
#define CANR_N1_TATTR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TTTR*)0xF0028324u)

/** Alias (User Manual Name) for CANR_N1_TATTR.
* To use register names with standard convension, please use CANR_N1_TATTR.
*/
#define	CANR_NTATTR1	(CANR_N1_TATTR)

/** \\brief  328, Node Timer B Transmit Trigger Register */
#define CANR_N1_TBTTR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TTTR*)0xF0028328u)

/** Alias (User Manual Name) for CANR_N1_TBTTR.
* To use register names with standard convension, please use CANR_N1_TBTTR.
*/
#define	CANR_NTBTTR1	(CANR_N1_TBTTR)

/** \\brief  31C, Node Timer Clock Control Register */
#define CANR_N1_TCCR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TCCR*)0xF002831Cu)

/** Alias (User Manual Name) for CANR_N1_TCCR.
* To use register names with standard convension, please use CANR_N1_TCCR.
*/
#define	CANR_NTCCR1	(CANR_N1_TCCR)

/** \\brief  32C, Node Timer C Transmit Trigger Register */
#define CANR_N1_TCTTR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TTTR*)0xF002832Cu)

/** Alias (User Manual Name) for CANR_N1_TCTTR.
* To use register names with standard convension, please use CANR_N1_TCTTR.
*/
#define	CANR_NTCTTR1	(CANR_N1_TCTTR)

/** \\brief  320, Node Timer Receive Timeout Register */
#define CANR_N1_TRTR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TRTR*)0xF0028320u)

/** Alias (User Manual Name) for CANR_N1_TRTR.
* To use register names with standard convension, please use CANR_N1_TRTR.
*/
#define	CANR_NTRTR1	(CANR_N1_TRTR)

























/** \\brief  E8, OCDS Control and Status */
#define CANR_OCS /*lint --e(923)*/ (*(volatile Ifx_CAN_OCS*)0xF00280E8u)

/** \\brief  1C4, Panel Control Register */
#define CANR_PANCTR /*lint --e(923)*/ (*(volatile Ifx_CAN_PANCTR*)0xF00281C4u)
/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXCAN_REG_H */
